{"id": "ad886f74-4a35-4f35-9d46-5e76d57d443f", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 1, "page_end": 1, "section": null, "lang": "en", "text": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?\nGetting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?\nYoung adults often experience limited financial resources, marked by relatively lower earnings and fewer assets, while at the same time experiencing major life events, struggling to make ends meet, and with a tendency toward a particular lifestyle. Looking at it from a positive perspective, debt facilitates the acquisition of assets and maintains a steady level of consumption. Although indebtedness is a normal phase in a young adult’s lifecycle, excessiveness of it can lead to serious consequences.\nStarting a career, buying a car, getting married, they are juggling significant life milestones, with a pursuing further education, buying a house, raising penchant for a specific lifestyle. These major life children – these are the usual major life events events require a huge amount of money and are young people face in their life. At this stage, they most likely financed through some forms of debt.\nhave relatively lower income and fewer assets, yet In making ends meet, young people may opt to", "created_at": "2025-10-09"}
{"id": "ff0bbcb2-bc44-4e24-8951-630aacbab8ab", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 1, "page_end": 2, "section": null, "lang": "en", "text": "re young people face in their life. At this stage, they most likely financed through some forms of debt.\nhave relatively lower income and fewer assets, yet In making ends meet, young people may opt to\n\nGetting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern? 2 Psychological Health and Financial The Current Situation to Ponder Upon Bank Negara Malaysia (BNM), in its Financial Consequences Table 1 Stability Review Second Half 2022, reported that enrolment in the Debt Management Programme Psychological Health Financial (DMP) of the Credit Counselling and Debt Consequences Consequences Management Agency (AKPK) rose to 34,670 Mental health disorders Risk of going into debt borrowers in 2022 from 23,711 in the previous traps year, an increase of 46.35 percent. Out of those Deteriorating family Reduction in credit who registered in the DMP, 15,600 (44.96 percent) relationships scores borrowers are aged between 30 and 39 years old Difficult social Delayed asset and 3,700 (10.66 percent) are in the 20 to 29 years interactions accumulation old age group.\nBeing declared bankrupt The Malaysian Department of Insolvency (MdI), in its most recent statistics, revealed that there are 33,388 cases of individual bankruptcy for a period borrow money especially when they are running from 2019 until February 2023, and 6,361 cases or low on funds to survive until the next pay check. 19.05 percent of them are represented by young adults aged below 25 years old and between", "created_at": "2025-10-09"}
{"id": "5c5ad8d7-fc81-434b-8c1e-2629e1f2d9ef", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 2, "page_end": 2, "section": null, "lang": "en", "text": "e running from 2019 until February 2023, and 6,361 cases or low on funds to survive until the next pay check. 19.05 percent of them are represented by young adults aged below 25 years old and between 25 to Moreover, at a young age, individuals often find 34 years old. The breakdown of bankruptcy cases themselves influenced by the lifestyle of their by sources of bankruptcy show that the top five peers in terms of the brands of clothes they wear, causes of bankruptcy are personal financing (49.31 the types of restaurants they frequent, and the percent), business financing (16.95 percent), vehicle gadgets they use. Keeping up with these trends hire-purchase (11.20 percent), home financing (8.23 can lead to their income becoming insufficient, percent) and credit card debt (6.44 percent). These and they end up using facilities like credit cards, statistics by AKPK and MdI provide an indication personal loans, easy payment schemes, and buy- that a considerable number of young adults are now-pay-later (BNPL) schemes to address their having difficulties with their debts.\nfinancial issues.\nDebt Management Programme From a positive angle, debt plays a role in Approved by Agensi Kaunseling helping individuals acquire assets and better dan Pengurusan Kredit (AKPK) manage their spending. For example, with Figure 1 housing loans or mortgages, young adults can purchase a house through instalments over\n\nan extended period. Hence, debt enables asset acquisition and wealth accumulation.", "created_at": "2025-10-09"}
{"id": "fd233302-1fd0-41d5-8aac-538b1537147b", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 2, "page_end": 3, "section": null, "lang": "en", "text": "g. For example, with Figure 1 housing loans or mortgages, young adults can purchase a house through instalments over\n\nan extended period. Hence, debt enables asset acquisition and wealth accumulation.\n\nIn addition, debt can facilitate and maintain a steady standard of living in situations where 5.5 the income is inadequate to meet basic needs, 30 as well as during emergencies. Easy payment 5.1 schemes provided by credit card issuers, for 25 9.9 example, enables the purchase of household 4.6 items through either zero-interest or low-interest 20 8.1 monthly payments.\n6.5\n\nIt is common for young adults to carry consumer debts such as car loans, housing loans, education 15.6 10 12.6 loans, and credit cards because they are at 9.8 the stage of starting a life and in the process of accumulating assets and building up their 5 career. Although indebtedness among young 4 2.9 3.7 adults is a natural part of the lifecycle, excessive 0 indebtedness can lead to serious consequences. 2020 2021 2022 If the debts are unmanageable, there is a potential 20-29 years old 30-39 years old risk that young adults may fall into detrimental 40-49 years old ≥50 years old psychological health consequences and adverse financial consequences.\nSource: Financial Stability Review – Second Half 2022 )sdnasuohT( slaudividnI fo .oN", "created_at": "2025-10-09"}
{"id": "0e337190-6c87-46d2-b0c0-e5e32fd3da11", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 3, "page_end": 3, "section": null, "lang": "en", "text": "nto detrimental 40-49 years old ≥50 years old psychological health consequences and adverse financial consequences.\nSource: Financial Stability Review – Second Half 2022 )sdnasuohT( slaudividnI fo .oN\n\n3 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?\nIndividual Bankruptcy Cases by Age Group from 2019 until February 2023 Figure 2 15,000 12,811 8,922 10,000 6,255 5,186 5,000 106 108", "created_at": "2025-10-09"}
{"id": "f939d208-ecbc-4500-8989-25167cce7a42", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 3, "page_end": 4, "section": null, "lang": "en", "text": "t at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?\nIndividual Bankruptcy Cases by Age Group from 2019 until February 2023 Figure 2 15,000 12,811 8,922 10,000 6,255 5,186 5,000 106 108\n\nBelow 25-34 35-44 45-54 55 years old No available 25 years old years old years old years old and above information Cases Source: Malaysian Department of Insolvency (MdI) Individual Bankruptcy Cases by Sources of Bankruptcy from 2019 until February 2023 Figure 3 Corporate Guarantor 1.90% EPF Contribution 0.95% Tax Debt 2.20% Education Financing/Scholarship 1.90% Other Debts 2.58% Social Guarantor 0.05% Credit Card Debt 6.44% Home Finance 18.23% Personal Financing 49.31% VehicleHire-Purchase 11.20% Business Financing 16.95% Source: Malaysian Department of Insolvency (MdI) The Ease of Having Access to Credits and the Super Sale, Malaysia Mega Sale Carnival, Malaysia Convenience Associated With it, Fuel Impulsive Year-End-Sale, Single’s Day 11.11 Sale, and 12.12 Buying Behaviours and Lead to the Problem of Sale, including festival-related sales during Hari Indebtedness Among Young Adults. Raya, Chinese New Year, Deepavali and Christmas, among others.\nToday, getting access to credit is relatively easier with the availability of credit cards, electronic According to the Malaysia Market Insight Report payment facilities and buy-now-pay-later (BNPL) 2022, Malaysians are shifting their purchasing schemes. These credit facilities are closely tied to habits away from traditional brick-and", "created_at": "2025-10-09"}
{"id": "56d90965-135f-4c99-a2fc-097dc345f8fb", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 4, "page_end": 4, "section": null, "lang": "en", "text": "nsight Report payment facilities and buy-now-pay-later (BNPL) 2022, Malaysians are shifting their purchasing schemes. These credit facilities are closely tied to habits away from traditional brick-and-mortar consumption behaviour and current trends. Mega stores and moving toward online shopping. The sales are quite common in Malaysia, and shoppers report states that Malaysians are deemed to be are accustomed to waiting for these major sales to bargain hunters, as evidenced by huge traffic get good bargains. Among them are the Malaysia spikes in online market places on specific dates of", "created_at": "2025-10-09"}
{"id": "5676fd56-164e-4ce6-9da3-1e592ffe3660", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 4, "page_end": 4, "section": null, "lang": "en", "text": "o be are accustomed to waiting for these major sales to bargain hunters, as evidenced by huge traffic get good bargains. Among them are the Malaysia spikes in online market places on specific dates of\n\nGetting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern? 4 major sales such as on the 11.11 sales, where 60 that they have being grappling with indebtedness to 70 percent of these huge traffics are converted problems since they were younger. From a human into actual purchases. The surge in these figures lifecycle perspective, young adults are typically in is propelled by a variety of payment options, a phase of accumulating wealth, with a long way including credit cards, online bank transfers, to go in life. If they are declared bankrupt, their e-wallets, and BNPL schemes, which allow for financial future might be compromised.\nquick and easy checkouts.\nPersonal financing has been identified as the In recent years, BNPL has emerged as a new type leading cause of bankruptcy cases. Other major of easy payment scheme that allows shoppers to sources of bankruptcy are business financing, split their payments into three equal instalments, vehicle hire-purchase, home financing, and credit for instance. According to BNM’s Financial card debt. A majority of these are consumptionStability Review Second Half 2022, four major non- related financing that facilitate individuals to bank BNPL players control 96 percent of the total accumulate assets and to achieve a d", "created_at": "2025-10-09"}
{"id": "108441b8-a26b-414c-88c4-5cbe5d2475fe", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 4, "page_end": 4, "section": null, "lang": "en", "text": "re consumptionStability Review Second Half 2022, four major non- related financing that facilitate individuals to bank BNPL players control 96 percent of the total accumulate assets and to achieve a desired BNPL transaction values. According to the same lifestyle. The ease of obtaining credit, combined report, 44 percent of BNPL users are between with the convenience of using it online, encourages the ages of 18 and 30. It is a matter of concern impulsive purchasing behaviour, particularly in that the proportion of BNPL users with overdue online shopping. Engaging in impulsive purchasing payments is also increasing, from 7 percent in the may lead to debt accumulation, and it can escalate fourth quarter of 2021 to 14 percent in the second to indebtedness. Therefore, young adults must quarter of 2022, and finally to 17 percent in the always be wary of the consequences of having fourth quarter of 2022. excessive and unmanageable debt.\nAge vs Indebtedness Accumulation of Excessive Debt at a Young Indebtedness among young adults is a growing Age Will Lead to Financial and Psychological concern in Malaysia. As highlighted in the Consequences.\nprevious section, individuals under AKPK’s Debt Management Programme (DMP) were those • Distort the accumulation of wealth – one ranging from ages 20 to 39, which accounts for reason is that, a portion of the hard-earned 55.62 percent of the total DMP enrolment as of income must be directed towards loan the second half of 2022, 44.96 percent f", "created_at": "2025-10-09"}
{"id": "b12f92d2-19a7-42aa-93e0-5dfb05cbb1af", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 4, "page_end": 5, "section": null, "lang": "en", "text": "s 20 to 39, which accounts for reason is that, a portion of the hard-earned 55.62 percent of the total DMP enrolment as of income must be directed towards loan the second half of 2022, 44.96 percent for those repayment instead of investing in incomebetween 30 to 39 years old, and 10.66 percent generating assets. Another reason is the came from the age range of 20 to 29 years old. potential risk that some of the assets might be repossessed by the creditors in loan default Based on the report released by the Malaysian situations.\nDepartment of Insolvency (MdI) in 2023, young adults aged 34 years old and below represent • Get caught in a debt trap – a debt trap refers 19.05 percent of total bankruptcy cases and ranks to a situation where an individual takes a new the third highest age group in these cases. The debt to cover the existing debts. This normally highest number of bankruptcy cases is recorded occurs when the individual is unable to meet for the age group of between 35 to 44 years the current obligations under existing debts, old with 12,811 cases or 38.37 percent of total prompting them to seek other borrowing bankruptcy cases. alternatives.\nBankruptcy is the legal status marked by a court • Lower credit score – a high level of debt order, attained by individuals who are unable to service ratio (DSR) and late payment may lower meet their loan obligations. Prior to the filing an individual’s credit score, which makes it of a bankruptcy notice in court, creditors would", "created_at": "2025-10-09"}
{"id": "66df440c-baa5-4885-9e44-01b877cec71a", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 5, "page_end": 5, "section": null, "lang": "en", "text": "unable to service ratio (DSR) and late payment may lower meet their loan obligations. Prior to the filing an individual’s credit score, which makes it of a bankruptcy notice in court, creditors would harder for them to obtain credit in the future.\nhave sought a civil judgment on the individual for being delinquent on the debt payment through • Financial stress – being in debt could lead to civil court proceedings. The entire process, from financial stress which could affect the mental civil court proceedings to bankruptcy filing, to the health, relationship, and overall well-being of issuance of a court order is lengthy, which means young adults.\nthat bankrupt individuals have had to be privy to the problems of indebtedness long before the • Delay life milestones – being in debt may legal proceedings against them. The age group delay certain important life milestones such as of between 35 to 44 years old, who represent the getting married, having children, and pursuing highest age group of bankruptcy cases, suggests further education.", "created_at": "2025-10-09"}
{"id": "162a6e81-4961-48c8-9c2d-4319e32ac79d", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 5, "page_end": 6, "section": null, "lang": "en", "text": "ain important life milestones such as of between 35 to 44 years old, who represent the getting married, having children, and pursuing highest age group of bankruptcy cases, suggests further education.\n\n5 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?\nin the economy, and the level of household • Reduce the quality of life – young adults may debt of a country is normally measured by the be compelled to sacrifice their quality of life to household debt as a percentage of the gross make debt payments. For example, they might domestic products (GDP). Malaysia has recorded need to get part-time jobs to earn more money a high household debt as a percentage of GDP to cover their living expenses and to repay their in the past few years with ratios of more than 80 loans. percent since 2012. The highest household debt as a percentage of GDP was recorded in 2020 at • Being declared bankrupt – the worst 93.32 percent. Recent data shows that Malaysia’s consequence of high indebtedness is being household debt as a percentage of GDP stands declared bankrupt, which can lead to financial at 81.2 percent for the second half of 2022, with stress and reduced social welfare. Bankrupt residential properties financing contributing the individuals face several restrictions, including most with 59.7 percent of the overall household the transfer of all their assets and properties debt in Malaysia. Personal financing accounts for to the Director General of Insolvency", "created_at": "2025-10-09"}
{"id": "278f0782-5de7-4411-bd98-1a7e9a2ccf09", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 6, "page_end": 6, "section": null, "lang": "en", "text": "tions, including most with 59.7 percent of the overall household the transfer of all their assets and properties debt in Malaysia. Personal financing accounts for to the Director General of Insolvency (DGI). 12.8 percent, motor vehicles financing accounts for Furthermore, they are not allowed to be 12.7 percent, non-residential properties financing appointed as directors or involved in the accounts for 5.6 percent, securities financing management of a company, and are not accounts for 5.2 percent, while credit cards allowed to travel overseas unless with the DGI’s represent 2.8 percent, and other debts constitute permission. 1.2 percent of the total household debt. Research has found that a high-level of household debts of All these consequences are the direct impact of a country causes instability to the financial system indebtedness on the individuals’ well-being. The and depresses the economic growth, apart from consequences of individual indebtedness extend deteriorating social and psychological health.\nbeyond personal finances, as it also has an impact It is, therefore, very important to address the on the financial system and on the economy, as issue of indebtedness especially among young discussed in numerous academic research. At adults because of the damaging consequences the aggregate level, household debt signifies to the individuals, the financial system, and the the consumer debts within the household sector economy.\nComposition of Household Debt by Purpose - Sec", "created_at": "2025-10-09"}
{"id": "4b8400ef-b7fc-4018-ac6c-31b70aee1460", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 6, "page_end": 6, "section": null, "lang": "en", "text": "s the aggregate level, household debt signifies to the individuals, the financial system, and the the consumer debts within the household sector economy.\nComposition of Household Debt by Purpose - Second Half of 2022 Figure 4 Others 1.2% Credit Cards 2.8% Motor Vehicles 12.7% Personal Financing 12.8% Residential Properties 59.7% Securities 5.2% Non-Residential Properties 11.20% Source: Financial Stability Review Second Half 2022", "created_at": "2025-10-09"}
{"id": "79eea939-12aa-44d1-84b3-dfdcd96b1f9b", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 6, "page_end": 6, "section": null, "lang": "en", "text": "1.2% Credit Cards 2.8% Motor Vehicles 12.7% Personal Financing 12.8% Residential Properties 59.7% Securities 5.2% Non-Residential Properties 11.20% Source: Financial Stability Review Second Half 2022\n\nGetting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern? 6 Who Plays a Key Role in Addressing the Issue providing support when the borrowers have of Indebtedness Among Young Adults? repayment difficulties. Transparency of financing The issue of indebtedness among young adults rates, fees, and charges, will ensure that loan requires attentions from various parties – not only providers provide significant information by the individuals themselves, but also education to their borrowers for them to make better providers, loan providers, and the government borrowing decisions. Responsible lending through its regulatory bodies. should go together with financial education, for example, prospective loan applicants could • Young adults – young adults should take undergo brief readings or videos on financial the necessary efforts to be equipped with literacy topics and subsequently be assessed to financial knowledge for them to acquire basic determine their financial literacy level as a prefinancial planning skills. Financial planning is an requisite of loan approval. This may enhance essential life skill because managing one’s own the loan approval process to ensure a more financial matters is an integral aspect of life. thorough evaluation on the suitability", "created_at": "2025-10-09"}
{"id": "de9d45f3-8525-4cee-9c10-2a32267fa813", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 6, "page_end": 7, "section": null, "lang": "en", "text": "al. This may enhance essential life skill because managing one’s own the loan approval process to ensure a more financial matters is an integral aspect of life. thorough evaluation on the suitability of the Financial knowledge can be acquired either by potential borrowers.\nattending seminars conducted by accredited trainers, by reading newspapers, magazines, • The government through its regulatory and websites, or by watching videos on bodies – the Malaysian government has social media. Numerous certified financial implemented several regulations on the professionals regularly share their financial adoption of lending practices. Bank Negara planning knowledge on social media platforms, Malaysia, for example, has introduced measures offering resources valuable for young adults. to limit the amount of credit that individuals Additionally, young adults can adopt proactive can access based on their income, as well as measures to prevent excessive debt, such as to regulate credit card marketing practices.\navoiding unnecessary expenses, limiting the use To enhance past efforts, the government may of credit cards, and establishing and adhering control credit access by regulating fringe or to a budget. Young adults need to be aware shadow lending activities. There are lending on the avenues where they can seek credit activities that are provided by non-banks counselling in case of financial difficulties, such and are not under the regulation of the Bank as going to the Credit Counsel", "created_at": "2025-10-09"}
{"id": "ff48ae53-ab36-4508-a63e-aeb2b5e33a7d", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 7, "page_end": 7, "section": null, "lang": "en", "text": "ues where they can seek credit activities that are provided by non-banks counselling in case of financial difficulties, such and are not under the regulation of the Bank as going to the Credit Counselling and Debt Negara Malaysia, often charging higher rates Management Agency (AKPK). of interest. They are either regulated by other authorities or in some cases, even unregulated.\n• Education providers – institutions of higher With the situations of high household debt and learning, training providers, and training arms high bankruptcy cases in recent years, it is the of regulatory bodies can play an eminent role right time to regulate shadow lending activities in instilling financial literacy and debt literacy in Malaysia.\namong young adults, for instance, topics on money management, borrowings and interest Our Opinion calculation, the importance of savings and Addressing the issue of debts among young investments, and the power of compounding. adults requires a multifaceted approach that In a press release on 17 February 2023, the includes financial education and government Credit Counselling and Debt Management regulations. It is crucial to provide young adults Agency (AKPK) stated that 41.8 percent of with financial education to enhance their financial people aged 30 to 40 years old face financial literacy.\ndifficulties, due to the lack of knowledge in financial management. Therefore, it is essential They should be given a basic understanding of to educate young adults to im", "created_at": "2025-10-09"}
{"id": "9080170f-c8db-4ec0-b02d-2d49381a1715", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 7, "page_end": 7, "section": null, "lang": "en", "text": "old face financial literacy.\ndifficulties, due to the lack of knowledge in financial management. Therefore, it is essential They should be given a basic understanding of to educate young adults to improve their money management, investing, borrowing, and financial literacy. The strategy and approach of the time value of money, as well as the ability to educating young people should be creatively apply that knowledge effectively. Individuals with designed to capture their interest, and this can good financial literacy can better manage their be done through online games, social media day-to-day finances and avoid financial difficulties.\nposts, and interactive videos.\nThe government‘s regulatory bodies may • Loan providers – banks and other lending implement stricter credit assessments and institutions can improve their current practice oversee shadow lending activities. Furthermore, of responsible lending by being more the regulatory bodies can take steps to encourage transparent on product disclosure, scrutinising lending institutions to adopt responsible lending the affordability of potential borrowers, and practices.", "created_at": "2025-10-09"}
{"id": "6abbc3b4-e13a-4d74-b060-b54f1ff2f79e", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 7, "page_end": 7, "section": null, "lang": "en", "text": "regulatory bodies can take steps to encourage transparent on product disclosure, scrutinising lending institutions to adopt responsible lending the affordability of potential borrowers, and practices.\n\n7 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?\nCollaboration between the government’s facing financial difficulties, it is advisable for them regulatory bodies, the financial education to seek guidance from AKPK’s qualified financial providers, and the loan providers can help ensure counsellors. AKPK also offers Debt Management that young Malaysians improve their financial Programmes (DMP) catered to young adults with literacy and promote responsible borrowing to debt-related issues to alleviate their debt burden.\nprevent financial problems at a young age and to It is rather typical for young adults to borrow safeguard the financial well-being of young adults. money at this phase of their life where they are facing major life events and seeking lifestyle Further information on financial literacy and well- aspirations, as they have relatively lower income being can be obtained from AKPK’s e-learning and fewer assets to meet their needs. While portal at https://power.akpk.org.my/eLearning/ borrowing is common, young adults need to Home/BrowseElearnings. Individuals can also maintain control of their spending and borrowing.\nattend public events organised by AKPK, such Without it, they may be caught in a debt trap and as corporate workshops an", "created_at": "2025-10-09"}
{"id": "683c2465-f113-4f70-a1bf-0f6bc7606022", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 1, "page_end": 7, "section": null, "lang": "en", "text": "arnings. Individuals can also maintain control of their spending and borrowing.\nattend public events organised by AKPK, such Without it, they may be caught in a debt trap and as corporate workshops and seminars, to gain may be subjected to a deteriorating financial and and enhance their financial knowledge. For those social well-being.\nABOUT THE AUTHOR Mahdhir Abdullah is a lecturer at Islamic Science University of Malaysia (USIM) Academic Team, Capital Market and Wealth Management, Islamic Banking & Finance, Islamic Finance, Faculty of Economics and Muamalat.\nmahdhir@usim.edu.my References Agensi Kaunseling dan Pengurusan Kredit. (2022, July 12). Look before you leap into debts. The Star.\nhttps://www.akpk.org.my/look-you-leap-debts.\nAgensi Kaunseling dan Pengurusan Kredit. (2023, February 17). AKPK : Thirty-nine institutions of higher learning offer personal financial management course. The Star. https://www.akpk.org.my/akpkthirty-nine-institutions-higher-learning-offer-personal-financial-management-course.\nBank Negara Malaysia. (2023). Financial Stability Review Second Half 2022. In Intellectual Property. http:// www.eestipank.info/pub/en/dokumendid/publikatsioonid/seeriad/finantsvahendus/_2004_1/ fsy_504.pdf.\nBunn, P., & Rostom, M. (2014). Household debt and spending. Bank of England Quarterly Bulletin, 54(3), 304–315. http://search.ebscohost.com/login.aspx?direct=true&db=bth&AN=98503635&lang=e s&site=ehost-live.\nCommissionfactory. (2021). Malaysia Market Insight Report.\nM", "created_at": "2025-10-09"}
{"id": "56e25205-d755-43ae-ac66-ac8fadcc814c", "doc_id": "d8401831-76b8-42a0-aff0-c999a970d264", "title": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?", "source_file": ".\\pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "page_start": 1, "page_end": 7, "section": null, "lang": "en", "text": "England Quarterly Bulletin, 54(3), 304–315. http://search.ebscohost.com/login.aspx?direct=true&db=bth&AN=98503635&lang=e s&site=ehost-live.\nCommissionfactory. (2021). Malaysia Market Insight Report.\nMalaysia Department of Insolvency. (2023). Bankruptcy Statistic as at February 2023.\nMian, A., Sufi, A., & Verner, E. (2017). Household debt and business cycles worldwide. Quarterly Journal of Economics. https://doi.org/10.1093/qje/qjx017.\nRani, M. S. A., Nordin, S. H. B., Chin Ching Lau, Sheng Ling Lim, & Zhen Shing Siow. (2017). Rich debt, poor debt: Assessing household indebtedness and debt repayment capacity. Bank for International Settlements Papers, 91, 153–168. http://www.bis.org/publ/bppdf/bispap91.pdf#page=167.\nZabai, A. (2017). Household debt: Recent developments and challenges. BIS Quarterly Review, December, 39–54.\nZainol, Z., Daud, Z., Nur, A., Nizam, H. K., Rashid, R. A., & Alias, N. (2016). Exploring Factors that Contribute to Individual Indebtedness among Young Muslims. International Journal of Economics and Financial Issues, 6(S7), 320–328. http: www.econjournals.com.", "created_at": "2025-10-09"}
