{"id": "ca439b02-85f2-4c0d-bd7b-0daadad579dc", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 1, "page_end": 1, "section": null, "lang": "en", "text": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potential to improve financial accessibility and resilience, with digital financial literacy being a crucial aspect.\nWhat is Digital Financial Literacy? financial literacy. Even though many Malaysians Digital financial literacy is a blend of digital and use technology and are more confident in using financial literacy, focusing on the use of digital digital channels, certain safety precautions may be technologies and financial skills such as personal overlooked. Therefore, even if they are immersed financial management, budgeting, and investing. in the digital economy, they may not be digitally It involves the acquisition of knowledge, skills, literate. This is evidenced by the nearly daily media confidence, and competencies to make informed coverage of online frauds such as the Macau scam, decisions using digital and financial applications. investment and loan scams, love scams, and even mule account activities that prey on vulnerable Access to digital banking products and services Malaysians and frequently involve large sums of is highly dependent on the level of digital and money.", "created_at": "2025-10-09"}
{"id": "ce250a1a-7eed-4b7c-be02-95a31ac2c391", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 1, "page_end": 2, "section": null, "lang": "en", "text": "n mule account activities that prey on vulnerable Access to digital banking products and services Malaysians and frequently involve large sums of is highly dependent on the level of digital and money.\n\nDigital Financial Literacy Fuels Financial Resilience 2 The Pandemic Caused the Rise of Digital Banking As a result, the rapid increase in digitalisation Which Necessitates Digital Financial Literacy underscores the significance of digital financial Digital banking is the digitalisation of classic banking literacy for effective transaction management activities and services, which are traditionally available and security measures, thereby strengthening in physical branches. Digital financial services financial resilience.\nare enhancing global financial accessibility and resilience, enabling individuals to manage Current Digital Financial Behaviour of Malaysians and recover from financial shocks, ultimately The FCI 2021 report revealed startling findings contributing to their financial well-being. about Malaysians’ susceptibility to online financial transactions. Based on the FCI survey, one-third The COVID-19 pandemic has significantly of those polled are willing to share their sensitive accelerated the digitalization of Malaysia’s information such as bank account passwords or PIN financial services industry. KPMG’s early pandemic numbers with close friends, and nearly two-thirds survey (Business Insider, 2020) discovered that do not consider a website’s security features befor", "created_at": "2025-10-09"}
{"id": "4620e163-60ff-4aba-9638-96efd2d6bfde", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 2, "page_end": 2, "section": null, "lang": "en", "text": "financial services industry. KPMG’s early pandemic numbers with close friends, and nearly two-thirds survey (Business Insider, 2020) discovered that do not consider a website’s security features before 77% of Malaysians considered digital banking as conducting online transactions. This suggests that the next development in financial services, 82% Malaysians tend to be trusting individuals, even have already used internet banking facilities, and though deciding whom to trust is one of the most similarly, 82% are willing to open online accounts important life skills for them to have.\nregulated by Bank Negara Malaysia (BNM).\nAnother survey carried out a year later by the In addition, Malaysians do not bother to check Financial Capability and Inclusion Demand whether the website on which they are making Side Survey 2021 (FCI 2021) revealed that many payments is legitimate and trustworthy. Accordingly, Malaysians are using digital financial services these people are far more likely to be duped into post-pandemic. Another similar observation entering their banking information through a bogus is provided by the World Bank’s Global Findex website. This in turn enables fraudsters to commit Survey (2021), which reports that 79% of fraud with customers’ data. Even worse, fraudsters Malaysian adults used digital payments, 42% of are now becoming more skilled at exploiting whom were doing so for the first time because technology and targeting victims, particularly of the pandemic. those w", "created_at": "2025-10-09"}
{"id": "3efa3bba-6d62-4c84-ae74-c393c6604876", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 2, "page_end": 2, "section": null, "lang": "en", "text": "n adults used digital payments, 42% of are now becoming more skilled at exploiting whom were doing so for the first time because technology and targeting victims, particularly of the pandemic. those with a nonchalant attitude and a lack or low awareness of cybercrime via online methods.\nFintech Malaysia’s (2022) latest report also recorded 27.4 million internet users by January As a result of that troubling and deeply concerning 2022, with internet banking quadrupling in situation, several parties have expressed concern the last decade and usage rates rising to over about Malaysians’ digital financial literacy level.\n100% during the 2020 pandemic alone. Online BNM stated in a recent press conference that the banking penetration was at 112.5%, while low, limited, and very concerning level of digital mobile banking penetration stood at 61.8%. financial literacy among Malaysians, combined Another recent report by Agensi Kaunseling dan with their low awareness, trust, and confidence Pengurusan Kredit (AKPK) (2022) also confirmed in digital services, are preventing them from that the pandemic has prompted Malaysians confidently using digital financial services and to embrace digital technology as they surfed participating in the digital economy.\nand shopped digitally, leading to an increase in online purchases and spending. Since then, Recent Initiatives in Promoting Digital Financial a vast majority of Malaysians have used and are Literacy comfortable with using the internet and", "created_at": "2025-10-09"}
{"id": "8b6e64bb-2991-4d49-a9fb-78da377036ea", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 2, "page_end": 3, "section": null, "lang": "en", "text": "crease in online purchases and spending. Since then, Recent Initiatives in Promoting Digital Financial a vast majority of Malaysians have used and are Literacy comfortable with using the internet and mobile Digitalisation, in fact, began long before the banking services for their daily transactions. pandemic. Unfortunately, Malaysians, including Due to the reliance on mobile banking, online businesses, are falling short of the government’s mobile banking has surpassed social media as digitalisation goals. Therefore, to enhance the the second most popular application (ASEAN digitalisation of the country’s financial services, Digital Generation Report, 2022). the government and its agencies have consistently made efforts through various initiatives.\nAdditionally, digital financial services growth in Malaysia has fronted to 98% of small merchants One such initiative is the establishment of the and businesses accepting digital payments, Financial Education Network (FEN) in 2016. FEN is favouring them for efficiency, time savings, and an inter-agency collaboration co-chaired by BNM cost-effectiveness. The acceptance of digital and the Securities Commission Malaysia (SC), with payments has catalysed the use of other digital founding members that include the Ministry of financial services, such as savings and borrowing. Education (MOE), Perbadanan Insurans Deposit", "created_at": "2025-10-09"}
{"id": "53d44601-0718-4f95-badc-7d98e5c0d01f", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 3, "page_end": 3, "section": null, "lang": "en", "text": "(SC), with payments has catalysed the use of other digital founding members that include the Ministry of financial services, such as savings and borrowing. Education (MOE), Perbadanan Insurans Deposit\n\n3 Digital Financial Literacy Fuels Financial Resilience Malaysia (PIDM), the Employees Provident Fund risen to 17% in the second half of 2022, compared (EPF), AKPK, and Permodalan Nasional Berhad to 14% in the second quarter (Q2) of 2022 and 7% (PNB). FEN focuses primarily on financial literacy in Q4 of 2021. The schemes continue to target and did not initially prioritise digital financial selected segments of Malaysian households, literacy until recently, when it emerged as a global with a majority of users being younger and lowerconcern. income borrowers. BNM said that about 44% of BNPL users are aged between 18 and 30. More With the goal of promoting prudent financial than 80% of BNPL users earn less than RM3,000 a management attitudes and behaviours, and month and are more susceptible to financial stress.\ntowards improving the financial literacy among Malaysians, FEN had developed a five-year The current level of digital financial literacy among National Financial Literacy Strategy from 2019 Malaysians will exacerbate rising cybercrime and to 2023. Various campaigns and roadshows have out-of-control impulse purchases. Several groups been designed, such as Financial Literacy Month have been identified as being digitally underserved (FLM), which is a monthly event in October", "created_at": "2025-10-09"}
{"id": "d597e7d9-71c4-4e04-90b5-4657a5ff5351", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 3, "page_end": 3, "section": null, "lang": "en", "text": "ws have out-of-control impulse purchases. Several groups been designed, such as Financial Literacy Month have been identified as being digitally underserved (FLM), which is a monthly event in October aimed and lacking digital and financial literacy. According at raising consumer awareness and improving to media reports, the elderly, women, and young financial literacy, including digital literacy among generations are the most vulnerable and easily Malaysians. preyed upon.\nIssues to Be Addressed Most elderly people are either not digitally literate Despite the significant increase in digital financial or savvy enough to protect their personal and usage, which is highly beneficial, Malaysians’ sensitive data from being exposed. Seniors living current digital financial behaviour is concerning. alone are at greater risk of becoming victims of The digitalisation of commerce and banking has financial fraud because they lack social support/ opened doors to cybercrime. According to Polis networks, and, not least, technological illiteracy.\nDiraja Malaysia (PDRM), cases of online fraud are Nevertheless, even where digital literacy is present, on an upward trend and worrying (Salleh, 2022). older people remain vulnerable and susceptible The PDRM Commercial Crimes Investigation if they are not savvy or vigilant enough (based Department (CCID) reported that 71,833 fraud on heightened awareness and/or experience) to cases were recorded from 2020 to May 2022. respond to the tactics of fraud", "created_at": "2025-10-09"}
{"id": "e728cecb-1649-4c52-b95e-2f77461a84bf", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 3, "page_end": 4, "section": null, "lang": "en", "text": "ot savvy or vigilant enough (based Department (CCID) reported that 71,833 fraud on heightened awareness and/or experience) to cases were recorded from 2020 to May 2022. respond to the tactics of fraudsters as embodied Online fraud accounted for 48,850 cases, or 68% in phishing.\nof all frauds, with 26,213 cases being tried in court.\nWomen, despite being educated and professional, The internet has also become more appealing, are also a popular target for con artists. Some luring people to overspend. With the increased women fall victim to online romance scams and availability of online shopping via various platforms, love scams because they are lonely, while others including social media, the proclivity to make enjoy the thrill of an adventure or are even attracted impulsive purchases has increased, making it nearly to the idea of being in a relationship and in love.\nimpossible to avoid. The situation is deteriorating Scammers use these women’s trust and feelings further as more “buy-now-pay-later” (BNPL) services to gain access to their financial resources through has become available, raising fears that many internet love fraud.\npeople will become trapped in a long-term debt trap. BNPL options are available in a variety of Even though the younger generations are digital retail sectors, from fashion to travel, and are natives, they are not immune and are frequently offering alternative payment methods and, in some cases, interest-free terms. The trend, which has been accelerat", "created_at": "2025-10-09"}
{"id": "3578c653-4d57-4314-b483-acff65c68a55", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 4, "page_end": 4, "section": null, "lang": "en", "text": "ctors, from fashion to travel, and are natives, they are not immune and are frequently offering alternative payment methods and, in some cases, interest-free terms. The trend, which has been accelerated by the COVID-19 pandemic and exacerbated by rising income inequality, is beneficial for many Malaysians seeking to stretch their ringgit without incurring additional long-term debts.\nBNM (2023) stated in its Financial Stability Review report that there is an increasing trend in missed repayments among selected larger BNPL players, implying that such risks are increasing. The central bank said that the share of BNPL users with overdue payments in the fourth quarter (Q4) of 2022 had", "created_at": "2025-10-09"}
{"id": "cb936fa6-1807-48f4-81a0-0bd405004224", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 4, "page_end": 4, "section": null, "lang": "en", "text": "repayments among selected larger BNPL players, implying that such risks are increasing. The central bank said that the share of BNPL users with overdue payments in the fourth quarter (Q4) of 2022 had\n\nDigital Financial Literacy Fuels Financial Resilience 4 duped by scams. Because the younger generation Hence, the integration of digital financial literacy has grown up with online services, their increased into educational programmes, workplace training, vigilance, trust, and reliance on them makes them community outreach initiatives, and online resources more vulnerable to scams if they are unaware of can equip individuals of all ages with the necessary the tactics used by the scammers. For example, knowledge and skills for responsible financial college and university students who are struggling decisions in the digital age. Consequently, ongoing financially and feel pressured to keep up with their efforts to adapt financial literacy programmes to the peers are more likely to be scammed because they evolving digital landscape should be maintained, are drawn in by the promise of quick and easy as they are critical in dealing with new financial money and good deals. technologies and trends.\nLower-income or marginalised communities are Way Forward another group that must not be overlooked. They Technology is extremely important nowadays.\nfrequently have limited access to digital financial People are being forced to digitalise whether they services or lack the knowledge and skill", "created_at": "2025-10-09"}
{"id": "d574a760-dae6-4842-8255-912ca34428b4", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 4, "page_end": 4, "section": null, "lang": "en", "text": "looked. They Technology is extremely important nowadays.\nfrequently have limited access to digital financial People are being forced to digitalise whether they services or lack the knowledge and skills required like it or not, hence navigating the digital world is to use them effectively. critical. With the proliferation of mobile and other digital financial products, the continued expansion Consequences of digital financial services, and the growth of Digital financial literacy is crucial today as all the gig economy, in which individuals take more financial services and products are now accessible responsibility for their own financial planning, in digital form in nearly all global economies. making it critical for consumers to be digitally Technological innovation is rapidly transforming financially literate to effectively use digital financial various sectors, especially the finance industry, technology products and services and avoid online necessitating a significant increase in digital fraud and costly mistakes.\nliteracy knowledge to effectively navigate these technological advancements. At the consumer level, they must learn and practise good cybersecurity habits to avoid becoming The absence of digital financial literacy gives a victim of fraud. On a macro level, all parties, rise to a series of problem, affecting not only the including the government, regulators, agencies, individuals but also the society and the country as society, and the public, must collaborate", "created_at": "2025-10-09"}
{"id": "42fd9a60-8f12-4c01-8e88-ef84900d4970", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 4, "page_end": 5, "section": null, "lang": "en", "text": "ties, rise to a series of problem, affecting not only the including the government, regulators, agencies, individuals but also the society and the country as society, and the public, must collaborate to a whole. For instance, in the previous two years promote digital financial literacy among citizens to (2020 - 2022), a substantial loss of RM5.2 billion increase access to, and utilisation of digital financial were reported in the country due to online scam services while maintaining financial inclusion gains.\ncases. The following are among the initiatives that can be undertaken:\nTherefore, greater financial sophistication is • Initiate awareness campaigns to educate the required to effectively use financial technology public about mitigation measures, available products and services and avoid costly financial support programmes, consumer protection mistakes and frauds such as phishing, hacking, issues, complaints, and redress mechanisms unauthorised use of data, discriminatory treatment, and possible risks.\nand behavioural issues such as excessive borrowing. • Engage with providers of digital financial Consequently, to be highly financially literate, services by promoting responsible business they must first be digitally and financially literate practices and raising public awareness of to understand the technological constraints, relevant risk issues and mitigation measures.\nrisks, and hazards associated with internet-based • Make extensive use of digital networks and financ", "created_at": "2025-10-09"}
{"id": "505ec573-66c1-4a48-867d-701d71e994ba", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 5, "page_end": 5, "section": null, "lang": "en", "text": "ness of to understand the technological constraints, relevant risk issues and mitigation measures.\nrisks, and hazards associated with internet-based • Make extensive use of digital networks and financial transactions. media to spread digital financial literacy outreach.\nThe importance of digital financial literacy should • Consider using celebrities and social media be immediately recognised, as failure to do so can influencers as digital financial literacy campaign result in significant financial consequences. High endorsers.\nlevels of online scams can damage consumer trust, lower e-commerce sales, and negatively In a nutshell, digital financial literacy provides impact foreign investment and international individuals with the necessary skills to navigate relations. Countries with high prevalence of online the digital financial landscape, make informed scams may need to invest in public awareness decisions, and enhance financial resilience.\ncampaigns and educational programmes to help Effectively using digital tools and resources can citizens recognise and avoid scams, requiring help individuals protect themselves from financial significant resource expenditure. setbacks and ensure long-term financial well-being.", "created_at": "2025-10-09"}
{"id": "3d203701-6d8b-4ba6-9014-5302c7688adf", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 5, "page_end": 6, "section": null, "lang": "en", "text": "and resources can citizens recognise and avoid scams, requiring help individuals protect themselves from financial significant resource expenditure. setbacks and ensure long-term financial well-being.\n\n5 Digital Financial Literacy Fuels Financial Resilience ABOUT THE AUTHOR Dr. Wan Rasyidah Wan Nawang Academic Team, Islamic Business & Management, Marketing, Business & Management, Senior Lecturer wrasyidah@usim.edu.my References Abd Samad, S., & Mansor, N. (2013). Population ageing and social protection in Malaysia. Malaysian Journal of Economic Studies, 50(2), 139-156.\nAKPK (2022a). Cukupkah simpanan persaraan anda? Deduced from https://www.akpk.org.my/ perancangan-persaraan AKPK, (2020). Saving awareness still lacking. https://www.akpk.org.my/saving-awareness-still-lacking AKPK, (2022b). Love, Lies & Money. https://www.akpk.org.my/ms/love-lies-and-money Béné, C., & Friend, R. M. (2011). Poverty in small-scale fisheries: old issue, new analysis. Progress in Development Studies, 11(2), 119-144.\nBakeri, (2020). Malaysia 2030: Cabaran Negara Tua. Pg. 1. Terengganu Strategic & Integrity Institute (TSIS) Barnard, (2022). How might the cost of living crisis affect long-term poverty?. 8 SEP 2022. Inequality & Poverty. https://www.economicsobservatory.com/how-might-the-cost-of-living-crisis-affectlong-term-poverty Berita Harian (2023). 'Simpanan persaraan rakyat Malaysia pada tahap membimbangkan' | Nasional | Berita Harian (bharian.com.my). 17 February, 2023 CEIC, (2021). Malaysia Ho", "created_at": "2025-10-09"}
{"id": "4e74b1ff-2df3-4f56-8318-1801244f4fe9", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 6, "page_end": 6, "section": null, "lang": "en", "text": "sis-affectlong-term-poverty Berita Harian (2023). 'Simpanan persaraan rakyat Malaysia pada tahap membimbangkan' | Nasional | Berita Harian (bharian.com.my). 17 February, 2023 CEIC, (2021). Malaysia Household Debt: % of GDP. https://www.ceicdata.com/en/indicator/malaysia/ household-debt--of-nominal-gdp Che Amani, N., Kahar, R., Ibrahim, R., and Hasbullah, M. (2021). Older Financial Abuse Experience: A Qualitative Study from the Perspective of Older Persons in Malaysia. HRMARS. http://dx.doi.\norg/10.6007/IJARBSS/v11-i8/10409 DoSM (2022a). Current Population Estimates, Malaysia 2022. Department of Statistics, Malaysia. ISSN", "created_at": "2025-10-09"}
{"id": "134118ad-53fd-4744-b72d-bbe0364d8ecd", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 6, "page_end": 6, "section": null, "lang": "en", "text": "he Perspective of Older Persons in Malaysia. HRMARS. http://dx.doi.\norg/10.6007/IJARBSS/v11-i8/10409 DoSM (2022a). Current Population Estimates, Malaysia 2022. Department of Statistics, Malaysia. ISSN\n\nDepartment of Statistic Malaysia (DoSM), (2022b). Abridged life table, Malaysia, 2019-2022. Department of Statistics Malaysia Official Portal (dosm.gov.my) Department of Statistics, Malaysia (2019). Household Income and Basic Amenities Survey Report 2019, The Key Findings.\nEPF, (2019). EPF Wages War On Fraudulent Withdrawal Syndicates. https://www.kwsp.gov.my/en/web/ guest/w/epf-wages-war-on-fraudulent-withdrawal-syndicates EPF, (2022). EPF Receives 5.3 Million Applications Under The Special Withdrawal Facility. https:// www.kwsp.gov.my/en/web/guest/w/epf-receives-5.3-million-applications-under-the-specialwithdrawal-facility Klasen, S., Lechtenfeld, T., & Povel, F. (2011). What about the women? Female headship, poverty and vulnerability in Thailand and Vietnam (No. 76). Discussion Papers.\nLaraia, B. A. (2013). Food insecurity and chronic disease. Advances in Nutrition, 4(2), 203-212.\nLSE (2019). Income inequality among different ethnic groups: the case of Malaysia. September 11th, 2019. Malaysia. https://blogs.lse.ac.uk/businessreview/2019/09/11/income-inequality-amongdifferent-ethnic-groups-the-case-of-malaysia/ Malay Mail, (2022). Survey: Malaysians start to worry more about inflation than Covid-19 itself now. 19 May 2022. Malaysia. https://www.malaymail.com/news/malaysia/202", "created_at": "2025-10-09"}
{"id": "fef1884e-a77d-41d7-a295-9dfb48e45a22", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 1, "page_end": 6, "section": null, "lang": "en", "text": "nic-groups-the-case-of-malaysia/ Malay Mail, (2022). Survey: Malaysians start to worry more about inflation than Covid-19 itself now. 19 May 2022. Malaysia. https://www.malaymail.com/news/malaysia/2022/05/19/survey-malaysiansstart-to-worry-more-about-inflation-than-covid-19-itself-now/7631 National Older Adults Policy (2011). Ministry of Women, Family, and Community Development. https:// www.kpwkm.\nNew Straits Times, (2020). Saving awareness still lacking. October 31, 2020. https://www.nst.com.my/ news/nation/2020/10/636843/saving-awareness-still-lacking", "created_at": "2025-10-09"}
{"id": "f693194c-d386-4421-b8c9-019cf9255fc7", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 1, "page_end": 6, "section": null, "lang": "en", "text": "ommunity Development. https:// www.kpwkm.\nNew Straits Times, (2020). Saving awareness still lacking. October 31, 2020. https://www.nst.com.my/ news/nation/2020/10/636843/saving-awareness-still-lacking\n\nDigital Financial Literacy Fuels Financial Resilience 6 References (Cont.) OECD (2023). Old-age income poverty | Pensions at a Glance 2021: OECD and G20 Indicators | OECD iLibrary (oecd-ilibrary.org) Saidi, N., Zainalaludin, Z., & Jamaluddin, A. (2021). Gender Analyses on the Vulnerability Types Suffered by Poor and Older Freshwater Fisheries Community Members in Peninsular Malaysia. International Journal of Academic Research in Business and Social Sciences, 11(12), 2046–2069 Shahar, S., Vanoh, D., Mat Ludin, A.F. et al. (2019). Factors associated with poor socioeconomic status among Malaysian older adults: an analysis according to urban and rural settings. BMC Public Health 19 (Suppl 4), 549. https://doi.org/10.1186/s12889-019-6866-2 Sinar Harian (2023). Wujudkan segera skim kerja warga emas. https://www.sinarharian.com.my/ article/257900/berita/nasional/wujudkan-segera-skim-kerja-warga-emas Agensi Kaunseling dan Pengurusan Kredit. (2022). Rebuilding Financial Resilience: What Consumers Can Learn from the Pandemic. Kuala Lumpur.\nBusiness Today. (2020, 13 May). KPMG: Digital banks should focus on the unserved and underserved segment. https://www.businesstoday.com.my/2020/05/13/kpmg-digital-banks-should-focus-onthe-unserved-and-underserved-segment/ Bank Negara Malaysia (2023a).", "created_at": "2025-10-09"}
{"id": "19a33b0f-ab2e-406b-8601-69ed66497fa1", "doc_id": "f8684c25-98b7-48df-b3bb-e1322b23b155", "title": "1 Digital Financial Literacy Fuels Financial Resilience Digital Financial Literacy Fuels Financial Resilience Digital financial services are gaining global acclaim for their potent", "source_file": ".\\pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "page_start": 1, "page_end": 6, "section": null, "lang": "en", "text": "should focus on the unserved and underserved segment. https://www.businesstoday.com.my/2020/05/13/kpmg-digital-banks-should-focus-onthe-unserved-and-underserved-segment/ Bank Negara Malaysia (2023a). Financial Inclusion Framework. 2023 – 2026. Strategy Paper. https://www.\nbnm.gov.my/documents/20124/55792/SP-2nd-fin-incl-framework.pdf Bank Negara Malaysia (2023b). Financial Stability Review: First Half 2022. The Financial Capability and Inclusion Demand Side Survey 2021. https://www.bnm.gov.my/documents/20124/8440087/ fsr22h1_en_box1.pdf.\nFintech Malaysia. (2022). Malaysia Fintech Report 2021. https://fintechnews.my/wp-content/ uploads/2021/05/Fintech-Report-Malaysia-2021-Fintech-News-Malaysia-x-BigPay.pdf.\nWorld Economic Forum (2022, December). ASEAN Digital Generation Report: Digital Financial Inclusion.\nhttps://www3.weforum.org/docs/WEF_ASEAN_Digital_Generation_Report_2022.pdf.\nSalleh, M. B. (2022, August 05). PDRM: Over RM5.2 billion Lost to Scams in Two Years. The Edge Markets.\nhttps://www.theedgemarkets.com/article/pdrm-over-rm52-billion-lost-scams-two-years.\nWorld Bank Group (2022). The Global 2021 Findex Database: Financial Inclusion, Digital Payments, and Resilience in the Age of COVID-19. file:///C:/Users/HP/Downloads/9781464818974.pdf.", "created_at": "2025-10-09"}
