{"id": "fe4c0f0d-d70d-46f1-937b-7b44dfe97b23", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 1, "page_end": 1, "section": null, "lang": "en", "text": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Financial stress can take a serious toll on mental health.\nHowever, recognising and addressing the sources of this stress, along with its emotional impact, can help navigating this challenging time a bit easier.\nMoney and mental health issues are deeply also struggling with mental health problems.\ninterconnected, creating a vicious cycle that A Money and Mental Health poll found that can be difficult to break. In England, over 1.5 86 percent of nearly 5,500 respondents with million individual are grappling with both debt mental health difficulties reported that their and mental health concerns. The connection is financial struggles worsened their condition evident as 46 percent of individuals in debt are (Holkar, 2019).", "created_at": "2025-10-09"}
{"id": "9838ae3e-d362-449e-8acc-f9d710111089", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 1, "page_end": 2, "section": null, "lang": "en", "text": "ntal health difficulties reported that their and mental health concerns. The connection is financial struggles worsened their condition evident as 46 percent of individuals in debt are (Holkar, 2019).\n\nBreaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection 2 The Cycle of Money and Mental Health Problems Figure 1 Mental health problems make it harder to earn, manage money and spending, and to ask for help.\nMental health Financial problems difficulty Financial difficulty causes stress and anxiety, made worse by collections activity or going without essentials.\nSource: Money and Mental Health Policy Institute, 2019 This cycle perpetuates itself as individuals with Fund (EPF) if allowed by the government.\nmental health issues are more likely to accumulate debt. Stress and anxiety caused by financial issues This trend is consistent with findings from a study are often worsened by the stigma surrounding debt, by the Agensi Kaunseling dan Pengurusan Kredit making people hesitant to seek help. Moreover, (AKPK) in 2022. According to AKPK, a financially those in severe debt are three times more likely vulnerable individual is someone facing to have contemplated suicide. While suicide is a challenges in meeting their financial needs with complex issue influenced by various factors, there is a their existing income. Such a person would find clear connection between debt problem and suicide it difficult to handle an unforeseen expense of with over 100,000", "created_at": "2025-10-09"}
{"id": "53c3492c-600f-4b49-a979-4af785398726", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 2, "page_end": 2, "section": null, "lang": "en", "text": "nced by various factors, there is a their existing income. Such a person would find clear connection between debt problem and suicide it difficult to handle an unforeseen expense of with over 100,000 people in England attempting RM1,000 and would be unable to withstand an suicide each year due to financial distress. abrupt loss of income.\nIn Malaysia, a similar situation is emerging. These financial strains were further reflected in a According to the RinggitPlus Malaysian Financial 2020 study by AKPK, which reveals that 20 percent Literacy Survey (RMFLS) 2022, Malaysians are of Malaysian working adults are experiencing facing their \"worst-ever financial position\" due to levels of financial stress that require psychiatric global recession and rising inflation. The survey attention. The study identifies high cost of living, also highlights troubling trends in savings habits. substantial commitments, and heavy debt as Seventy percent of respondents save less than key contributors to the stress. It also notes that RM500 per month or do not save at all. This trend 41 percent of working adults feel financial stress is further evident in the dramatic drop in the adversely affects their mental well-being, with 65 number of Malaysians saving more than RM1,500 percent reporting it impacts their job performance.\nper month, which has decreased from 20 percent in 2020 to just five percent in 2022. Adding to the financial distress, there is a growing number of bankruptcy cases in Addition", "created_at": "2025-10-09"}
{"id": "110fca2d-ff53-4851-b650-79b9c46dbb46", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 2, "page_end": 3, "section": null, "lang": "en", "text": "their job performance.\nper month, which has decreased from 20 percent in 2020 to just five percent in 2022. Adding to the financial distress, there is a growing number of bankruptcy cases in Additionally, the survey highlights a concerning Malaysia. Over 260,000 Malaysians were financial reality for many Malaysians with 53 percent reported bankrupt as of January 2022 (Malaysian of respondents can only cover their expenses for Department of Insolvency (MdI), 2023). From three months or less with their current savings. 2019 to 2023, the largest group experiencing In addition to these concerns, Ringgit Plus bankruptcy was individuals aged 35 to 44.\nfound that Malaysians are prioritising short-term The top three categories contributing to financial relief over long-term stability. According bankruptcies are personal loans, business loans, to their findings, 66 percent of respondents aged and hire purchase. Most cases involved males, 21 and above would consider taking additional who comprised 73.74 percent, while females withdrawals from their Employees Provident accounted for 26.18 percent.", "created_at": "2025-10-09"}
{"id": "94b35f5e-2e77-45a8-ab3e-9bfd345406c2", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 3, "page_end": 4, "section": null, "lang": "en", "text": "re purchase. Most cases involved males, 21 and above would consider taking additional who comprised 73.74 percent, while females withdrawals from their Employees Provident accounted for 26.18 percent.\n\n3 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Bankruptcy Case Statistics by Age Group from the Year 2019 to the Month of April 2023 Figure 2 YEAR AGE GROUP TOTAL PERCENT 2019 2020 2021 2022 2023 24 years and 54 21 20 11 1 107 0.31 below 25-34 years old 2,603 1,741 1,060 759 178 6,341 18.63 35-44 years 4,574 3,150 2,535 2,237 577 13,073 38.40 old 45-54 years 3,087 2,211 1,802 1,630 382 9,112 26.77 old 55 years and 1,707 1,204 1,116 1,024 246 5,297 15.56 above No 26 24 21 34 8 113 0.33 information TOTAL 12,051 8,351 6,554 5,695 1,392 34,043 100.00 Note: For the age group “No information” the petition document does not contain details of the age of the bankrupt (police or military identification) Statistics of Bankruptcy Cases According to the Cause of Bankruptcy from the Year 2019 to the Month of April 2023 Figure 3 YEAR BANKRUPTCY TOTAL PERCENT CATEGORY 2019 2020 2021 2022 2023 Personal Loan 5,706 4,457 3,267 2,688 637 16,755 49.22 Business Loans 1,846 1,223 1,202 1,241 294 5,806 17.05 Hire Purchase 1,543 1,006 690 441 102 3,782 11.11 Housing loan 1,138 583 459 491 147 2,818 8.28 Credit Card 880 600 438 207 37 2,162 6.35 Debt Other 425 91 126 187 67 896 2.63 Indebtedness Income Tax 261 158 147 153 34 753 2.21 Debt Corporate 221 114 118", "created_at": "2025-10-09"}
{"id": "5d57b42f-b97d-42c0-adac-0a460faf9bab", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 4, "page_end": 4, "section": null, "lang": "en", "text": "ing loan 1,138 583 459 491 147 2,818 8.28 Credit Card 880 600 438 207 37 2,162 6.35 Debt Other 425 91 126 187 67 896 2.63 Indebtedness Income Tax 261 158 147 153 34 753 2.21 Debt Corporate 221 114 118 159 49 661 1.94 Guarantor KWSP 0 105 92 110 22 329 0.97 Contribution Scholarships 16 12 15 18 3 64 0.19 or Study Loans Social Security 15 2 0 0 0 17 0.05 TOTAL 12,051 8,351 6,554 5,695 1,392 34,043 100.00 Note: 1. For the \"Other indebtedness\" category, the petition document does not contain details of the bankrupt's indebtedness.\n2.The \"KWSP Contribution\" category was added starting January 2020", "created_at": "2025-10-09"}
{"id": "0d210be7-7dba-42f1-92eb-9c29276a0161", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 4, "page_end": 4, "section": null, "lang": "en", "text": "100.00 Note: 1. For the \"Other indebtedness\" category, the petition document does not contain details of the bankrupt's indebtedness.\n2.The \"KWSP Contribution\" category was added starting January 2020\n\nBreaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection 4 Bankruptcy Case Statistics by Age Group from the Year 2019 to the Month of April 2023 Figure 4 YEAR GENDER TOTAL PERCENT 2019 2020 2021 2022 2023 Male 8,923 6,116 4,874 4,183 1,008 25,104 73.74 Female 3,128 2,227 1,671 1,506 380 8,912 26.18 Uncertain 0 8 9 6 4 27 0.08 TOTAL 12,051 8,351 6,554 5,695 1,392 34,043 100.00 Note: For the age group “No information”, the petition document does not contain details of the age of the bankrupt (police or military identification) The issues surrounding financial distress and funds. Meanwhile, for those living in extreme mental well-being have been further amplified poverty, government aid and community support by the COVID-19 pandemic. Between March became crucial for securing essential needs.\nand August 2020, 140,608 people lost their jobs, according to the Employment Insurance Breaking the Cycle System (EIS) and the Social Security Organisation Addressing the intersection of financial difficulties (SOCSO). Among those who lost their jobs were and mental health issues requires a multifaceted low-skilled and informal workers, resulting in a approach. Both aspects are deeply intertwined complete loss of their income source. and individuals struggling wi", "created_at": "2025-10-09"}
{"id": "13c7dd35-6770-47b8-bc72-7f0ae8ee99de", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 4, "page_end": 5, "section": null, "lang": "en", "text": "health issues requires a multifaceted low-skilled and informal workers, resulting in a approach. Both aspects are deeply intertwined complete loss of their income source. and individuals struggling with financial challenges often face significant mental health problems that The isolation from lockdowns, combined with loss exacerbate their condition.\nof income and support networks have resulted in increased cases of depression and suicide. To effectively address financial difficulties faced by Additionally, the burden of high debt and family individuals with mental health problems, health issues exacerbates the situation (Hwang, et al., and social care providers need to enhance their 2020; Buecker & Horstmann, 2022). identification and support efforts. Currently, only 22 percent discuss financial impacts with social A study by AKPK in 2020 reports that financial workers or mental health nurses, and less than 28 stress surged by 35 percent during the COVID-19 percent are asked about their finances.\npandemic in April 2020. The 30 to 39 age group experienced a particularly severe impact, with Additionally, expanding access to debt advice their financial stress scores rising by 39 percent, services is crucial as many individuals with mental which shifted them from the \"normal\" category to health issues encounter barriers when seeking the \"stressed\" category. help. The system should be made more flexible and accommodating, potentially by integrating Food security also became a majo", "created_at": "2025-10-09"}
{"id": "c8a561d0-e15b-431f-939f-8e1dafbab444", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 5, "page_end": 5, "section": null, "lang": "en", "text": "y to health issues encounter barriers when seeking the \"stressed\" category. help. The system should be made more flexible and accommodating, potentially by integrating Food security also became a major concern debt advice with mental health care to provide during the pandemic causing many affected comprehensive support.\nindividuals to cut back on their food intake.\nLow-income groups and those facing job Mastering Finances uncertainty or income disruption have reduced • Budgeting and Maximising Income their food consumption to cope with limited Creating a monthly budget is a powerful tool income sources (Kakaei, et al., 2022). Between for gaining control over finances. It helps mid-April and mid-June 2021, one in four low- prevent overspending and facilitates saving income households reported food shortages. for your future goals. Small adjustments in The situation was particularly severe in Sabah, spending, such as reducing non-essential Sarawak, and Federal Territory of Labuan. expenses, can help stretch income further.\nCategorising expenses into needs and wants, As personal finances declined, many individuals along with adjusting your budget to focus on had to rely on their savings just to get by. The reducing high-interest debt can help prevent pandemic forced people to use their emergency further financial strain.", "created_at": "2025-10-09"}
{"id": "617f143d-75dd-42cb-a93b-905836f80aa8", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 5, "page_end": 5, "section": null, "lang": "en", "text": "adjusting your budget to focus on had to rely on their savings just to get by. The reducing high-interest debt can help prevent pandemic forced people to use their emergency further financial strain.\n\n5 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection • Strategic Financial Planning debt to enhance overall financial stability.\nBuilding an emergency fund helps cover unexpected expenses like car repairs or job • Financial Help and Support loss, and setting aside money consistently can If in need of reducing debt, seek help from provide significant relief. Start by using your reputable organisations like the Credit budget to determine monthly savings and aim Counseling and Debt Management Agency to cover three to six months of living expenses (AKPK). Financial consultants will offer before addressing long-term goals. In parallel, valuable guidance on long-term goals, such tackle debt by employing strategies such as retirement or college savings. While as the snowball method or prioritising high- friends and family may provide support, it interest balances to reduce financial strain. is essential to establish clear boundaries Pay the minimum on all debts, commit to a and expectations to avoid straining these repayment plan, and avoid accumulating new relationships.\nABOUT THE AUTHOR Dr. Normaizatul Akma binti Saidi Faculty of Hospitality, Tourism and Wellness University Malaysia Kelantan akma.s@umk.edu.my References Agensi Kaunseling dan Peng", "created_at": "2025-10-09"}
{"id": "594d1a94-0e5b-424e-b6dc-b41dc15f8e05", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 1, "page_end": 5, "section": null, "lang": "en", "text": "g new relationships.\nABOUT THE AUTHOR Dr. Normaizatul Akma binti Saidi Faculty of Hospitality, Tourism and Wellness University Malaysia Kelantan akma.s@umk.edu.my References Agensi Kaunseling dan Pengurusan Kredit, (2020). Money and Mental Well-being: Living a Mindful Life.\nWilayah Persekutuan Kuala Lumpur, Malaysia: AKPK.\nAgensi Kaunseling dan Pengurusan Kredit, (2022). Rebuilding Financial Resilience: What Consumers Can Learn from the Pandemic. Wilayah Persekutuan Kuala Lumpur, Malaysia: AKPK.\nBuecker, S., & Horstmann, K. T. (2022). Loneliness and social isolation during the COVID-19 pandemic.\nEuropean Psychologist.\nHolkar, M. (2019). Debt and mental health: a statistical update. Money and Mental Health Policy Institute.\nHwang, T. J., Rabheru, K., Peisah, C., Reichman, W., & Ikeda, M. (2020). Loneliness and social isolation during the COVID-19 pandemic. International psychogeriatrics, 32(10), 1217-1220.\nKakaei, H., Nourmoradi, H., Bakhtiyari, S., Jalilian, M., & Mirzaei, A. (2022). Effect of COVID-19 on food security, hunger, and food crisis. In COVID-19 and the Sustainable Development Goals (pp. 3-29).\nElsevier.\nMalaysian Department of Insolvency (MdI), (2023). Bankruptcy Statistic 2022. Retrieved at: https://www.\nmdi.gov.my/index.php/legislation/statistics/75-bankruptcy/1983-bankruptcy-statistic-2022 Money and Mental Health Policy Institute, (2019). Retrieved at: https://www.moneyandmentalhealth.\norg/money-and-mental-health-facts/ RinggitPlus Malaysian Financial Literacy", "created_at": "2025-10-09"}
{"id": "036796e8-7aa3-4f10-8ce0-f69c6e90c8b4", "doc_id": "cf3f8876-cb63-4035-8072-39c1cdd34083", "title": "1 Breaking the Chains of Financial Stress: Unravelling the Money-Mental Health Connection Breaking the Chains of Financial Stress: Unravelling the MoneyMental Health Connection Fin", "source_file": ".\\pdfs\\ARTICLE 8 (BREAKING THE CHAINS).pdf", "page_start": 1, "page_end": 5, "section": null, "lang": "en", "text": "bankruptcy-statistic-2022 Money and Mental Health Policy Institute, (2019). Retrieved at: https://www.moneyandmentalhealth.\norg/money-and-mental-health-facts/ RinggitPlus Malaysian Financial Literacy Survey (RMFLS), (2022). Survey Report. Retrieved at: https:// ringgitplus.com/en/blog/wp-content/uploads/2022/12/RMFLS-2022-Survey-Report-FINAL.pdf", "created_at": "2025-10-09"}
