{"id": "e697e78f-15a6-4bb0-9f4b-cf2520640cd0", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 2, "section": null, "lang": "en", "text": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teaching.\n\nTeachers are the single most important influence on student success. The qualifications of financial educators have direct impact both on short-term student outcomes and on their long-term financial well-being.\nDistinguished financial education instructors are not merely dispensers of knowledge; they are learning facilitators who can mold and modify participants’ behavior to guide them toward financial wellness. They understand that the subject of personal finance is unique in that it elicits emotional reactions from participants. These instructors have come to realize that a “one-size-fits-all” pedagogy does not work for delivering high-quality financial education.\nThe Framework for Teaching Personal Finance was developed to establish key benchmarks to help financial literacy educators become more effective, set clear performance measures, and provide guidance for professional development. We hope this Framework will help educators increase their instructional impact as they move participants toward financial wellness.\nOver the past several years the NFEC conducted surveys, research, and think tanks and formed collaborative relationships to develop this Framework. Because we value your thoughts, we also employ a crowdsourcing model where interested people can submit ideas for consideration in", "created_at": "2025-10-09"}
{"id": "660b5924-394b-49a8-bbd4-ff507d0e1315", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 2, "page_end": 3, "section": null, "lang": "en", "text": "ks and formed collaborative relationships to develop this Framework. Because we value your thoughts, we also employ a crowdsourcing model where interested people can submit ideas for consideration in future iterations of the Framework.\nI would like to personally thank everyone who contributed to the Framework and commend all those who have become involved in the financial education movement. Together we can educate the world’s citizens to make qualified financial decisions that improve their lives, the lives of their loved ones, and the lives of people they reach around the globe.\nVince Shorb, CEO National Financial Educators Council “ An understanding heart is everything in a teacher, and cannot be esteemed highly enough. One looks back with appreciation to the brilliant teachers, but with gratitude to those who touched our human feeling. The curriculum is so much necessary raw material, but warmth is the vital element for the growing plant and for the soul of the child. “ Carl Jung", "created_at": "2025-10-09"}
{"id": "53a57ee1-2c02-4e2b-a595-fc72b58362d4", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 3, "page_end": 4, "section": null, "lang": "en", "text": "ith gratitude to those who touched our human feeling. The curriculum is so much necessary raw material, but warmth is the vital element for the growing plant and for the soul of the child. “ Carl Jung\n\nTable of Contents Introduction 4 › Educator Qualifications Affect Student Achievement 4 › Financial Literacy Instruction Requires Unique Skill Sets 5 › Risk of Unqualified Financial Education Instructors 6 › Why Develop a Framework for Financial Education Instructors? 8 › Why Model the ‘Framework for Teaching’? 9 Framework for Teaching Personal Finance Overview 10 › Domain 1: Planning and Preparation 11 › Domain 2: Classroom Environment 12 › Domain 3: Instruction 13 › Domain 4: Professional Responsibilities 14 Proficiency Levels for Financial Education Instructors 15 Domain 1: Planning and Preparation 17 › Framework Overview: Planning and Preparation 18 Domain 2: Classroom Environment 36 › Framework Overview: Environment 37 Domain 3: Instruction 51 › Framework Overview: Delivery of Services 52 Domain 4: Professional Responsibilities 72 › Framework Overview: Professional Responsibilities 73 About the National Financial Educators Council 91 › Crowdsourcing Model 91 › Development Team 92 Glossary 95 References 97 Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "56fc4525-4b67-4a84-a7cf-6e568a728e8a", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 4, "page_end": 4, "section": null, "lang": "en", "text": "iew: Professional Responsibilities 73 About the National Financial Educators Council 91 › Crowdsourcing Model 91 › Development Team 92 Glossary 95 References 97 Framework for Teaching Personal Finance\n\nIntroduction Educator Qualifications Affect Student Achievement Effective educators help learners achieve better outcomes.\nNumerous studies have shown that students of highly-qualified educators accomplish more positive outcomes than those taught by less-qualified instructors. For example, students of qualified educators may expect higher lifetime earnings and greater security at retirement [1] as well as improved mental and physical health and well-being. [2] The effects of educator qualifications on student achievements are realized in various ways. Although few studies have examined the specific effectiveness of financial educators, much parallel evidence can be found in research in the general education sector indicating that better-qualified teachers produce betterqualified graduates across a wide range of academic disciplines.\n[3] [4] Extending those results to include financial literacy education seems a logical conclusion.\nThe Dallas Public Schools’ Accountability System reviews [5] found that, the more effective the teacher, the greater the student gains. Studies conducted by researchers at the University of Tennessee demonstrate that teacher effectiveness has a cumulative, financially measurable effect on student achievement; those effects are long-lasting and sustain", "created_at": "2025-10-09"}
{"id": "82db655a-1e93-4b79-8672-d47ff9544609", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 4, "page_end": 5, "section": null, "lang": "en", "text": "by researchers at the University of Tennessee demonstrate that teacher effectiveness has a cumulative, financially measurable effect on student achievement; those effects are long-lasting and sustainable.\nResearchers also found that teachers are the single most important variable contributing to student success, regardless of student age.[6] In recent years, researchers have begun to apply science to the art of teaching to quantify the effects of specific teaching strategies on student outcomes. Studies have identified the basic characteristics of good teachers and shown that better teachers help students achieve measurably higher test scores regarding a wide variety of academic subjects.[7] It is logical to infer that dedicated, highly-effective financial education instructors are the key to moving participants toward financial wellness.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "75b27898-5139-43a9-a6e9-c94bb8d5d319", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 5, "page_end": 6, "section": null, "lang": "en", "text": "bjects.[7] It is logical to infer that dedicated, highly-effective financial education instructors are the key to moving participants toward financial wellness.\nFramework for Teaching Personal Finance\n\nFinancial Literacy Instruction Requires Unique Skill Sets Financial education is a unique subject that requires specialized expertise to teach effectively.\nThe quality of financial education instructors directly influences both short-term student outcomes and long-term impact on their financial well-being.\nUnlike other core subject matter typically taught in schools, the topic of money elicits emotional reactions in people – ranging from excitement to anxiety to shame. Each participant in a financial literacy course brings his or her own experience, emotions, and relationship with money into the classroom. Educators must understand and respect these emotional reactions to succeed in establishing financial literacy among participants.\nEmotional attachment and pre-existing relationships with money also put participants at greater risk. The NFEC uses the Transtheoretical Model of Behavior Change to measure a person’s willingness to change his or her financial behaviors. When participants are taught by an untrained educator, their risk of regressing to lower stages in the model is greatly increased. Thus they are likely to become more resistant to changing their financial acumen and habits.\nTo facilitate lasting behavior modification, educators must help students achieve a deeper l", "created_at": "2025-10-09"}
{"id": "68395e5a-6268-4fc2-9d25-2637ac6b50b2", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 6, "page_end": 6, "section": null, "lang": "en", "text": "tly increased. Thus they are likely to become more resistant to changing their financial acumen and habits.\nTo facilitate lasting behavior modification, educators must help students achieve a deeper level of understanding about financial literacy lessons compared to other core subject requirements. The NFEC advocates that instructors use Bloom’s Taxonomy of Higher-order Thinking Skills or the Depth of Knowledge Levels as a framework for teaching personal finance. Given adequate instruction time, a highly-qualified financial education instructor drives participants to synthesize the lessons and make decisions in alignment with their individual financial situations. Few other topics taught in schools demand such depth of understanding; for most subjects students simply need to recall information to pass testing requirements.\n“ Tell me and I forget. Teach me and I remember.\nInvolve me and I learn. “ Benjamin Franklin Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "de0801a7-adb0-4929-899d-4ff4591855ee", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 6, "page_end": 7, "section": null, "lang": "en", "text": "nts simply need to recall information to pass testing requirements.\n“ Tell me and I forget. Teach me and I remember.\nInvolve me and I learn. “ Benjamin Franklin Framework for Teaching Personal Finance\n\nRisk of Unqualified Financial Education Instructors Under-qualified or poorly-performing financial educators may bring future economic disaster. The effects of poor teaching can continue to affect students’ lives for many years after instruction ends.[8] Worse, failure seemingly breeds more failure. According to the Dallas studies cited above,[5] not only do under-qualified teachers reduce overall student achievement levels, but sub-par teachers also tend to be paired with already under-performing or at-risk students—thus exacerbating the risk of future economic problems resulting from financial illiteracy.\nQualified financial education instructors understand that “one-size-fits-all” pedagogy does not work. The NFEC believes that financial education instructors are not simply dispensers of knowledge; they are learning facilitators who can mold or modify participants’ behavior to help them achieve financial wellness.\nUnfortunately, many financial literacy instructors today lack solid educator credentials and/or knowledge about personal finance topics. Beyond academic qualifications, studies also show that an educator’s passion, enthusiasm, and commitment play critical roles in successful student development, and a correlation certainly exists between an educator’s level of perso", "created_at": "2025-10-09"}
{"id": "01913fd0-32ed-4780-8d79-d97498d45933", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 7, "page_end": 7, "section": null, "lang": "en", "text": "studies also show that an educator’s passion, enthusiasm, and commitment play critical roles in successful student development, and a correlation certainly exists between an educator’s level of personal commitment and students’ financial futures.[9] [10] [11] Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "1f7c3252-92ca-4e2f-a0bf-abff3d4246a0", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 7, "page_end": 8, "section": null, "lang": "en", "text": "cessful student development, and a correlation certainly exists between an educator’s level of personal commitment and students’ financial futures.[9] [10] [11] Framework for Teaching Personal Finance\n\nThere are a variety of organizations and individuals from various background that teach personal finance. Following we describe some of the common people who attempt to teach personal finance:\n• Traditional, general educators report lacking the confidence to teach financial literacy.[12] When attempting to teach financial literacy as a stand-alone subject, traditional educators report lacking the subject knowledge and skill sets they need to deliver the coursework effectively. Many teachers deliver personal finance topics using the same methods they use to teach core subjects and neglect the subject’s unique traits. For example, they often focus on financial literacy rather than on improving participants’ financial capabilities. On the positive side, as professional educators they do understand how to present and teach in general.\n• Financial professionals often understand financial topics quite well, yet lack training on general teaching and presentation methods. Becoming licensed as a financial professional does not ensure competence at delivering financial literacy education. Studies have found that general teaching effectiveness results from a complex set of inherent qualities as well as planning, instructional, and organizational skills that many financial professionals ha", "created_at": "2025-10-09"}
{"id": "a65078be-f477-4dc6-b153-53758b431528", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 8, "page_end": 9, "section": null, "lang": "en", "text": "udies have found that general teaching effectiveness results from a complex set of inherent qualities as well as planning, instructional, and organizational skills that many financial professionals have not developed at levels adequate to make them effective financial education instructors.\n[13] • Employees or volunteer staff of non-profit organizations, community groups, and government entities often lack traditional teaching skill sets and do not possess necessary knowledge on personal financial matters. Many volunteers have the passion to help people. However, the results of their efforts would be greatly magnified if they obtained the skill sets identified by the Framework for Teaching Personal Finance.\nAlthough very little research has focused on the risks of learning from unqualified financial educators, parallels from the general education literature seem obvious. Just as a poorlytrained, under-committed financial advisor may lead clients to financial loss and economic hardship, a similarly weak financial educator has potential to create long-term problems for students who rely on his or her guidance.[14] It seems intuitive that financial literacy learners will benefit most from blending the strengths of seasoned financial professionals, the basic skill sets of effective general educators, and specialized training that meets benchmarks set forth in the Framework for Teaching Personal Finance. Accountability for measurable results forms an important common ingredient fo", "created_at": "2025-10-09"}
{"id": "98666678-e4ef-466e-9d59-319ce78e06ba", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 9, "page_end": 9, "section": null, "lang": "en", "text": "eneral educators, and specialized training that meets benchmarks set forth in the Framework for Teaching Personal Finance. Accountability for measurable results forms an important common ingredient for success, so the development and national adoption of clear, consistent standards for financial educators offers everyone the hope for a better economic future.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "b46cad38-ee47-43cf-9769-01f9c77db0c8", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 9, "page_end": 11, "section": null, "lang": "en", "text": "success, so the development and national adoption of clear, consistent standards for financial educators offers everyone the hope for a better economic future.\nFramework for Teaching Personal Finance\n\nWhy Develop a Framework for Financial Education Instructors?\nGiving instructors a framework for professional practice is common in many fields – education, financial services, accounting, law, and medicine, for example. Yet until now the financial education industry has developed standards for learners, but lacked guidelines for financial education instructors.\nThe objective of the Framework for Teaching Personal Finance is to share benchmarks with the financial education industry that will assist educators to become more effective instructors and give them to tools to help individuals improve their financial capabilities. In addition, the Framework for Teaching Personal Finance offers the following benefits:\n• Framework to improve the quality and impact of financial education programming • Resource for hiring and recruiting financial education instructors • Clear performance evaluation criteria for financial education instructors • Framework for financial education instructors seeking professional development • Common language as a resource to improve communication • Tools for teacher preparation, performance measures, and self- assessment • Awareness tool to highlight the importance of highly-skilled educators • Public assurance that financial education instructors are held t", "created_at": "2025-10-09"}
{"id": "49f6f429-0978-4a8d-8c13-6e60d4fbf608", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 11, "page_end": 11, "section": null, "lang": "en", "text": "cher preparation, performance measures, and self- assessment • Awareness tool to highlight the importance of highly-skilled educators • Public assurance that financial education instructors are held to the highest standards of practice Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "6e6d5e54-3fe4-4509-9cf3-2e2c2788da82", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 11, "page_end": 12, "section": null, "lang": "en", "text": "ol to highlight the importance of highly-skilled educators • Public assurance that financial education instructors are held to the highest standards of practice Framework for Teaching Personal Finance\n\nWhy Model the ‘Framework for Teaching’?\nThe NFEC chose to work with Danielson Group consultants to modify Charlotte Danielson’s Framework for Teaching to meet the specific needs of Financial Education Instructors. The Framework for Teaching is the most widely-used teaching model in the United States, and has been adopted as the single model, or one of several approved models, in more than 20 states.\nThe Framework identifies the educator responsibilities proven by empirical studies and theoretical research to produce the highest gains in participant test scores. This comprehensive, coherent structure provides clear benchmarks to enhance educators’ professional development.\nFirst published in 1996, Enhancing Professional Practice: A Framework for Teaching was developed to improve teacher performance and participant learning. The Framework identifies skill sets educators should possess and performance levels that define instructor capabilities.\nThe Framework has been revised through four editions, with the latest published in 2013.\nDeveloper of the Framework for Teaching, Charlotte Danielson, is a recognized expert in the area of teacher effectiveness and teacher evaluation systems. She advises State Education Departments, National Ministries, and Departments of Education. She fou", "created_at": "2025-10-09"}
{"id": "566a4228-139d-4e91-9ad0-a135eb792107", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 12, "page_end": 12, "section": null, "lang": "en", "text": "nielson, is a recognized expert in the area of teacher effectiveness and teacher evaluation systems. She advises State Education Departments, National Ministries, and Departments of Education. She founded the Danielson Group to enhance professional practices of educators for maximum positive impact on student learning.\nThe Framework for Teaching is backed by evidence-based research and wide acceptance by educators, administrators, policymakers, and academics. These qualities are what led the NFEC to select the Framework for Teaching as its solution for developing benchmarks for financial education instructors.\nFramework for Teaching Personal Finance\n\nFramework for Teaching Personal Finance Overview Domain 1: Domain 2:\nPlanning and Preparation Classroom Environment Domain 3: Domain 4:\nInstruction Professional Responsibilities Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "7223de6c-4c0d-4a6b-b67e-539f1ac9221b", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 12, "page_end": 13, "section": null, "lang": "en", "text": "ching Personal Finance Overview Domain 1: Domain 2:\nPlanning and Preparation Classroom Environment Domain 3: Domain 4:\nInstruction Professional Responsibilities Framework for Teaching Personal Finance\n\nDomain 1: Planning and Preparation Instructional planning includes a deep understanding of content and pedagogy and an understanding and appreciation of the participants and what they bring to the educational encounter. But grasping the content is not sufficient; the content must be transformed through instructional design into sequences of activities and exercises that make it accessible to participants.\nAll elements of the instructional design – learning activities, materials, and strategies – must be appropriate to both the content and the participants, and aligned with larger instructional goals. In their content and process, assessment techniques must also reflect the instructional outcomes and should serve to document participant progress during and at the end of a teaching episode.\nFurthermore, in designing assessment strategies, Financial Education Instructors must consider their use for formative purposes, and how assessments can provide diagnostic opportunities for participants to demonstrate their level of understanding during the instructional sequence, while there is still time to make adjustments.\n1a: Demonstrating knowledge of the content and the pedagogy / andragogy of improving financial capabilities, financial psychology, and supporting the development of posi", "created_at": "2025-10-09"}
{"id": "496ff024-56e2-4ade-9616-434bf82381e6", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 13, "page_end": 14, "section": null, "lang": "en", "text": "till time to make adjustments.\n1a: Demonstrating knowledge of the content and the pedagogy / andragogy of improving financial capabilities, financial psychology, and supporting the development of positive financial habits.\n1b: Demonstrating knowledge of participants’ cognitive abilities, willingness to change, motivating factors, and interests.\n1c: Setting instructional outcomes and financial behavior objectives.\n1d: Demonstrating knowledge of resources.\n1e: Designing coherent instruction.\n1f: Designing participants’ assessments.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "2f2c78c6-4ca7-4498-9a89-04bc6ef746b5", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 14, "page_end": 14, "section": null, "lang": "en", "text": "tcomes and financial behavior objectives.\n1d: Demonstrating knowledge of resources.\n1e: Designing coherent instruction.\n1f: Designing participants’ assessments.\nFramework for Teaching Personal Finance\n\nDomain 2: Classroom Environment Financial Education Instructors create a learning environment through positive interpersonal interactions, efficient routines and procedures, clear and consistent standards of conduct, and a safe physical environment that supports the learning purposes. In addition, the environment encourages participants to take pride in their work and to assume responsibility for their learning.\nParticipants respond to the warmth and caring of Financial Education Instructors, their high expectations for achievement, and their commitment to participants. Participants feel safe with these Financial Education Instructors and know that they can count on the Financial Education Instructors to be fair and, when necessary, compassionate. Participants are also sensitive to the subtle messages they receive from Financial Education Instructors as to their capabilities.\nThe components of Domain 2 are not associated with the learning of any particular content; instead, they set the stage for all learning. The Financial Education Instructor establishes a comfortable and respectful classroom environment, which cultivates a culture for learning and creates a safe place for risk-taking. The atmosphere is businesslike, with non-instructional routines and procedures handled effi", "created_at": "2025-10-09"}
{"id": "01bf12bd-9bab-4bca-a981-bc5a43f55e3f", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 14, "page_end": 15, "section": null, "lang": "en", "text": "ful classroom environment, which cultivates a culture for learning and creates a safe place for risk-taking. The atmosphere is businesslike, with non-instructional routines and procedures handled efficiently; participant behavior is cooperative and nondisruptive; and the physical environment is conducive to learning.\n2a: Creating an environment of respect and rapport.\n2b: Establishing a culture for learning and application of financial principles.\n2c: Managing classroom and/or technology-based procedures.\n2d: Managing participant conduct to support learning processes.\n2e: Organizing physical and/or virtual space.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "85b13aa5-6698-42af-a933-c6a30c976a63", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 15, "page_end": 16, "section": null, "lang": "en", "text": "ging classroom and/or technology-based procedures.\n2d: Managing participant conduct to support learning processes.\n2e: Organizing physical and/or virtual space.\nFramework for Teaching Personal Finance\n\nDomain 3: Instruction Domain 3 contains the components that are at the essential heart of teaching – the actual engagement of participants in learning, through the vision of participants developing complex understanding and participating in a community of learners. Participants are engaged in meaningful work, which carries significance beyond the next test and is relevant to participants’ lives.\nFinancial Education Instructors who excel in Domain 3 have finely-honed instructional skills.\nTheir work in the classroom is fluid and flexible; they can shift easily from on approach to another when the situation demands it. They seamlessly incorporate ideas and concepts from other parts of the curriculum into their explanations and activities. Their questions probe participant thinking and serve to extend understanding. They are attentive to different participants in the class, and the degree to which they are thoughtfully engaged; they carefully monitor participant understanding as they go (through well-designed questions or activities) and make minor mid-course corrections as needed. And above all, they promote the emergence of self-directed learners fully engaged in the work at hand.\n3a: Communicating with participants about acquiring or changing financial behaviors.\n3b: Using ques", "created_at": "2025-10-09"}
{"id": "0562bd48-a13c-4871-8c42-37b06fd3d0ed", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 16, "page_end": 16, "section": null, "lang": "en", "text": "d above all, they promote the emergence of self-directed learners fully engaged in the work at hand.\n3a: Communicating with participants about acquiring or changing financial behaviors.\n3b: Using questioning and discussion techniques that promote positive financial behaviors.\n3c: Engaging participants with relevant financial instruction.\n3d: Using assessment in instruction to measure behavioral change.\n3e: Demonstrating flexibility and responsiveness to participants’ learning needs.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "7fe0c8a9-dbb7-43ef-a590-08ef2a57aabe", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 16, "page_end": 18, "section": null, "lang": "en", "text": "instruction.\n3d: Using assessment in instruction to measure behavioral change.\n3e: Demonstrating flexibility and responsiveness to participants’ learning needs.\nFramework for Teaching Personal Finance\n\nDomain 4: Professional Responsibilities The components in Domain 4 are associated with being a true professional Financial Education Instructor: they encompass the roles assumed outside of and in addition to those in the classroom with participants. Participants rarely observe these activities; parents and the larger community observe them only intermittently. But the activities are critical to preserving and enhancing the profession. Financial Education Instructors exercise some of them (for example, maintaining records and communicating with families) immediately upon entering the profession, since they are integral to their work with participants.\nDomain 4 consists of a wide range of professional responsibilities, from self-reflection and professional growth, to participation in a professional community, to contributions made to the profession as a whole. The components also include interactions with the families of participants, contacts with the larger community, and advocacy for participants. Domain 4 captures the essence of professionalism by Financial Education Instructors; Financial Education Instructors are, as a result of their skills in this domain, full members of the teaching profession and committed to its enhancement.\n4a: Reflecting on teaching financial capabil", "created_at": "2025-10-09"}
{"id": "e7e5a6a9-9d24-4d33-8b1f-f6ce6f349349", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 18, "page_end": 18, "section": null, "lang": "en", "text": "Financial Education Instructors are, as a result of their skills in this domain, full members of the teaching profession and committed to its enhancement.\n4a: Reflecting on teaching financial capability.\n4b: Maintaining accurate records of participants’ financial capabilities.\n4c: Communicating with participants’ networks to promote community financial wellness.\n4d: Participating in professional inquiry focused on financial wellness.\n4e: Growing and developing professionally.\n4f: Showing professionalism as a qualified Financial Education Instructor.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "ee6c22e7-b01e-43d6-a587-821a2029cc96", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 18, "page_end": 19, "section": null, "lang": "en", "text": "nal inquiry focused on financial wellness.\n4e: Growing and developing professionally.\n4f: Showing professionalism as a qualified Financial Education Instructor.\nFramework for Teaching Personal Finance\n\nProficiency Levels for Financial Education Instructors Unsatisfactory Financial Education Instructors represent teaching that falls below the licensing standard of “do no harm” or where the Financial Education Instructor does not yet fully understand the concepts underlying the component.\n• Evidence of little or no understanding and/or implementation of the Framework for Teaching Personal Finance.\n• Detrimental to participant learning. Inadequate and inappropriate instructional and/ or unprofessional behaviors persist even after intervention(s) and support(s) have been provided.\n• A Financial Education Instructor at the Unsatisfactory level must successfully implement specific steps to improve his/her professional practice to the Proficient or Distinguished level.\nBasic Financial Education Instructors represent teaching that is sporadic, intermittent, or otherwise not entirely successful but where the Financial Education Instructor has some understanding of the concepts underlying the component.\n• Characterized by evidence of minimal understanding and/or implementation of the Framework for Teaching Personal Finance.\n• Practice at the Basic level is inconsistent. Understanding and implementation of instructional and/or professional behaviors demonstrate limited effectiveness wit", "created_at": "2025-10-09"}
{"id": "09d07ec9-1c61-41b4-aa7c-61c2febec1e6", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 19, "page_end": 19, "section": null, "lang": "en", "text": "work for Teaching Personal Finance.\n• Practice at the Basic level is inconsistent. Understanding and implementation of instructional and/or professional behaviors demonstrate limited effectiveness with uneven results.\n• A Financial Education Instructor at the Basic level requires specific supports and interventions to improve individual professional practice to Proficient or Distinguished levels of practice.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "249fb46a-92b6-44b9-ad0e-736007c87f27", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 19, "page_end": 20, "section": null, "lang": "en", "text": "r at the Basic level requires specific supports and interventions to improve individual professional practice to Proficient or Distinguished levels of practice.\nFramework for Teaching Personal Finance\n\nProficient Financial Education Instructors represent Financial Education Instructors who have a deep knowledge of content, professional knowledge of participants and curriculum, and a broad repertoire of strategies and activities to use with participants.\n• Consistently characterized by evidence of a solid knowledge of effective instructional practices, purposeful teaching preparation, and use of a broad repertoire of strategies and activities supported by the Framework for Teaching Personal Finance.\n• Consistent and includes high expectations for participant learning. Accurate knowledge of instructional practices, content, participants, and resources is demonstrated.\n• A Financial Education Instructor at the Proficient level works independently and collaboratively to improve his/her professional practice to support and promote high levels of participant learning and demonstrate ethical and reflective professional practice.\nDistinguished Financial Education Instructors represent a master teaching level where instructors make significant contributions in the classroom to encourage participants to take considerable responsibility for their own learning, as well as outside the classroom as leaders among educational peers and the broader community.\n• Consistently characterized by e", "created_at": "2025-10-09"}
{"id": "933ce110-a10e-467e-a15f-9a3c990cc84b", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 20, "page_end": 21, "section": null, "lang": "en", "text": "articipants to take considerable responsibility for their own learning, as well as outside the classroom as leaders among educational peers and the broader community.\n• Consistently characterized by evidence of extensive knowledge and expertise in understanding and implementing the components of the Framework for Teaching Personal Finance.\n• Characterized by exceptional commitment to flexible, differentiated, and responsive instructional practice as evidenced by effective instructor modeling, high levels of participant engagement, participant-directed learning, and participant growth. There is evidence of extensive and rigorous individualized instruction that is developmentally and culturally appropriate.\n• A Financial Education Instructor at the Distinguished level takes initiative, provides leadership in the financial education field, and is committed to ethical, reflective, continuous, professional practice that ensures high levels of participant learning and ownership.\nFramework for Teaching Personal Finance\n\nDomain 1:\nPlanning and Preparation Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "ccfb628a-848b-4297-b114-6ae993b869da", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 21, "page_end": 21, "section": null, "lang": "en", "text": "rofessional practice that ensures high levels of participant learning and ownership.\nFramework for Teaching Personal Finance\n\nDomain 1:\nPlanning and Preparation Framework for Teaching Personal Finance\n\nFramework Overview: Planning and Preparation 1a: Demonstrating knowledge of content 1d: Demonstrating knowledge of resources.\nand pedagogy / andragogy of improving Variety of resources financial capabilities, financial psychology, and positive financial habits. Extend content knowledge Financial capabilities Linkages with universities, colleges, professional organizations, and webFinancial psychology based resources Formation of positive financial habits 1e: Designing coherent instruction.\n1b: Demonstrating knowledge of Learning activities that engage and participants’ cognitive abilities, willingness motivate to change, motivating factors, and interests.\nDiverse instructional materials and Student skills, knowledge, and proficiency resources Financial beliefs and values Varied instructional groups Special needs Appropriate lessons and units focused on positive financial behaviors 1c: Setting instructional outcomes and financial behavior objectives.\n1f: Designing participants’ assessments.\nCognitively challenging Measure short-term outcomes Focus on learning Formative assessments to understand Develop financial capability participant learning Suitable for diverse learners Use long-term quantification of behavior change Focus on positive financial behaviors Framework for Teachin", "created_at": "2025-10-09"}
{"id": "423a6e7f-bff0-43f9-bf1a-3a00b2ea5976", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 21, "page_end": 22, "section": null, "lang": "en", "text": "o understand Develop financial capability participant learning Suitable for diverse learners Use long-term quantification of behavior change Focus on positive financial behaviors Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "a7a0a2fc-e7f0-48f2-a0a7-92209a364ce2", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 22, "page_end": 23, "section": null, "lang": "en", "text": "op financial capability participant learning Suitable for diverse learners Use long-term quantification of behavior change Focus on positive financial behaviors Framework for Teaching Personal Finance\n\n1a: Demonstrating knowledge of the content and the pedagogy / andragogy of improving financial capabilities, financial psychology and supporting the development of positive financial habits.\nUnsatisfactory In planning and practice, Financial Education Instructor makes content errors or does not correct errors made by participants. Financial Education Instructor displays little understanding of prerequisite knowledge important to participant learning of the content. Financial Education Instructor displays little or no understanding of the range of pedagogical/andragogical approaches suitable to participant learning of the content.\nBasic Financial Education Instructor is familiar with the important concepts in the discipline but displays lack of awareness of how these concepts relate to one another.\nFinancial Education Instructor indicates some awareness of prerequisite learning, although such knowledge may be inaccurate or incomplete. Financial Education Instructor planning and practice reflect a limited range of pedagogical/andragogical approaches to the discipline or to the participants.\nProficient Financial Education Instructor displays solid knowledge of the important concepts in the discipline and how these relate to one another. Financial Education Instructor demonstrates", "created_at": "2025-10-09"}
{"id": "c1f1fc0b-6225-4453-ba0b-249be47c9846", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 23, "page_end": 24, "section": null, "lang": "en", "text": "ipants.\nProficient Financial Education Instructor displays solid knowledge of the important concepts in the discipline and how these relate to one another. Financial Education Instructor demonstrates accurate understanding of prerequisite relationships among topics.\nFinancial Education Instructor planning and practice reflect familiarity with a wide range of effective pedagogical/andragogical approaches in the subject.\nDistinguished Financial Education Instructor displays extensive knowledge of the important concepts in the discipline and how these relate both to one another and to other disciplines. Financial Education Instructor demonstrates understanding of prerequisite relationships among topics and concepts and understands the link to necessary cognitive structures that ensure participant understanding. Financial Education Instructor planning and practice reflect familiarity with a wide range of effective pedagogical/andragogical approaches in the discipline and the ability to anticipate participants’ misconceptions.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "ff87f63c-a113-4df7-9380-0dbd0eb995c3", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 24, "page_end": 24, "section": null, "lang": "en", "text": "ect familiarity with a wide range of effective pedagogical/andragogical approaches in the discipline and the ability to anticipate participants’ misconceptions.\nFramework for Teaching Personal Finance\n\nDistinguished • Financial Education Instructor plans with the end goal of lessons in mind.\n• The Financial Education Instructor ensures that participants know how the content relates to their personal lives.\n• Financial Education Instructor provides clear and exemplary explanations of behavioral development and change.\n• The Financial Education Instructor recognizes at which stage participants are operating and prepares activities designed to move them to the higher learning levels.\n• Financial Education Instructor cites intra- and inter-disciplinary content relationships.\n• Participants apply strategies in their everyday lives.\n• Financial Education Instructor demonstrates awareness of possible participant misconceptions and how they can be addressed.\n• Instructional strategies in unit and lesson plans are diverse and extensive and demonstrate extended understanding of the key content.\n• Participants know how to compute the major personal finance calculations and connect how they relate to personal financial decisions.\n• Uses Marzano six-step process for learning vocabulary.\n• Selects activities that engage, reinforce, and assess participants’ grasp of personal finance vocabulary.\n• Participants are able to make suggestions to rectify money mistakes and explain criteria for fi", "created_at": "2025-10-09"}
{"id": "99288dc2-b3f2-4e9a-b9ef-ac95c02b7c74", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 24, "page_end": 25, "section": null, "lang": "en", "text": "ects activities that engage, reinforce, and assess participants’ grasp of personal finance vocabulary.\n• Participants are able to make suggestions to rectify money mistakes and explain criteria for finding knowledgeable financial mentors/advisors.\n• Participants not only are able to identify economic trends and policies, they can explain and act upon the effects those trends may have on one’s own personal finances.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "afc08430-c995-49c8-94c6-f65883e4581a", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 25, "page_end": 26, "section": null, "lang": "en", "text": "ants not only are able to identify economic trends and policies, they can explain and act upon the effects those trends may have on one’s own personal finances.\nFramework for Teaching Personal Finance\n\nProficient • The Financial Education Instructor develops lesson plans and units that reflect an understanding of the content of financial capability including the key financial touchpoints:\nfinancial psychology, savings, investing, income, career, entrepreneurship, credit, debt, loans, risk management, and insurance.\n• The Financial Education Instructor develops lesson plans and units that reflect an understanding of the financial psychology of financial capability including: hierarchy of needs, impact of emotions and behaviors, influencers, positive behaviors, and changes in behavior.\n• The Financial Education Instructor uses the Transtheoretical Model of Behavior Change and participants can identify the six stages: precontemplation, contemplation, preparation, action, maintenance, and termination.\n• Financial Education Instructor can identify important concepts of the discipline and their relationships to one another.\n• Financial Education Instructor illustrates the concept of financial blinkers and describes strategies to offset financial decision-making errors.\n• Financial Education Instructor provides clear explanations of the content.\n• Instructional strategies in unit and lesson plans are entirely suitable to the content.\n• Ensures that participants have thorough knowled", "created_at": "2025-10-09"}
{"id": "728f831f-5b93-4054-b488-f90649eba2ca", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 26, "page_end": 26, "section": null, "lang": "en", "text": "ation Instructor provides clear explanations of the content.\n• Instructional strategies in unit and lesson plans are entirely suitable to the content.\n• Ensures that participants have thorough knowledge of the following finance-related mathematical concepts, which may include: calculating monthly interest, calculating lease payments, calculating return on investment, calculating net present value, and using the concept of time value of money and finding interest for daily, monthly, quarterly, and annual compounding terms.\n• Introduces practical, relevant personal finance terms, especially concepts of behavioral literacy and conscious spending.\n• Participants are able to identify the common money mistakes that people make.\n• Participants are able to identify economic trends and policies and their impact on their personal financial situations.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "39c7e99d-f97f-4960-8e1f-bbc726585551", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 26, "page_end": 27, "section": null, "lang": "en", "text": "ommon money mistakes that people make.\n• Participants are able to identify economic trends and policies and their impact on their personal financial situations.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor does not focus on a specific financial product but covers only a few of the key financial touchpoints.\n• The Financial Education Instructor plans touch on financial psychology; however, the scope covered is limited.\n• The Financial Education Instructor understanding of the discipline is rudimentary.\n• Financial Education Instructor knowledge of prerequisite relationships is inaccurate or incomplete.\n• Lesson and unit plans use limited instructional strategies, and some are not suitable to the content.\nUnsatisfactory • The Financial Education Instructor focuses on a specific financial product or a few of the key financial touchpoints.\n• The Financial Education Instructor ignores or plays down the financial psychology aspects of Financial Capability.\n• Financial Education Instructor makes content errors.\n• Financial Education Instructor does not consider prerequisite relationships when planning.\n• Financial Education Instructor plans use inappropriate strategies for the discipline.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "040d11ad-29f2-49b9-b6b8-65935c5bdd39", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 27, "page_end": 28, "section": null, "lang": "en", "text": "n Instructor does not consider prerequisite relationships when planning.\n• Financial Education Instructor plans use inappropriate strategies for the discipline.\nFramework for Teaching Personal Finance\n\n1b: Demonstrating knowledge of participants’ cognitive abilities, willingness to change, motivating factors, and interests.\nUnsatisfactory Financial Education Instructor displays minimal understanding of how participants learn and little knowledge of their varied approaches to learning, knowledge and skills, special needs, interests, and cultural heritage. Instructor does not grasp the value of such knowledge.\nBasic Financial Education Instructor displays generally accurate knowledge of how participants learn and of their varied approaches to learning, knowledge and skills, special needs, interests, and cultural heritage; instructor may apply this knowledge not just to individual participants but to the class as a whole.\nProficient Financial Education Instructor understands the active nature of participant learning and attains information about levels of development for groups of participants.\nInstructor purposefully acquires knowledge from several sources about groups of participants’ varied approaches to learning, knowledge and skills, special needs, interests, and cultural heritage.\nDistinguished The classroom/web-based culture is a cognitively busy place, characterized by a shared belief in the importance of learning. The Financial Education Instructor conveys high expectat", "created_at": "2025-10-09"}
{"id": "4226daa3-1c9d-4119-85e1-ab43b87c4dd4", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 28, "page_end": 28, "section": null, "lang": "en", "text": "age.\nDistinguished The classroom/web-based culture is a cognitively busy place, characterized by a shared belief in the importance of learning. The Financial Education Instructor conveys high expectations for learning by all participants and insists on hard work; participants assume responsibility for high- quality learning by initiating improvements, making revisions, adding detail, and/or assisting peers in their precise use of language.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "3dde67ca-7b2e-4c08-a824-d4890d2aa453", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 28, "page_end": 29, "section": null, "lang": "en", "text": "responsibility for high- quality learning by initiating improvements, making revisions, adding detail, and/or assisting peers in their precise use of language.\nFramework for Teaching Personal Finance\n\nDistinguished • Participants in financial education programs reflect on cultural and family heritage to identify their financial influencers and the beliefs and values they learned about money.\n• Financial Education Instructor facilitates data collection and reflection.\n• The Financial Education Instructor incorporates multiple intelligence theories and various participant interests into lesson plans.\n• The Financial Education Instructor incorporates advanced and corrective material into lesson plans to accommodate different ability levels in the class.\n• Financial Education Instructor uses ongoing methods to assess participants’ skill levels and design instruction accordingly.\n• Financial Education Instructor maintains a system of updated participant records and incorporates medical and/or learning needs into lesson plans.\nProficient • The Financial Education Instructor gathers formal and informal information about participants’ cultural and family heritage to use in planning instruction.\n• Financial Education Instructor has a good idea of the range of participant interests in the class and uses some multiple intelligence techniques.\n• Financial Education Instructor has identified groups of participants within the class based on their learning needs.\n• The Financial Education", "created_at": "2025-10-09"}
{"id": "24858359-2828-44a8-a7e5-15af553646d0", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 29, "page_end": 30, "section": null, "lang": "en", "text": "class and uses some multiple intelligence techniques.\n• Financial Education Instructor has identified groups of participants within the class based on their learning needs.\n• The Financial Education Instructor understands differing levels of participant cognitive development.\n• Financial Education Instructor is aware of the special needs represented by participants in the class.\n• Financial Education Instructor uses appropriate measurements for quantifying knowledge and cognitive abilities.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "f67ecfa2-b07d-484c-b807-b466c2abf8ca", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 30, "page_end": 31, "section": null, "lang": "en", "text": "eeds represented by participants in the class.\n• Financial Education Instructor uses appropriate measurements for quantifying knowledge and cognitive abilities.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor recognizes that children and adults have different cultural and family backgrounds but rarely draws on their contributions or differentiates materials to accommodate differences.\n• Financial Education Instructor is aware of different interests among the class but tends to teach to the whole group.\n• The Financial Education Instructor is aware of the different ability levels in the class but tends to teach to the whole group.\n• Financial Education Instructor cites developmental theory but does not seek to integrate theory into lesson planning.\n• The Financial Education Instructor is aware of some participants’ medical issues and learning disabilities, but does not seek to understand the implications of those disabilities.\nUnsatisfactory • Financial Education Instructor is unaware of participants’ cultural and family heritage and its effect on financial beliefs and values.\n• Financial Education Instructor does not try to ascertain varied participant interests.\n• Financial Education Instructor does not try to ascertain varied ability levels among participants in the class.\n• Financial Education Instructor understands neither developmental theory nor pedagogy/ andragogy.\n• Financial Education Instructor takes no responsibility to learn about p", "created_at": "2025-10-09"}
{"id": "23cb5f78-4ff2-49de-98cc-96ce0febe7b4", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 31, "page_end": 31, "section": null, "lang": "en", "text": "participants in the class.\n• Financial Education Instructor understands neither developmental theory nor pedagogy/ andragogy.\n• Financial Education Instructor takes no responsibility to learn about participants’ medical or learning disabilities.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "b7652016-e008-4c0a-9517-89a976284864", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 31, "page_end": 32, "section": null, "lang": "en", "text": "opmental theory nor pedagogy/ andragogy.\n• Financial Education Instructor takes no responsibility to learn about participants’ medical or learning disabilities.\nFramework for Teaching Personal Finance\n\n1c: Setting instructional outcomes and financial behavior objectives.\nUnsatisfactory The outcomes expected by the Financial Education Instructor represent low expectations for participants and lack of rigor, and not all of the outcomes reflect important learning in the discipline. They are stated as participant activities, rather than as outcomes for learning.\nOutcomes reflect only one type of learning and only one discipline or strand and are suitable for only some of the participants.\nBasic Outcomes represent moderately high expectations and rigor.\nSome reflect important learning in the discipline and consist of a combination of outcomes and activities. Outcomes reflect several types of learning, but the Financial Education Instructor has made no effort at coordination or integration.\nOutcomes, based on global assessments of participant learning, are suitable for most of the participants in the class.\nProficient Most outcomes represent rigorous and important learning in the discipline and are clear, written in the form of participant learning, and suggest viable methods of assessment.\nOutcomes reflect several different types of learning and opportunities for coordination, and they are differentiated as necessary to suit different participant groups.\nDistinguished All outcomes", "created_at": "2025-10-09"}
{"id": "ce9e5be7-4fbd-401b-85ea-288031b004ae", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 32, "page_end": 32, "section": null, "lang": "en", "text": "ment.\nOutcomes reflect several different types of learning and opportunities for coordination, and they are differentiated as necessary to suit different participant groups.\nDistinguished All outcomes represent high-level learning in the discipline. They are clear, written in the form of participant learning, and permit viable assessment methods.\nOutcomes reflect several different types of learning and, where appropriate, represent both coordination and integration. Outcomes are differentiated as necessary to suit individual participants.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "a5ed4cec-9311-4e7c-89e1-4dc9c881516c", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 32, "page_end": 33, "section": null, "lang": "en", "text": "types of learning and, where appropriate, represent both coordination and integration. Outcomes are differentiated as necessary to suit individual participants.\nFramework for Teaching Personal Finance\n\nDistinguished • The outcome of the financial education program must be financial capability with an age-appropriate knowledge of financial content and psychology and positive behavior development and/or modification.\n• The outcomes of the financial education program are written in terms of what participants will learn and do both today and in the future and are scaffolded for different learning needs.\n• Outcomes represent a range of types of learning and are differentiated throughout the lesson to encourage individual participants to take educational risks.\n• Participants in the class will continue with their financial education and advocate for personal financial education in their communities.\nProficient • Outcomes represent high expectations of financial capability.\n• The outcomes of the financial education program are written in terms of what participants will learn and do both today and in the future, and are suitable for all participants in class.\n• Outcomes represent a range of types: factual knowledge, conceptual understanding, reasoning, social interaction, management, and communication.\n• Participants in the class express a desire to continue their financial education.\nBasic • An outcome represents some knowledge of financial content and psychology and some behavior d", "created_at": "2025-10-09"}
{"id": "3b1762bc-f9f3-4272-b23b-fbdfa7e100f7", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 33, "page_end": 34, "section": null, "lang": "en", "text": "communication.\n• Participants in the class express a desire to continue their financial education.\nBasic • An outcome represents some knowledge of financial content and psychology and some behavior development and/or modification.\n• Outcomes are focused on learning that is suitable for most of the class.\n• Outcomes are suitable for most of the participants in the class.\n• Participants in the class may continue their financial education.\nUnsatisfactory • Outcomes represent a mixture of low expectations and rigor.\n• Outcomes are unclear or are stated solely as activities.\n• Outcomes are not suitable for many participants in the class.\n• Participants in the class are indifferent to continuing their financial education.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "6fb49cc8-0d7e-480d-ae2b-08c68bbbbab7", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 34, "page_end": 34, "section": null, "lang": "en", "text": "activities.\n• Outcomes are not suitable for many participants in the class.\n• Participants in the class are indifferent to continuing their financial education.\nFramework for Teaching Personal Finance\n\n1d: Demonstrating knowledge of resources.\nUnsatisfactory Financial Education Instructor is unaware of resources to assist participant learning beyond materials provided by the school, district or sponsoring organization; nor is Financial Education Instructor aware of resources for expanding one’s own professional skill.\nBasic Financial Education Instructor displays some awareness of resources beyond those provided by the school or district for use in classroom/technology-based forums or those provided by the sponsoring organization. Instructor has some awareness of resources for extending one’s professional skill but does not seek to expand this knowledge.\nProficient Financial Education Instructor displays awareness of resources beyond those provided by the school, district, or sponsoring organization, including those on the Internet and those available for extending one’s professional skill; Instructor seeks out such resources.\nDistinguished Financial Education Instructor exhibits extensive knowledge of resources for use in classroom/technology-based forums and for extending one’s professional skill, including those available through the school, district, or sponsoring organization, in the community, through professional organizations and universities, and on the Internet.\nFra", "created_at": "2025-10-09"}
{"id": "587d8d0b-01e1-412a-aa69-539177a85946", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 34, "page_end": 34, "section": null, "lang": "en", "text": "professional skill, including those available through the school, district, or sponsoring organization, in the community, through professional organizations and universities, and on the Internet.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "04790ca0-4687-4d9b-837c-d7f6b0bf173e", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 34, "page_end": 37, "section": null, "lang": "en", "text": "available through the school, district, or sponsoring organization, in the community, through professional organizations and universities, and on the Internet.\nFramework for Teaching Personal Finance\n\nDistinguished • A distinguished Financial Education Instructor seeks out diverse materials available through a wide variety of academic and financial channels.\n• The Financial Education Instructor uses exemplary financial materials and curriculum from professional sources and maintains a log of resources for participant reference.\n• The Financial Education instructor facilitates participants’ contact with resources outside the classroom/technology-based forum.\n• Financial Education Instructor brings highly qualified experts to the class.\n• Financial Education Instructor has ongoing relationships with academic and professional organizations to access various resources to support participant learning.\nProficient • Financial Education Instructor makes use of all available resources, including: formal textbooks, more informal reading material, software, games, Internet-based games, guest speakers, field experiences, lectures, etc.\n• The Financial Education Instructor is well-versed in age-appropriate literature and materials for a variety of different types of learners and consults both print and multidisciplinary and technology-based resources addressing current trends in practice and information technology.\n• The Financial Education Instructor supplements selected texts with gues", "created_at": "2025-10-09"}
{"id": "2919ba66-636b-4d9b-acfe-50bbd8c11ef8", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 37, "page_end": 37, "section": null, "lang": "en", "text": "h print and multidisciplinary and technology-based resources addressing current trends in practice and information technology.\n• The Financial Education Instructor supplements selected texts with guest speakers and field experiences.\n• Financial Education Instructor expands knowledge through options offered by universities, professional learning groups, and organizations; and pursues apprenticeships to increase financial knowledge.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "ef17568e-ba88-4ff0-8af8-970630f46faf", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 37, "page_end": 38, "section": null, "lang": "en", "text": "knowledge through options offered by universities, professional learning groups, and organizations; and pursues apprenticeships to increase financial knowledge.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor uses academic resources, rather than just relying on sales material provided by purveyors of financial products or materials provided by the district or sponsoring organization.\n• The Financial Education Instructor consults some print and/or electronic resources addressing current trends in practice and information technology.\n• Financial Education Instructor participates in content-area workshops offered by the school or sponsoring organization, but does not pursue other professional development.\nUnsatisfactory • Financial Education Instructor uses only sales material provided by purveyors of financial products or materials provided by the district or sponsoring organization, even when more variety would assist some participants.\n• Although aware of some participant needs, Financial Education Instructor does not inquire about possible resources.\n• Financial Education Instructor does not seek out resources available to expand his/her own skill.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "726fa544-74e5-4d02-b01a-4b29f286c070", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 38, "page_end": 39, "section": null, "lang": "en", "text": "cation Instructor does not inquire about possible resources.\n• Financial Education Instructor does not seek out resources available to expand his/her own skill.\nFramework for Teaching Personal Finance\n\n1e: Designing coherent instruction.\nUnsatisfactory Learning activities designed by Financial Education Instructor are poorly aligned with the instructional outcomes, do not follow an organized progression, are not designed to engage participants in active intellectual activity, and have unrealistic time allocations. Instructional groups are not suitable to the activities and offer no variety.\nBasic Some of the learning activities and materials provided by Financial Education Instructor are aligned with the instructional outcomes and represent moderate cognitive challenge, but with no differentiation for different participants.\nInstructional groups partially support the activities, with some variety. The lesson or unit has a recognizable structure; but the progression of activities is uneven, with only some reasonable time allocations.\nProficient Most of the learning activities provided by Financial Education Instructor are aligned with the instructional outcomes and follow an organized progression suitable to groups of participants. The learning activities have reasonable time allocations; they represent significant cognitive challenge, with some differentiation for different groups of participants and varied use of instructional groups.\nDistinguished The sequence of learning a", "created_at": "2025-10-09"}
{"id": "b6570710-092e-4eb2-b3df-fbc2d511d005", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 39, "page_end": 39, "section": null, "lang": "en", "text": "cations; they represent significant cognitive challenge, with some differentiation for different groups of participants and varied use of instructional groups.\nDistinguished The sequence of learning activities follows a coherent sequence, is aligned with instructional goals, and is designed to engage participants in high-level cognitive activity.\nThe activities are appropriately differentiated for individual learners. Instructional groups are varied appropriately, with some opportunity for participant choice.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "5b742a0c-6832-4802-a67b-89606fae2144", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 39, "page_end": 41, "section": null, "lang": "en", "text": "ctivities are appropriately differentiated for individual learners. Instructional groups are varied appropriately, with some opportunity for participant choice.\nFramework for Teaching Personal Finance\n\nDistinguished • The financial education program provides opportunities for participant choices while ensuring that all financial capability concepts are covered.\n• The Financial Education Instructor uses instructional maps, visual tools, planned learning groups, multiple intelligence activities, and resources that are differentiated for participants’ unique learning needs.\n• Learning experiences connect to other disciplines and are organized to maximize learning and build on participant strengths.\n• The Financial Education Instructor selects lessons/activities that move participants to the next level of need.\nProficient • The Financial Education Instructor uses lessons that support the instructional outcomes and reflect the important concepts of financial capability.\n• Financial Education Instructor provides a variety of appropriately challenging materials and resources.\n• The plan for the lesson or unit is well-structured, with reasonable time allocations and activities that provide opportunity for higher-level thinking.\n• The Financial Education Instructor recognizes the level of hierarchy at which participants are operating.\n• The Financial Education Instructor applies Maslow’s hierarchy of needs in designing learning activities.\n• The Financial Education Instructor selects", "created_at": "2025-10-09"}
{"id": "37a332ef-0399-4e36-a838-2d66a099d5ab", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 41, "page_end": 41, "section": null, "lang": "en", "text": "hierarchy at which participants are operating.\n• The Financial Education Instructor applies Maslow’s hierarchy of needs in designing learning activities.\n• The Financial Education Instructor selects lessons/activities that address the current level of need.\nBasic • Some of the important concepts of financial capability are reflected in the lessons.\n• Learning activities are moderately challenging and suitable, but there is limited variety.\n• Lesson structure is uneven and/or may be unrealistic in terms of time expectations.\nUnsatisfactory • Lessons do not reflect the important concepts of financial capability.\n• Learning activities are boring and/or poorly aligned to the instructional goals. Instructional groups do not support learning.\n• Lesson plans are not structured or sequenced and reflect unrealistic expectations.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "aa298de9-0ba6-47aa-b20e-a797d7f9b12b", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 41, "page_end": 42, "section": null, "lang": "en", "text": "d to the instructional goals. Instructional groups do not support learning.\n• Lesson plans are not structured or sequenced and reflect unrealistic expectations.\nFramework for Teaching Personal Finance\n\n1f: Designing participants’ assessments.\nUnsatisfactory Assessment procedures are incongruent with instructional outcomes and contain no criteria by which participant performance will be assessed.\nFinancial Education Instructor has no plan to incorporate formative assessment into the lesson or unit.\nBasic Assessment procedures are partially congruent with instructional outcomes.\nAssessment criteria and standards have been developed, but are unclear. Approach to the use of formative assessment is rudimentary, including only some of the instructional outcomes.\nProficient All the instructional outcomes may be assessed by the proposed assessment plan; assessment methodologies have been adapted for groups of participants. Assessment criteria and standards are clear. Financial Education Instructor has a well- developed strategy for using summative and formative assessment and has designed particular approaches to be used.\nDistinguished All the instructional outcomes may be assessed by the proposed assessment plan, with clear criteria for assessing participant work. The plan exhibits evidence of participant contribution to its development. Assessment methodologies have been adapted for individual participants as need has arisen. The approach to using summative and formative assessment", "created_at": "2025-10-09"}
{"id": "32f469a1-4f5d-4be5-a2cc-299c1f92a065", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 42, "page_end": 42, "section": null, "lang": "en", "text": "ence of participant contribution to its development. Assessment methodologies have been adapted for individual participants as need has arisen. The approach to using summative and formative assessment is well- designed and includes participant as well as Financial Education Instructor use of the assessment information.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "63a7a2be-8f38-4f2f-8e9a-071b0a315fd6", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 42, "page_end": 43, "section": null, "lang": "en", "text": "using summative and formative assessment is well- designed and includes participant as well as Financial Education Instructor use of the assessment information.\nFramework for Teaching Personal Finance\n\nDistinguished • Financial Education Instructor assesses level of financial capability in terms of a priori content knowledge and post-course content knowledge; and a priori financial beliefs and post-course financial beliefs.\n• The post-test is designed to allow comparison of learning outcomes between pre- and post-test.\n• Financial Education Instructor-designed assessments are authentic, with real-world application as appropriate.\n• Participants are actively involved in collecting information from summative and formative assessments and provide input to the Financial Education Instructor.\n• Lesson plans are immediately modified by the Financial Education Instructor as required by the formative assessments.\n• Participants’ results on the national assessment are used by the Financial Education Instructor to follow up with each participant and/or modify instruction plans.\n• Concrete follow-up by the Financial Education Instructor with the participants after the class/lesson has ended based on assessment results.\nProficient • Financial Education Instructor assesses level of financial capability in terms of both content knowledge and financial beliefs.\n• All the learning outcomes have a method for assessment in the pre- and post-tests.\n• The types of assessment used by the Financia", "created_at": "2025-10-09"}
{"id": "05822915-9b0f-40c4-b0bb-d032c331e5d7", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 43, "page_end": 44, "section": null, "lang": "en", "text": "capability in terms of both content knowledge and financial beliefs.\n• All the learning outcomes have a method for assessment in the pre- and post-tests.\n• The types of assessment used by the Financial Education Instructor are suitable to the goal of achieving financial capability by each participant.\n• The Financial Education Instructor provides modified assessments for individual participants as needed.\n• The formative assessments are designed by the Financial Education Instructor to allow him/her to make shifts in the instructional plan during the course if necessary.\n• The Financial Education Instructor will have participants take one of the many available national assessments on financial capability.\n• The Financial Education Instructor will have a mechanism for assessing participants’ content knowledge and financial behavior after the class/lesson has ended.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "f2e352e7-47a6-4696-bd09-fce12b70ddc9", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 44, "page_end": 44, "section": null, "lang": "en", "text": "The Financial Education Instructor will have a mechanism for assessing participants’ content knowledge and financial behavior after the class/lesson has ended.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor assesses level of financial capability in terms of content knowledge only.\n• Only some of the instructional outcomes are addressed in the pre- and post-tests.\n• Assessment criteria are vague.\n• Assessment results are used to design lesson plans for the whole class, not individual participants.\n• Very modest modification of instructional plans during course is undertaken based on assessment results.\n• No use of national assessments.\n• No use of follow-up assessment.\nUnsatisfactory • Financial Education Instructor does not assess financial capability.\n• No use of a pre-test to address instructional outcomes.\n• Assessments have no criteria.\n• Assessment results do not affect future plans.\n• No modification of instructional plans during course is undertaken based on assessment results.\n• Disregard of national assessments.\n• Disregard of follow-up assessments.\nFramework for Teaching Personal Finance\n\nDomain 2:\nClassroom Environment Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "57f19e26-e7b1-456f-9d27-0e7d21645ae2", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 44, "page_end": 45, "section": null, "lang": "en", "text": "ent results.\n• Disregard of national assessments.\n• Disregard of follow-up assessments.\nFramework for Teaching Personal Finance\n\nDomain 2:\nClassroom Environment Framework for Teaching Personal Finance\n\nFramework Overview: Environment 2a: Creating an environment of respect and 2c: Managing classroom and/or technologyrapport. based procedures.\nPositive learning experience Effective routines and procedures Personal relationship between instructor Varied groupings and participant(s) Appropriate materials and supplies Positive connections between participants Inclusive environment of civility and support 2d: Managing participant conduct to support learning process.\nClear conduct behaviors 2b: Establishing a culture for learning and Monitoring of conduct application of financial principles.\nResponse to misbehavior Importance of financial literacy concepts Psychological and emotional elements of finances Sound financial aptitude 2e: Organizing physical and/or virtual space.\nLearning and achievement of participants Accessibility to learning resources Alignment between learning activities and furniture/resources Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "f6b7cafc-fd0b-4927-99a2-e01045788a9a", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 45, "page_end": 47, "section": null, "lang": "en", "text": "and/or virtual space.\nLearning and achievement of participants Accessibility to learning resources Alignment between learning activities and furniture/resources Framework for Teaching Personal Finance\n\n2a: Creating an environment of respect and rapport.\nUnsatisfactory Patterns of interactions, both between Financial Education Instructor and participants and among participants, are mostly negative, inappropriate, or insensitive to participants’ ages, cultural backgrounds, and developmental levels. Participant interactions are characterized by sarcasm, put-downs, or conflict. Financial Education Instructor does not deal with disrespectful behavior.\nBasic Patterns of interactions, both between Financial Education Instructor and participants and among participants, are generally appropriate but may reflect occasional inconsistencies, favoritism, and disregard for participants’ ages, cultures, and developmental levels.\nParticipants rarely demonstrate disrespect for one another.\nFinancial Education Instructor attempts to respond to disrespectful behavior, with uneven results. The net result of the interactions is neutral, conveying neither warmth nor conflict.\nProficient Interactions between Financial Education Instructor and participants are friendly and demonstrate general caring and respect. Such interactions are appropriate to the ages, cultures, and developmental levels of the participants. Interactions among participants are generally polite and respectful, and participants e", "created_at": "2025-10-09"}
{"id": "77ff1615-6aa9-467d-8084-015e2dd91281", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 47, "page_end": 47, "section": null, "lang": "en", "text": "respect. Such interactions are appropriate to the ages, cultures, and developmental levels of the participants. Interactions among participants are generally polite and respectful, and participants exhibit respect for Financial Education Instructor. Financial Education Instructor responds successfully to disrespectful behavior among participants. The net result of the interactions is polite, respectful, and businesslike, although participants may at times be somewhat cautious about taking intellectual risks.\nDistinguished Classroom interactions between Financial Education Instructor and participants and among participants are highly respectful, reflecting genuine warmth and caring and sensitivity to participants as individuals. Participants exhibit respect for Financial Education Instructor and contribute to high levels of civility among all members of the class. The net result is an environment where all participants feel valued and are comfortable taking intellectual risks.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "f3831edd-5b4e-4698-8be5-f4425b17805f", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 47, "page_end": 48, "section": null, "lang": "en", "text": "s of civility among all members of the class. The net result is an environment where all participants feel valued and are comfortable taking intellectual risks.\nFramework for Teaching Personal Finance\n\nDistinguished • Financial Education Instructor demonstrates knowledge and caring about individual participants’ lives beyond the class and school.\n• There is no disrespectful behavior toward Financial Education Instructor or among participants.\n• When necessary, participants respectfully correct one another in their conduct towards other participants.\n• Participants engage without fear of put-downs or ridicule either from the Financial Education Instructor or from other participants.\n• Financial Education Instructor respects and encourages participants’ efforts and supports the development of clear financial plans.\n• Financial Education Instructor shows empathy for participants’ experience and builds positive emotions in participants.\nProficient • Talk between Financial Education Instructor and participants and among participants is uniformly respectful.\n• Financial Education Instructor successfully responds to disrespectful behavior among participants.\n• Participants engage willingly, but may at times be hesitant to offer their ideas in front of classmates.\n• Financial Education Instructor builds rapport and connection with individual participants by sharing personal stories and experiences (as appropriate), using positive language and tone, and communicating in a benefit-orie", "created_at": "2025-10-09"}
{"id": "22b09e45-b8d5-43f4-8cc3-108d577602eb", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 48, "page_end": 49, "section": null, "lang": "en", "text": "nstructor builds rapport and connection with individual participants by sharing personal stories and experiences (as appropriate), using positive language and tone, and communicating in a benefit-oriented manner.\n• Participants and the Financial Education Instructor exhibit respect for one another.\nFinancial Education Instructor addresses stressful financial topics tactfully.\nFramework for Teaching Personal Finance\n\nBasic • The quality of interactions between Financial Education Instructor and participants, or among participants, is uneven, with occasional disrespect or insensitivity.\n• Financial Education Instructor attempts to respond to disrespectful behavior among participants, with uneven results.\n• Financial Education Instructor attempts to make connections with individual participants, but participant reactions indicate that these attempts are not entirely successful.\nUnsatisfactory • Financial Education Instructor is disrespectful towards participants or insensitive to participants’ ages, cultural backgrounds, and developmental levels.\n• Participants’ body language indicates feelings of hurt, discomfort, or insecurity.\n• Financial Education Instructor displays no familiarity with, or caring about, individual participants.\n• Financial Education Instructor disregards disrespectful interactions among participants.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "dd583e5e-63f0-4d9e-a75c-4bd551d4e360", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 49, "page_end": 50, "section": null, "lang": "en", "text": "splays no familiarity with, or caring about, individual participants.\n• Financial Education Instructor disregards disrespectful interactions among participants.\nFramework for Teaching Personal Finance\n\n2b: Establishing a culture for learning and application of financial principles.\nUnsatisfactory The classroom/web-based learning culture is characterized by a lack of Financial Education Instructor or participant commitment to learning, and/or little or no investment of participant energy in the task at hand. Hard work is not expected or valued. Medium to low expectations for participant achievement are the norm, with high expectations for learning reserved for only one or two participants.\nBasic The classroom/web-based learning culture is characterized by only moderate commitment to learning by Financial Education Instructor or participants. The Financial Education Instructor appears to be only “going through the motions,” and participants indicate that they are interested in the completion of a task rather than the quality of the work. Financial Education Instructor conveys that participant success is the result of natural ability rather than hard work and refers only in passing to the precise use of language and financial concepts. High expectations for learning are reserved for those participants believed to have a natural aptitude for the subject.\nProficient The culture of the learning environment is one where learning is valued by all, and high expectations for both learn", "created_at": "2025-10-09"}
{"id": "c0d62317-1df6-4e5f-9447-eafab8775bc9", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 50, "page_end": 52, "section": null, "lang": "en", "text": "those participants believed to have a natural aptitude for the subject.\nProficient The culture of the learning environment is one where learning is valued by all, and high expectations for both learning and hard work are the norm for most participants.\nParticipants understand their role as learners and consistently expend effort to learn.\nClassroom/web-based learning technology interactions support learning and hard work and the precise use of relevant language.\nDistinguished The classroom/web-based learning culture is a cognitively busy place, characterized by a shared belief in the importance of learning. The Financial Education Instructor conveys high expectations for learning by all participants and insists on hard work; participants assume responsibility for high quality by initiating improvements, making revisions, adding detail, and/or assisting peers in precise use of language.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "22138500-a362-43ba-8934-e1e410d45ce0", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 52, "page_end": 53, "section": null, "lang": "en", "text": "ticipants assume responsibility for high quality by initiating improvements, making revisions, adding detail, and/or assisting peers in precise use of language.\nFramework for Teaching Personal Finance\n\nDistinguished • Financial Education Instructor communicates passion for the subject and confidence in participants’ ability to master the content.\n• Financial Education Instructor conveys the satisfaction that accompanies a deep understanding of complex content.\n• Participants indicate through their questions and comments a desire to understand the content.\n• Participants assist their classmates to understand the content.\n• Participants take initiative to improve the quality of their work.\n• Participants actively seek new, positive influencers to guide their financial decisions.\n• Participants respectfully correct one another in their use of financial concepts and language.\n• Participants willingly take primary responsibility for their own financial capability.\nParticipants establish ongoing relationships with trusted financial coaches/mentors.\nProficient • Financial Education Instructor communicates the impact and benefits of mastering financial capability skills.\n• Financial Education Instructor demonstrates a high regard for participants’ abilities and uses the Transtheoretical Model of Behavior Change to support their progress.\n• Financial Education Instructor conveys an expectation of high levels of participant ability to change and grow in financial skills.\n• Participants", "created_at": "2025-10-09"}
{"id": "90f0cc0b-799e-44d1-9b6e-ee96359e87ff", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 53, "page_end": 53, "section": null, "lang": "en", "text": "Model of Behavior Change to support their progress.\n• Financial Education Instructor conveys an expectation of high levels of participant ability to change and grow in financial skills.\n• Participants expend good effort to complete work of high quality.\n• Financial Education Instructor insists on precise use of language by participants.\n• Qualified Financial Education Instructor demonstrates the effect of influencers (family, education, role models, environment, and advertising) in financial decision-making.\n• Financial Education Instructor elicits concrete values/goals/dreams participants can use to counteract negative influencers.\n• Financial Education Instructor conveys what it means for participants to take primary responsibility for their own financial capability.\n• Financial Education Instructor demonstrates the value of finding a trustworthy, qualified coach/mentor for ongoing financial advice.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "3f54af58-cea6-4882-8eec-8bc98197c82c", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 53, "page_end": 54, "section": null, "lang": "en", "text": "own financial capability.\n• Financial Education Instructor demonstrates the value of finding a trustworthy, qualified coach/mentor for ongoing financial advice.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor energy for the work is neutral, neither indicating a high level of commitment nor ascribing the need to do the work to external forces.\n• Financial Education Instructor conveys high expectations for only some participants.\n• Participants exhibit a limited commitment to complete the work on their own; many participants indicate that they are looking for an easy path.\n• Financial Education Instructor primary concern appears to be to complete the task at hand.\n• Financial Education Instructor urges, but does not insist, that participants use precise language.\nUnsatisfactory • Financial Education Instructor conveys that there is little or no purpose for the work, or that the reasons for doing it are driven by external factors.\n• Financial Education Instructor conveys to at least some participants that the work is too challenging for them.\n• Participants exhibit little or no pride in their work.\n• Participants use language incorrectly; Financial Education Instructor does not correct them.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "986639c0-031e-40e2-9ea2-c59463c51dac", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 54, "page_end": 55, "section": null, "lang": "en", "text": "or them.\n• Participants exhibit little or no pride in their work.\n• Participants use language incorrectly; Financial Education Instructor does not correct them.\nFramework for Teaching Personal Finance\n\n2c: Managing classroom and/or technology-based procedures.\nUnsatisfactory Much instructional time is lost due to inefficient classroom routines and procedures.\nThere is little or no evidence of Financial Education Instructor managing instructional groups and transitions and/or effective handling of materials and supplies. There is little evidence that participants know or follow established routines.\nBasic Some instructional time is lost due to only partially effective classroom/web-based technology routines and procedures.\nFinancial Education Instructor management of instructional groups and transitions and/or handling of materials and supplies is inconsistent, leading to some disruption of learning. With regular guidance and prompting, participants follow established routines.\nProficient There is little loss of instructional time because learning environment routines and procedures are effective.\nFinancial Education Instructor management of instructional groups and transitions and/or handling of materials and supplies is consistently successful. With minimal guidance and prompting, participants follow established learning routines.\nDistinguished Instructional time is maximized due to efficient and seamless classroom routines and procedures. Participants take initiative in the", "created_at": "2025-10-09"}
{"id": "b373e2af-9601-43ac-abed-0060bea266c9", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 55, "page_end": 55, "section": null, "lang": "en", "text": "g, participants follow established learning routines.\nDistinguished Instructional time is maximized due to efficient and seamless classroom routines and procedures. Participants take initiative in the management of instructional groups and transitions and/or the handling of materials and supplies.\nRoutines are well-understood and may be initiated by participants.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "992d3464-fb1f-43e4-a824-9b224cbdf2f9", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 55, "page_end": 56, "section": null, "lang": "en", "text": "gement of instructional groups and transitions and/or the handling of materials and supplies.\nRoutines are well-understood and may be initiated by participants.\nFramework for Teaching Personal Finance\n\nDistinguished • With minimal prompting by Financial Education Instructor, participants ensure that their time is used productively.\n• Participants take initiative in distributing and collecting materials efficiently.\n• Participants themselves ensure that transitions and other routines are accomplished smoothly.\n• Classroom routines function seamlessly; Financial Education Instructor demonstrates ability to shift smoothly between individual, paired, cooperative, and whole-class methods.\n• Financial Education Instructor stays current with most prevalent psychological, sociological, and economic theories underpinning behavior change models, and how those models apply to teaching financial behavior.\n• Financial Education Instructor involves participants in developing procedures for accessing text-on-screen, audio/video lectures, and game-based learning.\nProficient Participants are productively engaged during small-group or independent work.\n• Transitions between large- and small-group activities are smooth.\n• Routines for distribution and collection of materials and supplies work efficiently.\n• Classroom routines function smoothly; Financial Education Instructor adjusts course format/length to meet participant needs.\n• Financial Education Instructor uses consistent education model", "created_at": "2025-10-09"}
{"id": "31ae1255-deb9-4ac6-9ffe-55378fb461c5", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 56, "page_end": 57, "section": null, "lang": "en", "text": "iently.\n• Classroom routines function smoothly; Financial Education Instructor adjusts course format/length to meet participant needs.\n• Financial Education Instructor uses consistent education model as a framework for instruction.\n• Transitions between in-class and web-based instruction are smooth.\n• Financial Education Instructor implements procedures for accessing text-on-screen, audio/ video lectures, and game-based learning.\nFramework for Teaching Personal Finance\n\nBasic • Participants who are not working directly with Financial Education Instructor are only partially engaged.\n• Procedures for transitions seem to have been established, but their operation is not smooth.\n• There appear to be established routines for distribution and collection of materials, but participants are confused about how to carry them out.\n• Classroom routines function unevenly.\nUnsatisfactory • Participants who are not working with Financial Education Instructor are not productively engaged.\n• Transitions are disorganized, with much loss of instructional time.\n• There appear to be no established procedures for distributing and collecting materials.\n• A considerable amount of time is spent off-task because procedures are unclear.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "5193a091-5670-4ba5-acfe-f92db05348a5", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 57, "page_end": 58, "section": null, "lang": "en", "text": "ear to be no established procedures for distributing and collecting materials.\n• A considerable amount of time is spent off-task because procedures are unclear.\nFramework for Teaching Personal Finance\n\n2d: Managing participant conduct to support learning process.\nUnsatisfactory There appear to be no established standards of conduct, or participants challenge the standards. There is little or no participant behavior monitoring by Financial Education Instructor, and response to participants’ misbehavior is repressive or disrespectful of participant dignity.\nBasic Standards of conduct appear to have been established, but their implementation is inconsistent. Financial Education Instructor tries, with uneven results, to monitor participant behavior and respond to participant misbehavior.\nProficient Participant behavior is generally appropriate. Financial Education Instructor monitors participant behavior against established standards of conduct. Financial Education Instructor response to participant misbehavior is consistent, proportionate, respectful to participants, and effective.\nDistinguished Participant behavior is entirely appropriate. Participants take an active role in monitoring their own and other participants’ behavior against standards of conduct.\nFinancial Education Instructor monitoring of participant behavior is subtle and preventive. Financial Education Instructor response to participant misbehavior is sensitive to individual needs and respects participants’ digni", "created_at": "2025-10-09"}
{"id": "1e09d6d8-cb77-4435-aeff-1c78706594a4", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 58, "page_end": 58, "section": null, "lang": "en", "text": "ructor monitoring of participant behavior is subtle and preventive. Financial Education Instructor response to participant misbehavior is sensitive to individual needs and respects participants’ dignity.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "7e43b9e3-f226-46f6-9d9a-481d60d639a2", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 58, "page_end": 58, "section": null, "lang": "en", "text": "s subtle and preventive. Financial Education Instructor response to participant misbehavior is sensitive to individual needs and respects participants’ dignity.\nFramework for Teaching Personal Finance\n\nDistinguished • Participant behavior is entirely appropriate; any participant misbehavior is minor and swiftly handled.\n• Financial Education Instructor silently and subtly monitors participant behavior.\n• Participants respectfully intervene with other participants at appropriate moments to ensure compliance with standards of conduct.\n• Financial Education Instructor weaves participants’ experiences (goals, dreams, challenges, and motivators) into lessons.\nProficient • Standards of conduct appear to have been established and implemented successfully.\n• Overall, participant behavior is generally appropriate.\n• Financial Education Instructor frequently monitors participant behavior and level of engagement through real-time feedback (hands raised, body language, and questions asked).\n• Financial Education Instructor response to participant misbehavior is effective.\n• Financial Education Instructor often demonstrates understanding of participants’ experience (goals, dreams, challenges, and motivators).\nBasic • Financial Education Instructor attempts to maintain order in the classroom/web-based environment, referring to rules, but with uneven success.\n• Financial Education Instructor attempts to keep track of participant behavior, but with no apparent system.\n• Financial Education I", "created_at": "2025-10-09"}
{"id": "170e419e-53cf-4a6c-aedc-f90f07c2fab1", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 58, "page_end": 58, "section": null, "lang": "en", "text": "eb-based environment, referring to rules, but with uneven success.\n• Financial Education Instructor attempts to keep track of participant behavior, but with no apparent system.\n• Financial Education Instructor response to participant misbehavior is inconsistent: sometimes harsh, other times lenient.\nUnsatisfactory • The classroom/web-based environment is chaotic, with no standards of conduct evident.\n• Financial Education Instructor does not monitor participant behavior.\n• Some participants disrupt the classroom, without apparent Financial Education Instructor awareness or with an ineffective response.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "5bb2ffe5-dab1-4cbe-92a8-0606c62eb28b", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 58, "page_end": 59, "section": null, "lang": "en", "text": "itor participant behavior.\n• Some participants disrupt the classroom, without apparent Financial Education Instructor awareness or with an ineffective response.\nFramework for Teaching Personal Finance\n\n2e: Organizing physical and/or virtual space.\nUnsatisfactory The classroom/web-based learning environment is unsafe, or learning is inaccessible to many participants. There is poor alignment between the arrangement of furniture and resources, including computer technology, and the lesson activities.\nBasic The classroom/web-based learning environment is mostly safe and essential learning is accessible to most participants. Financial Education Instructor makes modest use of physical resources, including computer technology. Financial Education Instructor attempts to adjust the classroom furniture for a lesson, adjust the lesson to the furniture, or utilize required computer technology if necessary, but with limited effectiveness.\nProficient The classroom/web-based learning environment is safe for all, and participants have equal access to learning activities.\nFinancial Education Instructor ensures that the furniture arrangement is appropriate to the learning activities and uses physical resources, including computer technology, effectively.\nDistinguished The classroom/web-based learning environment is safe, and learning is accessible to all participants, including those with special needs. Financial Education Instructor makes effective use of physical resources, including compute", "created_at": "2025-10-09"}
{"id": "0ddd8d24-ade0-47b3-b211-c00943df86ca", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 59, "page_end": 59, "section": null, "lang": "en", "text": "ing environment is safe, and learning is accessible to all participants, including those with special needs. Financial Education Instructor makes effective use of physical resources, including computer technology. Financial Education Instructor ensures that the physical arrangement, as well as computer technology, is appropriate to the learning activities. Participants contribute to the use or adaptation of the physical/web-based environment to advance learning.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "86fdb745-3fc3-435b-b3aa-14845c4a5530", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 59, "page_end": 60, "section": null, "lang": "en", "text": "chnology, is appropriate to the learning activities. Participants contribute to the use or adaptation of the physical/web-based environment to advance learning.\nFramework for Teaching Personal Finance\n\nDistinguished • Modifications are made to the physical or web-based learning environment to accommodate participants with special needs.\n• There is total alignment between the learning activities and the classroom or web-based environment.\n• Participants take the initiative to adjust the physical environment or web-based learning environment to better suit their learning.\n• Financial Education Instructor and participants make extensive and imaginative use of available technology.\nProficient • The classroom is safe and/or web-based learning environment is accessible, and all participants are able to see and hear.\n• The classroom or web-based environment is arranged to support the instructional goals and learning activities.\n• Financial Education Instructor makes appropriate use of available technology to enhance learning.\n• Financial Education Instructor utilizes non-lecture-based teaching methods, and selects activities that engage participants beyond worksheets.\nBasic • The physical environment is safe or web-based learning environment is accessible, and most participants can see and hear.\n• The classroom or web-based environment is not an impediment to learning but does not enhance it.\n• Financial Education Instructor makes limited use of available technology and other resour", "created_at": "2025-10-09"}
{"id": "5881322a-c421-48c7-b97c-63ea9ec19ebc", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 60, "page_end": 60, "section": null, "lang": "en", "text": "and hear.\n• The classroom or web-based environment is not an impediment to learning but does not enhance it.\n• Financial Education Instructor makes limited use of available technology and other resources.\nUnsatisfactory • There are physical hazards in the classroom, endangering participant safety or access to webbased learning access.\n• Many participants can’t see or hear Financial Education Instructor or board/screen.\n• Appropriate technology is not being used, even if it is available and its use would enhance the lesson.\nFramework for Teaching Personal Finance\n\nDomain 3:\nInstruction Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "ab39b551-4375-4e6f-8e87-87a2d2632a15", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 60, "page_end": 62, "section": null, "lang": "en", "text": "riate technology is not being used, even if it is available and its use would enhance the lesson.\nFramework for Teaching Personal Finance\n\nDomain 3:\nInstruction Framework for Teaching Personal Finance\n\nFramework Overview: Delivery of Services 3a: Communicating with participants about 3d: Using assessment in instruction to acquiring or changing financial behaviors. measure behavioral change.\nPurpose for learning Assessment criteria Explanation of content and key Monitoring of participant learning vocabulary Quality feedback to participants Directions and procedures Participant self- or peer assessment Use of oral and written language 3e: Demonstrating flexibility and 3b: Using questioning and discussion responsiveness to participants’ learning techniques that promote positive financial needs.\nbehaviors.\nLesson or activity adjustment Quality of questions Response to participants Discussion techniques Persistence Participant involvement and commitment 3c: Engaging participants with relevant financial instruction.\nLearning tasks Grouping of participants Financial instructional materials and resources Structure and pacing Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "bf3045ff-be7c-4227-9186-7596ecf81804", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 62, "page_end": 62, "section": null, "lang": "en", "text": "g participants with relevant financial instruction.\nLearning tasks Grouping of participants Financial instructional materials and resources Structure and pacing Framework for Teaching Personal Finance\n\n3a: Communicating with participants about acquiring or changing financial behaviors.\nUnsatisfactory The instructional purpose of the lesson is unclear to participants, and the directions and procedures are confusing. Financial Education Instructor explanation of the content contains major errors and includes no explanation of strategies participants might use. Financial Education Instructor’s spoken or written language contains errors of grammar or syntax. Financial Education Instructor’s academic vocabulary is inappropriate, vague, or used incorrectly, leaving participants confused. The instructor teaches lessons that do not align with participant interests, delivers a boring presentation, and lacks communication that elicits behavior acquisition or change.\nBasic Financial Education Instructor’s attempt to explain the instructional purpose has only limited success, and/or directions and procedures must be clarified after initial participant confusion. Financial Education Instructor’s explanation of the content may contain minor errors; some portions are clear, others difficult to follow. Financial Education Instructor’s explanation does not invite participants to engage intellectually or to understand strategies they might use when working independently.\nFinancial Education In", "created_at": "2025-10-09"}
{"id": "3eb3ba70-9360-4214-9078-9d1089b811c8", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 62, "page_end": 63, "section": null, "lang": "en", "text": "follow. Financial Education Instructor’s explanation does not invite participants to engage intellectually or to understand strategies they might use when working independently.\nFinancial Education Instructor’s spoken language is correct but uses vocabulary that is either limited or not fully appropriate to the participants’ ages or backgrounds.\nFinancial Education Instructor rarely takes opportunities to explain academic vocabulary. Instructor lacks engagement that elicits behavior acquisition or change.\nProficient The instructional purpose of the lesson is clearly communicated to participants, including where it is situated within broader learning; directions and procedures are explained clearly and may be modeled. Financial Education Instructor’s explanation of content is scaffolded, clear, and accurate and connects with participants’ knowledge and experience. During the explanation of content, Financial Education Instructor focuses, as appropriate, on strategies participants can use when working independently and invites participant intellectual engagement. Financial Education Instructor’s spoken and written language is clear and correct, suitable to participants’ ages and interests, and moves them to take positive action toward financial wellness.\nFinancial Education Instructor’s use of academic vocabulary is precise and serves to extend participant understanding while being persuasive in nature and strategically promoting the implementation of the lessons into their liv", "created_at": "2025-10-09"}
{"id": "8f71f387-701d-4da4-a4ed-cecee639aa7a", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 63, "page_end": 63, "section": null, "lang": "en", "text": "tor’s use of academic vocabulary is precise and serves to extend participant understanding while being persuasive in nature and strategically promoting the implementation of the lessons into their lives.\nFramework for Teaching Personal Finance\n\n3a: Communicating with participants about acquiring or changing financial behaviors. (cont.) Distinguished Financial Education Instructor links the instructional purpose of the lesson to the larger curriculum; the directions and procedures are clear and anticipate possible participant misunderstanding. Financial Education Instructor’s explanation of content is thorough and clear, developing conceptual understanding through scaffolding and connecting with participants’ interests. Participants contribute to extending the content by explaining concepts to their classmates and suggesting strategies that might be used. Financial Education Instructor’s spoken and written language is expressive, and Financial Education Instructor finds opportunities to extend participants’ vocabularies both within the discipline and for more general use.\nParticipants contribute to the correct use of academic vocabulary and are actively involved in working toward the goal of moving toward financial wellness.\nFinancial Education Instructor has successfully enlisted participants in promoting the implementation of the lessons into their lives.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "e05ba953-7b7c-4f8a-a498-6221c0a93bd7", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 63, "page_end": 64, "section": null, "lang": "en", "text": "oward financial wellness.\nFinancial Education Instructor has successfully enlisted participants in promoting the implementation of the lessons into their lives.\nFramework for Teaching Personal Finance\n\nDistinguished • If asked, participants are able to explain what they are learning and where it fits into the larger curriculum context.\n• Financial Education Instructor explains content clearly and imaginatively, using metaphors and analogies to bring content to life.\n• Financial Education Instructor points out possible areas for misunderstanding.\n• Financial Education Instructor invites participants to explain the content to their classmates.\n• Participants suggest other strategies they might use when approaching a challenge or analysis.\n• Financial Education Instructor uses rich language, offering brief vocabulary lessons where appropriate, both for general vocabulary and for the discipline.\n• Participants use academic language correctly.\n• Participants are able to effectively utilize and/or implement vocabulary terms provided by the Financial Education Instructor.\n• Participants are able to clearly communicate benefits of acquiring or changing financial behaviors with their peers in the classroom and loved ones outside the classroom.\n• The participants are empowered to support their peers because the Financial Education Instructor has established a clear instructional framework.\n• The Financial Education Instructor helps develop a culture of peer learning where participants", "created_at": "2025-10-09"}
{"id": "472b787b-c927-4581-b8c2-9a61cb492f19", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 64, "page_end": 65, "section": null, "lang": "en", "text": "heir peers because the Financial Education Instructor has established a clear instructional framework.\n• The Financial Education Instructor helps develop a culture of peer learning where participants feel comfortable sharing personal stories.\n• Participants understand the reasons why they want to take action on the financial education lessons and begin applying what they learned into their lives.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "f9dd7f5e-79b0-4301-882e-69ccda8bc6f5", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 65, "page_end": 66, "section": null, "lang": "en", "text": "es.\n• Participants understand the reasons why they want to take action on the financial education lessons and begin applying what they learned into their lives.\nFramework for Teaching Personal Finance\n\nProficient • Financial Education Instructor states clearly, at some point during the lesson, what the participants will be learning.\n• If appropriate, Financial Education Instructor models the process to be followed in the task.\n• Participants engage with the learning task, indicating that they understand what they are to do.\n• Financial Education Instructor makes no content errors.\n• Financial Education Instructor explanation of content is clear and invites participation and thinking.\n• Financial Education Instructor describes specific strategies participants might use, inviting participants to interpret them in the context of what they’re learning.\n• Financial Education Instructor vocabulary and usage are correct and entirely suited to the lesson, including, where appropriate, explanations of academic vocabulary.\n• Financial Education Instructor vocabulary is appropriate to participants’ ages and developmental levels.\n• Financial Education Instructor introduces practical, relevant personal finance terms (can employ Marzano’s six-step process).\n• Financial Education Instructor employs a clear framework for instruction (can employ NFEC’s model: motivate, engage, educate, and move to action).\n• Financial Education Instructor builds rapport with participants through active listen", "created_at": "2025-10-09"}
{"id": "fb40e4e3-1671-4192-8b6a-75ed45c74b40", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 66, "page_end": 66, "section": null, "lang": "en", "text": "loys a clear framework for instruction (can employ NFEC’s model: motivate, engage, educate, and move to action).\n• Financial Education Instructor builds rapport with participants through active listening and sharing personal stories that can help build trust with the audience.\n• Financial Education Instructor addresses multiple intelligences (can employ Gardner’s Multiple Intelligences Theory).\n• Financial Education Instructor incorporates persuasion elements and action-driven language into lessons (can employ NFEC’s Sales / Persuasion technique: uncover needs and goals, build relationship, offer benefit-oriented solution, motivate to action).\n• The Financial Education Instructor helps participants understand the impact of their finances on other areas of their lives: health, happiness, productivity, relationships, security, and lifestyle.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "1ccb8ea4-738e-4947-9bbc-f1b67ba74c7a", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 66, "page_end": 67, "section": null, "lang": "en", "text": "lps participants understand the impact of their finances on other areas of their lives: health, happiness, productivity, relationships, security, and lifestyle.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor provides little elaboration or explanation about what the participants will be learning.\n• Financial Education Instructor must clarify the learning task so participants can complete it.\n• Financial Education Instructor makes no serious content errors but may make minor ones.\n• Financial Education Instructor explanation of the content consists of a monologue, with minimal participation or intellectual engagement by participants.\n• Financial Education Instructor explanations of content are purely procedural, with no indication of how participants can think strategically.\n• Financial Education Instructor vocabulary and usage are correct but unimaginative.\n• When Financial Education Instructor attempts to explain academic vocabulary, the effort is only partially successful.\n• Financial Education Instructor vocabulary is too advanced, or too juvenile, for participants.\nUnsatisfactory • At no time during the lesson does Financial Education Instructor convey to participants what they will be learning.\n• Participants indicate through their questions that they are confused about the learning task.\n• Financial Education Instructor makes a serious content error that will affect participants’ understanding of the lesson.\n• Participants indicate throug", "created_at": "2025-10-09"}
{"id": "926d7f7d-8a2c-4725-97aa-de62624b0587", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 67, "page_end": 67, "section": null, "lang": "en", "text": "hat they are confused about the learning task.\n• Financial Education Instructor makes a serious content error that will affect participants’ understanding of the lesson.\n• Participants indicate through body language or questions that they don’t understand the content being presented.\n• Financial Education Instructor communications include errors of vocabulary or imprecise use of academic language.\n• Financial Education Instructor vocabulary is inappropriate to participants’ ages or cultures.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "0d8650e1-4c8a-495b-8fea-31c4c5ad5ceb", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 67, "page_end": 68, "section": null, "lang": "en", "text": "lude errors of vocabulary or imprecise use of academic language.\n• Financial Education Instructor vocabulary is inappropriate to participants’ ages or cultures.\nFramework for Teaching Personal Finance\n\n3b: Using questioning and discussion techniques that promote positive financial behaviors.\nUnsatisfactory Financial Education Instructor’s questions are of low cognitive challenge, with single correct responses, and are asked in rapid succession. Instructor does not build rapport with participants or gain a better understanding of whom he/she is teaching.\nInteraction between Financial Education Instructor and participants is predominantly recitation-style, with Financial Education Instructor mediating all questions and answers; Financial Education Instructor accepts all contributions without asking participants to justify their reasoning. Only a few participants participate in the discussion.\nBasic Financial Education Instructor’s questions lead participants through a single path of inquiry, with answers seemingly determined in advance.\nInstructor does not use questioning for motivational purposes or get to know the participants on a deeper level. Alternatively, Financial Education Instructor attempts to ask some questions designed to engage participants in thinking, but only a few participants are involved. Financial Education Instructor attempts to engage all participants in the discussion, to encourage them to respond to one another, and to explain their thinking, with uneve", "created_at": "2025-10-09"}
{"id": "87a385ac-2ae2-42df-b077-0294308751ec", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 68, "page_end": 69, "section": null, "lang": "en", "text": "participants are involved. Financial Education Instructor attempts to engage all participants in the discussion, to encourage them to respond to one another, and to explain their thinking, with uneven results.\nProficient While Financial Education Instructor may use some low- level questions, he or she poses questions designed to promote participant thinking and understanding. Instructor uses strategic questioning to understand the participants, what motivates them, and their deeper values. Financial Education Instructor creates genuine discussion among participants, providing adequate time for participants to respond and stepping aside when appropriate. Financial Education Instructor challenges participants to justify their thinking and successfully engages most participants in the discussion, employing a range of strategies to ensure that most participants are heard. Financial Education Instructor’s questions take participants through processes that promote positive financial behaviors.\nDistinguished Financial Education Instructor uses a variety or series of questions or prompts to challenge participants cognitively, advance high-level thinking and discourse, and promote metacognition. Through strategic questioning the participants reflect on their values, lifestyle goals, and dreams that provide reasons for them to take action on the personal finance lesson plans. Participants formulate many questions, initiate topics, challenge one another’s thinking, and make unsolicited", "created_at": "2025-10-09"}
{"id": "bbbd8e48-9896-47f5-ad0b-cf646d1417a8", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 69, "page_end": 69, "section": null, "lang": "en", "text": "dreams that provide reasons for them to take action on the personal finance lesson plans. Participants formulate many questions, initiate topics, challenge one another’s thinking, and make unsolicited contributions. Participants themselves ensure that all voices are heard in the discussion.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "f2f221c7-eb4e-4c28-a12d-b2f8bcb4f091", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 69, "page_end": 69, "section": null, "lang": "en", "text": "itiate topics, challenge one another’s thinking, and make unsolicited contributions. Participants themselves ensure that all voices are heard in the discussion.\nFramework for Teaching Personal Finance\n\nDistinguished • Participants initiate higher-order questions.\n• Financial Education Instructor builds on and uses participant responses to questions in order to deepen participant understanding.\n• Participants extend the discussion, enriching it.\n• Participants invite comments from their classmates during a discussion and challenge one another’s thinking.\n• Virtually all participants are engaged in the discussion.\n• Participants reflect on Financial Education Instructor questions to gain deeper insight into the emotions, experiences, and personal beliefs they currently have and the changes they must make to reach their financial goals.\n• Participants take the questions posed by the Financial Education Instructor to gain insight into their personal finance goals and behaviors needed to attain those objectives.\n• Participants ask questions that help them become aware of the personal finance areas they need to address.\n• Participants are able to ask clear questions on project based-learning assignments and other participant-led projects.\n• Based on Maslow’s Hierarchy of Needs, the Financial Education Instructor recognizes at which level participants are operating and chooses lessons appropriately.\nProficient • Financial Education Instructor uses open-ended questions, inviting part", "created_at": "2025-10-09"}
{"id": "5c1a0fa4-fe9c-4331-addd-b069d35562a0", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 69, "page_end": 70, "section": null, "lang": "en", "text": "ancial Education Instructor recognizes at which level participants are operating and chooses lessons appropriately.\nProficient • Financial Education Instructor uses open-ended questions, inviting participants to think and/or offer multiple possible answers.\n• Financial Education Instructor makes effective use of wait time.\n• Discussions enable participants to talk to one another without ongoing mediation by Financial Education Instructor.\n• Financial Education Instructor calls on most participants, even those who don’t initially volunteer.\n• Many participants actively engage in the discussion.\n• Financial Education Instructor asks participants to explain their reasoning, and most attempt to do so.\n• Financial Education Instructor asks clear questions that help identify the participants’ financial goals, dreams, and motivators and then incorporates these into the instruction.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "b51b4fb5-3cf3-4c5f-8829-c927663c8108", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 70, "page_end": 71, "section": null, "lang": "en", "text": "n Instructor asks clear questions that help identify the participants’ financial goals, dreams, and motivators and then incorporates these into the instruction.\nFramework for Teaching Personal Finance\n\n• Financial Education Instructor gains deeper understanding of the participants’ financial challenges.\n• Financial Education Instructor asks questions that help participants identify their current relationships with money, and the emotions surrounding their personal finances and relationships with money.\n• Financial Education Instructor asks questions that help participants understand the influence of emotions, experiences, and personal beliefs placed on the coursework and participants’ strategic questions to lead them toward financial wellness.\n• The Financial Education Instructor asks questions that help identify participant needs and teaches lessons that progress participants to higher level needs (can utilize Maslow’s Hierarchy of Needs – psychological, safety and security, love and belonging, self-esteem, self-actualization).\n• The Financial Education Instructor discovers at which stage of change participants currently are and delivers coursework that helps them move to higher levels (may utilize the Transtheoretical Model of Behavior Change – precontemplation, contemplation, preparation, action, maintenance, and termination).\n• The Financial Education Instructor asks questions to understand the topics that may cause stress with participants and strategically delivers less", "created_at": "2025-10-09"}
{"id": "f4b13452-52d1-44a4-acdb-a164334f570a", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 71, "page_end": 71, "section": null, "lang": "en", "text": "preparation, action, maintenance, and termination).\n• The Financial Education Instructor asks questions to understand the topics that may cause stress with participants and strategically delivers lessons that move participants past any emotional blocks.\n• Financial Education Instructor facilitates answering some profound questions that help participants understand their personal relationships with money and their future goals.\n• The Financial Education Instructor asks questions that clarify participants’ cognitive levels and delivers activities that take participants to higher levels (can employ Bloom’s Taxonomy of Cognitive Levels or Webb’s Depth of Knowledge).\n• Financial Education Instructor does not ask personal questions that may embarrass participants in class.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "beb2912f-6c4a-441d-b2b3-64eab358284a", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 71, "page_end": 73, "section": null, "lang": "en", "text": "my of Cognitive Levels or Webb’s Depth of Knowledge).\n• Financial Education Instructor does not ask personal questions that may embarrass participants in class.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor frames some questions designed to promote participant thinking, but many have a single correct answer.\n• Financial Education Instructor calls on participants quickly.\n• Financial Education Instructor invites participants to respond directly to one another’s ideas, but few participants respond.\n• Financial Education Instructor calls on many participants, but only a small number actually participate in the discussion.\n• Financial Education Instructor asks participants to justify their reasoning, but only some participants attempt to do so.\nUnsatisfactory • Questions are rapid-fire and convergent, with a single correct answer.\n• Questions do not invite participant thinking.\n• All discussion is between Financial Education Instructor and participants; participants are not invited to speak directly to one another.\n• Financial Education Instructor does not ask participants to explain their thinking.\n• A very few participants dominate the discussion.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "db156ce4-ac01-4a0a-8132-79c6452c7b7c", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 73, "page_end": 74, "section": null, "lang": "en", "text": "irectly to one another.\n• Financial Education Instructor does not ask participants to explain their thinking.\n• A very few participants dominate the discussion.\nFramework for Teaching Personal Finance\n\n3c: Engaging participants with relevant financial instruction.\nUnsatisfactory The learning tasks/ activities, materials, and resources are poorly aligned with the instructional outcomes, or require only rote responses with only one approach possible.\nParticipant groupings are unsuitable to the activities and the material is neither relevant nor delivered in a timely fashion. The lesson has no clearly-defined structure, or the pace of the lesson is too slow or rushed.\nBasic The learning tasks and activities require only minimal thinking by participants and little opportunity for them to explain their thinking or reflect on how it affects their lives, allowing most participants to be passive or merely compliant.\nThe lessons are not practical in nature and focus more on material that is not relevant to their lives. Participant groupings are moderately suitable to the activities. The lesson has a recognizable structure; however, the pacing of the lesson may not provide participants the time needed to be intellectually engaged or may be so slow that many participants have a considerable amount of “down time.” Proficient The learning tasks and activities are fully aligned with the instructional outcomes, relevant to participants’ lives, and delivered at an appropriate time. Lessons a", "created_at": "2025-10-09"}
{"id": "ad723565-8d3c-43e6-9de1-db582e5c1fe1", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 74, "page_end": 75, "section": null, "lang": "en", "text": "amount of “down time.” Proficient The learning tasks and activities are fully aligned with the instructional outcomes, relevant to participants’ lives, and delivered at an appropriate time. Lessons are designed to challenge participant thinking, inviting participants to make their thinking visible. This technique results in active intellectual engagement by most participants with important and challenging content and with Financial Education Instructor scaffolding to support that engagement.\nThe groupings of participants are suitable to the activities. The lesson has a clearlydefined structure and the pacing of the lesson is appropriate, providing most participants the time they need to be intellectually engaged.\nDistinguished Virtually all participants are intellectually engaged in challenging content through welldesigned learning tasks and activities that require complex thinking on their part. They participate in learning activities that are practical in nature, completing lessons they need in the real world.\nFinancial Education Instructor provides suitable scaffolding and challenges participants to explain their thinking. There is evidence of some participant initiation of inquiry and participant contributions to the exploration of important content; participants may serve as resources for one another. The lesson has a clearly-defined structure, and the pacing of the lesson provides participants the time they need, not only to intellectually engage and reflect upon their", "created_at": "2025-10-09"}
{"id": "bbd9c26a-fd2f-482b-924d-ba50c131733d", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 75, "page_end": 75, "section": null, "lang": "en", "text": "s resources for one another. The lesson has a clearly-defined structure, and the pacing of the lesson provides participants the time they need, not only to intellectually engage and reflect upon their learning but also to consolidate their understanding. The lessons inspire participants to take the initial steps toward forming positive financial behaviors.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "2adafc71-c9e8-4e56-9121-97b6e44eda3c", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 75, "page_end": 76, "section": null, "lang": "en", "text": "ir learning but also to consolidate their understanding. The lessons inspire participants to take the initial steps toward forming positive financial behaviors.\nFramework for Teaching Personal Finance\n\nDistinguished • Virtually all participants are intellectually engaged in the lesson.\n• Lesson activities require high-level participant thinking and explanations of their thinking.\n• Participants take initiative to improve the lesson by (1) modifying a learning task to make it more meaningful or relevant to their needs, • (2) suggesting modifications to the grouping patterns used, and/or (3) suggesting modifications or additions to the materials being used.\n• Participants have an opportunity for reflection and closure on the lesson to consolidate their understanding.\n• Participants understand that personal finance lessons are relevant to them and have impact on many areas of their lives.\n• Participants understand the relationship between the key financial touchpoints.\n• Participants reflect upon the different financial trends when planning for their financial futures.\n• Participants take lessons and activities they complete in class and use them in their lives.\n• Participants connect the financial decisions they make with emotions involved in the decisionmaking process.\nProficient • Most participants are intellectually engaged in the lesson.\n• Most learning tasks have multiple correct responses or approaches and/or encourage higherorder thinking.\n• Participants are invited to e", "created_at": "2025-10-09"}
{"id": "bc341237-d08c-4b04-b9b4-80a67c1223cf", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 76, "page_end": 77, "section": null, "lang": "en", "text": "• Most participants are intellectually engaged in the lesson.\n• Most learning tasks have multiple correct responses or approaches and/or encourage higherorder thinking.\n• Participants are invited to explain their thinking as part of completing tasks.\n• Financial Education Instructor uses groupings that are suitable to the lesson activities.\n• Materials and resources require intellectual engagement, as appropriate.\n• The pacing of the lesson provides participants the time they need to be intellectually engaged.\n• Financial Education Instructor leverages Internet and web-based resources to get timely financial information.\n• Financial Education Instructor uses evidence-based resources that include practical, timely, and relevant financial education lessons.\n• The Financial Education Instructor covers the key financial touchpoints – assets, income, debt, credit, insurance – and how they affect participants’ financial wellness.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "87039535-b761-44e5-b988-cb3969b44bc3", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 77, "page_end": 78, "section": null, "lang": "en", "text": "cial Education Instructor covers the key financial touchpoints – assets, income, debt, credit, insurance – and how they affect participants’ financial wellness.\nFramework for Teaching Personal Finance\n\n• The Financial Education Instructor shares common financial challenges that may affect participants so they can mold or modify their behaviors to help them avoid or recover from financially challenging situations.\n• The Financial Education Instructor helps participants understand the financial trends that may affect them.\n• The Financial Education Instructor delivers material that is educational and does not promote financial products or services.\n• The Financial Education Instructor has participants engage in practical activities that will benefit them in the real world.\n• The Financial Education Instructor helps participants develop personal criteria for finding knowledgeable financial mentors, advisors, and educators.\n• The Financial Education Instructor helps participants understand the impact of their finances on other areas of their lives: health, happiness, productivity, relationships, security, lifestyle.\n• Financial Education Instructor delivers timely lessons on financial topics relevant to participants’ lives.\n• The Financial Education Instructor provides tools for effective financial decision-making.\n• The Financial Education Instructor selects activities that demonstrate the impact of emotions on decision-making.\n• The Financial Education Instructor demonstrates t", "created_at": "2025-10-09"}
{"id": "67cf836b-7837-4199-8702-38b158fbc1fa", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 78, "page_end": 79, "section": null, "lang": "en", "text": "ctive financial decision-making.\n• The Financial Education Instructor selects activities that demonstrate the impact of emotions on decision-making.\n• The Financial Education Instructor demonstrates the relationship between values and financial goals.\nFramework for Teaching Personal Finance\n\nBasic • Some participants are intellectually engaged in the lesson.\n• Learning tasks are a mix of those requiring thinking and those requiring recall.\n• Participant engagement with the content is largely passive, and the learning consists primarily of facts or procedures.\n• The instructional groupings used are moderately appropriate to the activities.\n• Few of the materials and resources require participant thinking or ask participants to explain their thinking.\n• The pacing of the lesson is uneven – suitable in parts but rushed or dragging in others.\nUnsatisfactory • Few participants are intellectually engaged in the lesson.\n• Learning tasks/activities and materials require only recall or have a single correct response or method.\n• Only one type of instructional group is used (whole group, small groups) when variety would promote more participant engagement.\n• Instructional materials used are unsuitable to the lesson and/or the participants.\n• The lesson drags or is rushed.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "fedc64af-3163-4de6-b453-20429ca8361c", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 79, "page_end": 80, "section": null, "lang": "en", "text": "would promote more participant engagement.\n• Instructional materials used are unsuitable to the lesson and/or the participants.\n• The lesson drags or is rushed.\nFramework for Teaching Personal Finance\n\n3d: Using assessment in instruction to measure behavioral change.\nUnsatisfactory Participants do not appear to be aware of the assessment criteria, and there is little or no monitoring of participant learning; feedback is absent or poor quality.\nParticipants do not engage in self- or peer assessment.\nBasic Participants appear to be only partially aware of the assessment criteria, and Financial Education Instructor monitors participant learning for the class as a whole.\nQuestions and assessments are rarely used to diagnose evidence of learning.\nFeedback to participants is general; few participants assess their own work and no long-term measurements are in place.\nProficient Participants are aware of the assessment criteria, and Financial Education Instructor monitors participant learning. Questions and assessments are regularly used to diagnose evidence of learning through short-term testing, surveys, and long-term measurements that demonstrate they have taken action on the lessons learned.\nFeedback to groups of participants is accurate and specific; some participants engage in self-assessment.\nDistinguished Assessment is fully integrated into instruction through extensive use of formative measures. Participants appear to be aware of, and there is some evidence that they have con", "created_at": "2025-10-09"}
{"id": "b25d426d-871b-4542-82fe-575a374988fa", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 80, "page_end": 80, "section": null, "lang": "en", "text": "assessment.\nDistinguished Assessment is fully integrated into instruction through extensive use of formative measures. Participants appear to be aware of, and there is some evidence that they have contributed to, the assessment criteria. Questions and assessments are used regularly to diagnose evidence of learning by individual participants and quantifiable long-term measurements are in place to accurately gauge financial capabilities. A variety of feedback methods, from both Financial Education Instructor and peers, is accurate and specific and advances learning.\nParticipants self-assess and monitor their own progress. Financial Education Instructor successfully differentiates instruction to address individual participants’ misunderstandings. Financial Education Instructor continues to monitor the participants’ implementation of the lessons and have learning tools they can deploy to give participants ongoing education depending on the outcomes of the long-term assessments.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "ac5fe6df-5c02-48c5-b5c4-74e64574fe82", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 80, "page_end": 81, "section": null, "lang": "en", "text": "ementation of the lessons and have learning tools they can deploy to give participants ongoing education depending on the outcomes of the long-term assessments.\nFramework for Teaching Personal Finance\n\nDistinguished • Participants indicate that they clearly understand the characteristics of high-quality work, and there is evidence that participants have helped establish the evaluation criteria.\n• Financial Education Instructor is constantly “taking the pulse” of the class; monitoring of participant understanding is sophisticated and continuous and makes use of strategies to elicit evidence of individual participant understanding.\n• Participants monitor their own understanding, either at their own initiative or as a result of tasks set by Financial Education Instructor.\n• High-quality feedback comes from many sources, including participants; it is specific and focused on improvement.\n• Participants recognize areas where they may need further study.\n• Participants feel motivated to participate in longer-term measurements and personally assess their results.\n• Participants use in-class measurements to locate peers who may be able to assist them with topics they find challenging.\n• Participants leverage assessments as learning tools to improve their financial capabilities.\nProficient • Financial Education Instructor makes the standards of high-quality work clear to participants.\n• Financial Education Instructor elicits evidence of participant understanding.\n• Participants are inv", "created_at": "2025-10-09"}
{"id": "15bc5cfb-59a2-437a-97d4-f54749b8ff87", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 81, "page_end": 82, "section": null, "lang": "en", "text": "• Financial Education Instructor makes the standards of high-quality work clear to participants.\n• Financial Education Instructor elicits evidence of participant understanding.\n• Participants are invited to assess their own work and make improvements; most of them do so.\n• Feedback includes specific and timely guidance at least for groups of participants.\n• Financial Education Instructor uses participant feedback and in-class assessments which can include: pre- and post-tests, surveys, consultation, and general feedback to modify lessons and teaching style.\n• Financial Education Instructor uses in-class assessments to form longer-term assessments that measure knowledge retention and positive behaviors.\n• Financial Education Instructor uses formative and summative assessments.\n• Financial Education Instructor develops long-term measurements that can demonstrate and quantify behavior molding or modification.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "a9347bef-d896-41ef-9043-0253c9fb6862", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 82, "page_end": 83, "section": null, "lang": "en", "text": "and summative assessments.\n• Financial Education Instructor develops long-term measurements that can demonstrate and quantify behavior molding or modification.\nFramework for Teaching Personal Finance\n\n• Financial Education Instructor employs frameworks that help evaluate participant comprehension (can employ Bloom’s Taxonomy of Cognitive Skills).\n• Financial Education Instructor uses appropriate measurements to quantify results in terms of both knowledge and application.\n• Financial Education Instructor utilizes real-time feedback (e.g., raised hands, body language, questions asked) to measure participant engagement and comprehension.\n• Financial Education Instructor recognizes elements of well-written goals (specific, measurable, achievable, realistic, time-based) to create measurable learning objectives.\n• Financial Education Instructor uses measurement tools to determine participants’ level of financial knowledge and to identify participant challenges, needs, and motivators.\n• Financial Education Instructor assesses participant willingness to change using the Transtheoretical Model of Behavior Change.\nBasic • There is little evidence that the participants understand how their work will be evaluated.\n• Financial Education Instructor monitors understanding through a single method, or without eliciting evidence of understanding from participants.\n• Feedback to participants is vague and not oriented toward future improvement of work.\n• Financial Education Instructor makes onl", "created_at": "2025-10-09"}
{"id": "e1d37497-8d01-4dd5-b38d-9588c985d99d", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 83, "page_end": 83, "section": null, "lang": "en", "text": "od, or without eliciting evidence of understanding from participants.\n• Feedback to participants is vague and not oriented toward future improvement of work.\n• Financial Education Instructor makes only minor attempts to engage participants in self- or peer assessment.\nUnsatisfactory • Financial Education Instructor gives no indication of what high-quality work looks like.\n• Financial Education Instructor makes no effort to determine whether participants understand the lesson.\n• Participants receive no feedback, feedback is global, or feedback is directed to only one participant.\n• Financial Education Instructor does not ask participants to evaluate their own or classmates’ work.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "0eae76be-48d1-4c1d-95f8-3063f6d15594", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 83, "page_end": 85, "section": null, "lang": "en", "text": "s global, or feedback is directed to only one participant.\n• Financial Education Instructor does not ask participants to evaluate their own or classmates’ work.\nFramework for Teaching Personal Finance\n\n3e: Demonstrating flexibility and responsiveness to participants’ learning needs.\nUnsatisfactory Financial Education Instructor adheres rigidly to an instructional plan in spite of evidence of poor participant understanding or participant lack of interest. Financial Education Instructor ignores participant questions; when participants have difficulty learning, Financial Education Instructor blames them or their home environments for their lack of success.\nBasic Financial Education Instructor attempts to adjust the lesson to accommodate and respond to participant questions and interests, with mixed results. Financial Education Instructor accepts responsibility for the success of all participants but has only a limited repertoire of strategies. The Instructor is more focused on the course objective; participants’ interests and questions are regularly dismissed.\nProficient If impromptu measures are needed, Financial Education Instructor smoothly makes adjustments to the lesson. Financial Education Instructor successfully accommodates participant questions while skillfully weaving in the course objectives and satisfying participants’ interests.\nDrawing on a broad repertoire of strategies, Financial Education Instructor persists in seeking approaches for participants who have diffic", "created_at": "2025-10-09"}
{"id": "b8d03699-5fcb-4363-bfaf-be55b9a6e2dc", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 85, "page_end": 85, "section": null, "lang": "en", "text": "he course objectives and satisfying participants’ interests.\nDrawing on a broad repertoire of strategies, Financial Education Instructor persists in seeking approaches for participants who have difficulty learning.\nDistinguished Financial Education Instructor are well-prepared and anticipate participants’ questions. During instruction they seize opportunities to enhance learning, build on a spontaneous event or participant interests, or successfully adjust and differentiate instruction to address individual participant misunderstandings. Using an extensive repertoire of instructional strategies and soliciting additional resources from the school or community, Financial Education Instructor persists in seeking effective approaches for participants who need help. Financial Education Instructor’s adjustments to the lesson, when needed, are designed to assist individual participants.\nFinancial Education Instructor seizes on teachable moments to enhance lessons.\nFinancial Education Instructor conveys to participants that s/he won’t consider a lesson finished until every participant understands and that s/he has a broad range of approaches to use. In reflecting on practice, Financial Education Instructor can cite others in the school and beyond whom s/he has contacted for assistance in reaching some participants’ boredom or lack of understanding.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "c4ce298d-d953-45ae-a0d3-d8e7a0116650", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 85, "page_end": 86, "section": null, "lang": "en", "text": "tion Instructor can cite others in the school and beyond whom s/he has contacted for assistance in reaching some participants’ boredom or lack of understanding.\nFramework for Teaching Personal Finance\n\nDistinguished • Financial Education Instructor’s adjustments to the lesson, when needed, are designed to assist individual participants.\n• Financial Education Instructor seizes on teachable moments to enhance lessons.\n• Financial Education Instructor conveys to participants that s/he won’t consider a lesson finished until every participant understands and that s/he has a broad range of approaches to use.\n• In reflecting on practice, Financial Education Instructor can cite others in the school and beyond whom s/he has contacted for assistance in reaching some participants.\n• Participants feel valued and trust that the Financial Education Instructor will help them understand the lessons.\n• Financial Education Instructor modifies coursework as needed to drive education to higher levels and ensure that all participants are on pace.\n• Financial Education Instructor modifies lesson plans to teach lessons that are timely and with which participants can relate.\nProficient • When improvising becomes necessary, Financial Education Instructor makes adjustments to the lesson.\n• The Financial Education Instructor incorporates participant interests and questions into the heart of the lesson.\n• Financial Education Instructor conveys to participants that s/he has other approaches to try when t", "created_at": "2025-10-09"}
{"id": "424ce243-6b9c-4cc1-9198-c72eb847d74b", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 86, "page_end": 87, "section": null, "lang": "en", "text": "ducation Instructor incorporates participant interests and questions into the heart of the lesson.\n• Financial Education Instructor conveys to participants that s/he has other approaches to try when the participants experience difficulty.\n• In reflecting on practice, Financial Education Instructor cites multiple approaches undertaken to reach participants having difficulty.\n• Financial Education Instructor must align instruction based on the socio-economic backgrounds of the class.\n• Financial Education Instructor adjusts lessons based on participants’ cognitive abilities.\n• Financial Education Instructor is aware of most prevalent psychological, sociological, and economic theories underpinning behavior change models and how those models apply to teaching financial behavior.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "9c78ac60-c150-458c-a4c8-c8d39dda5763", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 87, "page_end": 88, "section": null, "lang": "en", "text": "most prevalent psychological, sociological, and economic theories underpinning behavior change models and how those models apply to teaching financial behavior.\nFramework for Teaching Personal Finance\n\n• Financial Education Instructor adjusts lessons as s/he gains understanding of the participants’ goals, dreams, challenges, and motivators.\n• The Financial Education Instructor adjusts lessons as s/he gains understanding of the participants’ multiple intelligences.\n• Financial Education Instructor adjusts course format and length as s/he receives feedback, monitors participant engagement, measures comprehension, and observes participant behavior.\nBasic • Financial Education Instructor’s efforts to modify the lesson are only partially successful.\n• Financial Education Instructor makes perfunctory attempts to incorporate participant questions and interests into the lesson.\n• The Financial Education Instructor conveys to participants a level of responsibility for their learning but also his or her uncertainty about how to assist them.\n• In reflecting on practice, Financial Education Instructor indicates the desire to reach all participants but does not suggest strategies for doing so.\nUnsatisfactory • The Financial Education Instructor ignores indications of participant boredom or lack of understanding.\n• Financial Education Instructor brushes aside participant questions.\n• Financial Education Instructor conveys to participants that when they have difficulty learning, it is their", "created_at": "2025-10-09"}
{"id": "af41b4bf-0fd3-4aee-aadd-a943ef6c0f22", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 88, "page_end": 88, "section": null, "lang": "en", "text": "ck of understanding.\n• Financial Education Instructor brushes aside participant questions.\n• Financial Education Instructor conveys to participants that when they have difficulty learning, it is their fault.\n• In reflecting on practice, Financial Education Instructor does not indicate that it is important to reach all participants.\n• Despite evident participant confusion, Financial Education Instructor makes no attempt to adjust the lesson.\nFramework for Teaching Personal Finance\n\nDomain 4: Professional Responsibilities Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "c2b925ab-2134-47c9-b9bb-950b1e14539f", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 88, "page_end": 89, "section": null, "lang": "en", "text": "onfusion, Financial Education Instructor makes no attempt to adjust the lesson.\nFramework for Teaching Personal Finance\n\nDomain 4: Professional Responsibilities Framework for Teaching Personal Finance\n\nFramework Overview: Professional Responsibilities 4a: Reflecting on teaching of financial 4d: Participating in professional inquiry capability. focused on financial wellness.\nAccuracy of lesson’s effectiveness Relationships with colleagues Suggestions/strategies for future Participation in professional inquiry improvement Participation in school/organizational projects 4b: Maintaining accurate records of participants’ financial capabilities.\n4e: Growing and developing professionally.\nRecord system for participant progress Enhancement of content knowledge/ System for non-instructional records pedagogical or andragogical skill Receptivity of feedback from colleagues Service to the profession 4c: Communicating with participants’ networks to promote community financial wellness.\n4f: Showing professionalism as a qualified About financial education programming Financial Education Instructor.\nAbout participants’ learning experiences Integrity/ethical conduct Engagement of community through Service to school/organization/ effective marketing and communication community Advocacy for financial education programming Appropriate decision-making issues Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "cb6b3a91-6f70-484a-89e6-b43592e920c0", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 89, "page_end": 90, "section": null, "lang": "en", "text": "Service to school/organization/ effective marketing and communication community Advocacy for financial education programming Appropriate decision-making issues Framework for Teaching Personal Finance\n\n4a: Reflecting on teaching of financial capability.\nUnsatisfactory Financial Education Instructor does not know whether a lesson was effective or achieved its instructional outcomes, or Financial Education Instructor profoundly misjudges the success of a lesson. Financial Education Instructor has no suggestions for how a lesson could be improved.\nBasic Financial Education Instructor has a generally accurate impression of a lesson’s effectiveness and the extent to which instructional outcomes were met. Financial Education Instructor makes general suggestions about how a lesson could be improved.\nProficient Financial Education Instructor makes an accurate assessment of a lesson’s effectiveness and the extent to which it achieved its instructional outcomes and can cite general references to support the judgment. Financial Education Instructor makes a few specific suggestions of what could be tried another time the lesson is taught.\nDistinguished Financial Education Instructor makes a thoughtful and accurate assessment of a lesson’s effectiveness and the extent to which it achieved its instructional outcomes, citing many specific examples from the lesson and weighing the relative strengths of each. Drawing on an extensive repertoire of skills, Financial Education Instructor offers", "created_at": "2025-10-09"}
{"id": "5c334676-d7f5-48b9-b3cd-2cb15bfa535b", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 90, "page_end": 90, "section": null, "lang": "en", "text": "instructional outcomes, citing many specific examples from the lesson and weighing the relative strengths of each. Drawing on an extensive repertoire of skills, Financial Education Instructor offers specific alternative actions, complete with the probable success of different courses of action.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "6436068a-95b1-4dd6-a364-63fdea40292d", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 90, "page_end": 91, "section": null, "lang": "en", "text": "ive repertoire of skills, Financial Education Instructor offers specific alternative actions, complete with the probable success of different courses of action.\nFramework for Teaching Personal Finance\n\nDistinguished • Financial Education Instructor assessment of the lesson is detailed and thorough and includes specific indicators of effectiveness including use of Bloom’s Taxonomy of cognitive skills to evaluate participant comprehension, application of long-term measurement tools to gain empirical data related to behavior change, and utilization of timely feedback to measure participant engagement and comprehension.\n• Financial Education Instructor’s suggestions for improvement are derived from quantifying effectiveness of instruction, marketing outreach and retention, and an understanding of participants’ level of financial knowledge.\n• Instructor evaluates participant challenges, needs, and motivators and assesses participant willingness to change using the Transtheoretical Model of Behavior Change.\n• Financial Education Instructor completes a thorough assessment of a lesson’s effectiveness as well as the impact of the lesson on participant behavior.\n• Financial Education Instructor incorporates lessons learned from participants into lessons for future teaching.\n• Financial Education Instructor modifies lessons to more effectively enhance participant learning.\n• Financial Education Instructor consistently reviews current learning techniques and resources, including web-base", "created_at": "2025-10-09"}
{"id": "480d2005-6a07-4bb4-bd5f-7bdba7429f36", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 91, "page_end": 92, "section": null, "lang": "en", "text": "cation Instructor modifies lessons to more effectively enhance participant learning.\n• Financial Education Instructor consistently reviews current learning techniques and resources, including web-based tools.\nProficient • Financial Education Instructor accurately assesses the effectiveness of instructional activities through implementation of appropriate measurement tools, goal-setting strategies, participant engagement and comprehension, and long-term behavior modification.\n• The Financial Education Instructor identifies specific ways in which a lesson might be improved or further enhanced by comparing various types of pre- and post-test surveys and consultation; and uses appropriate measures to quantify results in terms of both knowledge and application.\n• Financial Education Instructor makes an accurate assessment of a lesson’s effectiveness and the extent to which it influences participant behavior.\n• Financial Education Instructor assesses participants’ level of knowledge and motivation and modifies instruction accordingly.\n• Financial Education Instructor reviews current learning techniques and resources that support financial capability instruction.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "e7fa0cbb-0bbe-4ae0-ade7-53b9dfc45f59", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 92, "page_end": 92, "section": null, "lang": "en", "text": "ifies instruction accordingly.\n• Financial Education Instructor reviews current learning techniques and resources that support financial capability instruction.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor has a generally accurate impression of a lesson’s effectiveness and the extent to which instructional outcomes were met. Financial Education Instructor makes general suggestions about how a lesson could be improved.\n• The Financial Education Instructor has a general sense of whether or not instructional practices were effective in teaching financial principles.\n• Financial Education Instructor offers general modifications for future instruction.\nUnsatisfactory • Financial Education Instructor does not know whether a lesson was effective or achieved its instructional outcomes, or Financial Education Instructor profoundly misjudges the success of a lesson. Financial Education Instructor has no suggestions for how a lesson could be improved.\n• The Financial Education Instructor considers the lesson but draws incorrect conclusions about its effectiveness.\n• Financial Education Instructor makes no suggestions for improvement.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "e5cf186a-574d-4b91-a2f2-9cf678cdcf7c", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 92, "page_end": 93, "section": null, "lang": "en", "text": "Instructor considers the lesson but draws incorrect conclusions about its effectiveness.\n• Financial Education Instructor makes no suggestions for improvement.\nFramework for Teaching Personal Finance\n\n4b: Maintaining accurate records of participants’ financial capabilities.\nUnsatisfactory Financial Education Instructor’s system for maintaining information on participant completion of assignments and learning progress is nonexistent or in disarray.\nFinancial Education Instructor’s records for noninstructional activities are in disarray, the result being errors and confusion.\nBasic Financial Education Instructor’s system for maintaining information on participant completion of assignments and learning progress is rudimentary and only partially effective.\nFinancial Education Instructor’s records for noninstructional activities are adequate but inefficient and, unless given frequent oversight, prone to errors.\nProficient Financial Education Instructor’s system for maintaining information on participant completion of assignments, learning progress, and noninstructional records is fully effective.\nDistinguished Financial Education Instructor’s system for maintaining information on participant completion of assignments, learning progress, and noninstructional records is fully effective. Participants contribute information and contribute to maintaining records as appropriate.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "9c0a2700-6e5c-4c5f-96ea-1123b9025822", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 93, "page_end": 93, "section": null, "lang": "en", "text": "s, learning progress, and noninstructional records is fully effective. Participants contribute information and contribute to maintaining records as appropriate.\nFramework for Teaching Personal Finance\n\nDistinguished • Participants contribute to and maintain records indicating completed and outstanding work assignments.\n• Participants contribute to and maintain data files indicating their own learning progress.\n• Participants recognize and set measurable goals to more effectively accomplish learning and program objectives.\n• Participants apply long-term goal-setting strategies and measurements that further increase opportunity for enhanced cognitive learning and effective behavior change.\nProficient • Financial Education Instructor’s process for recording completion of participant work is efficient and effective; participants have access to information about completed and/or missing assignments.\n• Financial Education Instructor has an efficient and effective process for recording participant attainment of learning goals; participants are able to track their own progress.\n• Financial Education Instructor’s process for recording noninstructional information is both efficient and effective. S/he uses appropriate strategies to assess participant data and learning needs, and to evaluate the impact of financial programs on participant behavior.\nBasic • Financial Education Instructor has a process for recording participant work progress.\nHowever, it may be out-of-date or may not perm", "created_at": "2025-10-09"}
{"id": "012e50dc-2166-4eba-b556-a1907e8064ef", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 93, "page_end": 93, "section": null, "lang": "en", "text": "e the impact of financial programs on participant behavior.\nBasic • Financial Education Instructor has a process for recording participant work progress.\nHowever, it may be out-of-date or may not permit participants to access the information.\n• Financial Education Instructor’s process for tracking participant progress is inefficient or ineffective.\n• Financial Education Instructor has a process for tracking some, but not all, noninstructional information, and it may contain some errors.\nUnsatisfactory • There is no system for either instructional or noninstructional records.\n• Record-keeping systems are in disarray and provide incorrect or confusing information.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "b0b5d892-640b-410b-a8ff-0d942f00d23a", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 93, "page_end": 94, "section": null, "lang": "en", "text": "here is no system for either instructional or noninstructional records.\n• Record-keeping systems are in disarray and provide incorrect or confusing information.\nFramework for Teaching Personal Finance\n\n4c: Communicating with participants’ networks to promote community financial wellness.\nUnsatisfactory Financial Education Instructor provides little information about the instructional program to families; Financial Education Instructor communication about participants’ progress is minimal. Financial Education Instructor does not respond, or responds insensitively, to family concerns.\nBasic Financial Education Instructor makes sporadic attempts at communication with families about the instructional program and about the progress of individual participants but does not attempt to engage families in the instructional program.\nMoreover, the communication that does take place may not be culturally sensitive to the families.\nProficient Financial Education Instructor provides frequent and appropriate information to families about the instructional program and conveys information about individual participant progress in a culturally sensitive manner.\nFinancial Education Instructor makes some attempts to engage families in the instructional program.\nDistinguished Financial Education Instructor communicates frequently with families in a culturally sensitive manner, with participants contributing to the communication. Financial Education Instructor responds to family concerns with profes", "created_at": "2025-10-09"}
{"id": "9173e5a8-49f4-4541-8de4-609ca11e7982", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 94, "page_end": 95, "section": null, "lang": "en", "text": "ctor communicates frequently with families in a culturally sensitive manner, with participants contributing to the communication. Financial Education Instructor responds to family concerns with professional and cultural sensitivity. Financial Education Instructor’s efforts to engage families in the instructional program are frequent and successful.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "5a8049d5-844e-414f-aaeb-ead577f74336", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 95, "page_end": 96, "section": null, "lang": "en", "text": "ith professional and cultural sensitivity. Financial Education Instructor’s efforts to engage families in the instructional program are frequent and successful.\nFramework for Teaching Personal Finance\n\nDistinguished • Participants regularly develop materials to inform their families and/or the support audience about the instructional program and garner feedback on how to further enhance options for more effective delivery and instruction of financial education programming.\n• Participants maintain accurate records about their individual learning progress and frequently share this information with families and/or the community.\n• Participants contribute to regular and ongoing projects designed to engage families and/ or the community in the learning process.\n• Financial Education Instructor engages support audience (families, schools, sponsors, supervisors) in participants’ learning experience.\n• All Financial Education Instructor communications are highly sensitive to families’ and/or the community’s cultural norms.\n• The Financial Education Instructor engages the support audience by employing grassroots community involvement, promotion, and outreach as well as ongoing events/programs to strengthen the financial health of the community.\n• Utilizes feedback from participants and their support groups to plan instructional and outreach activities.\n• Improves financial capabilities of the community and participants’ close networks.\nProficient • Financial Education Instructor regul", "created_at": "2025-10-09"}
{"id": "11153a5e-8ece-4dc4-940f-b64348092ffb", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 96, "page_end": 96, "section": null, "lang": "en", "text": "eir support groups to plan instructional and outreach activities.\n• Improves financial capabilities of the community and participants’ close networks.\nProficient • Financial Education Instructor regularly makes information about the instructional program available.\n• Financial Education Instructor regularly sends home information about participant progress.\n• Financial Education Instructor develops activities designed to engage families and/or the community successfully and appropriately in participants’ learning.\n• Most Financial Education Instructor communications are appropriate to families’ cultural norms.\n• The Financial Education Instructor applies a holistic approach to learning to identify how financial education increases program impact, reach, frequency, and sustainability; elicit individual, family, school, and community involvement; and align instruction with larger community and business goals.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "39de697e-79e8-4892-b553-3bebf5b8803d", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 96, "page_end": 96, "section": null, "lang": "en", "text": "ch, frequency, and sustainability; elicit individual, family, school, and community involvement; and align instruction with larger community and business goals.\nFramework for Teaching Personal Finance\n\n• The Financial Education Instructor works in cooperation with participants and communities to create grassroots community events, design interactive promotions and outreach, promote ongoing sustainable financial education events/programs, and identify methods to effectively implement financial education successfully within the community.\n• Financial Education Instructor gathers feedback from participants and their support groups.\nBasic • Financial Education Instructor sends home infrequent or incomplete information about the instructional program.\n• Financial Education Instructor maintains required information but does little else to inform families about participant progress.\n• Family engagement activities are provided periodically.\n• Some Financial Education Instructor communications are inappropriate to families’ cultural norms.\nUnsatisfactory • Little or no information regarding the instructional program is available to participants’ families or established networks.\n• Participants’ families are unaware of their progress.\n• Family engagement activities are lacking.\n• There is some culturally inappropriate communication.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "1f3955ca-31a7-4ca0-9e77-d2cba051dcbb", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 96, "page_end": 97, "section": null, "lang": "en", "text": "rks.\n• Participants’ families are unaware of their progress.\n• Family engagement activities are lacking.\n• There is some culturally inappropriate communication.\nFramework for Teaching Personal Finance\n\n4d: Participating in professional inquiry focused on financial wellness.\nUnsatisfactory Financial Education Instructor’s relationships with colleagues are negative or selfserving. Financial Education Instructor avoids participation in a professional culture of inquiry, resisting opportunities to become involved. Financial Education Instructor avoids becoming involved in school or organizational events or projects.\nBasic Financial Education Instructor maintains cordial relationships with colleagues to fulfill duties that the school or organization requires. Financial Education Instructor participates in the school’s or organization’s culture of professional inquiry when invited to do so. Financial Education Instructor participates in school or organizational events or projects when specifically asked.\nProficient Financial Education Instructor’s relationships with colleagues are characterized by mutual support and cooperation; Financial Education Instructor actively participates in a culture of professional inquiry. Financial Education Instructor volunteers to participate in school or organizational events or projects, making a substantial contribution.\nDistinguished Financial Education Instructor’s relationships with colleagues are characterized by mutual support and cooperation", "created_at": "2025-10-09"}
{"id": "90a7ab2f-2720-477a-87e6-1bfc3121e1d0", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 97, "page_end": 97, "section": null, "lang": "en", "text": "r organizational events or projects, making a substantial contribution.\nDistinguished Financial Education Instructor’s relationships with colleagues are characterized by mutual support and cooperation, with Financial Education Instructor taking initiative to assume leadership among the school or organizational staff. Financial Education Instructor takes a leadership role in promoting a culture of professional inquiry.\nFinancial Education Instructor consistently volunteers to participate in school or organizational events and projects, making a substantial contribution and assuming a leadership role.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "e2d44984-1b9d-426b-b599-393505d67f7c", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 97, "page_end": 98, "section": null, "lang": "en", "text": "ructor consistently volunteers to participate in school or organizational events and projects, making a substantial contribution and assuming a leadership role.\nFramework for Teaching Personal Finance\n\nDistinguished • Financial Education Instructor takes a leadership role in promoting activities related to professional inquiry.\n• Financial Education Instructor regularly contributes to or leads significant school or community events/projects that positively increase financial capability, and creates memorable kick-off events.\n• Financial Education Instructor incorporates networks of professionals to serve as guest speakers and contribute to the lesson plans.\n• Financial Education Instructor supports a culture of professional inquiry within the community.\n• Financial Education Instructor promotes community and professional resources that are available for other organizations to review to help improve programs.\n• Financial Education Instructor participates in all the organization’s events that can help him/her develop personally and professionally.\n• Develops supportive working relationships with community members to enhance programming and form productive collaborative connections and networks.\nProficient • Financial Education Instructor has supportive and collaborative relationships with colleagues.\n• Financial Education Instructor regularly participates in activities related to professional inquiry.\n• Financial Education Instructor frequently volunteers to participate in scho", "created_at": "2025-10-09"}
{"id": "5b5375e3-47ef-4426-97b3-b868c3769f8c", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "ps with colleagues.\n• Financial Education Instructor regularly participates in activities related to professional inquiry.\n• Financial Education Instructor frequently volunteers to participate in school events and school district and community projects.\n• Financial Education Instructor develops networks of collaborative partners that contribute to the development of participants’ financial capabilities.\n• Financial Education Instructor supports a culture of professional inquiry within their organizations.\n• Financial Education Instructor participates in all the organization’s events that can help him/her develop personally and professionally.\n• Develops supportive working relationships with colleagues to enhance programming and form productive collaborative connections and networks.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "d7c92cf7-b443-4e1e-9900-d50eb5500d43", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "d professionally.\n• Develops supportive working relationships with colleagues to enhance programming and form productive collaborative connections and networks.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor has cordial relationships with colleagues.\n• When invited, Financial Education Instructor participates in activities related to professional inquiry.\n• When asked, Financial Education Instructor participates in school activities, district and community projects.\nUnsatisfactory • Financial Education Instructor’s relationships with colleagues are characterized by negativity or combativeness.\n• Financial Education Instructor purposefully avoids contributing to activities promoting professional inquiry.\n• Financial Education Instructor avoids involvement in school activities and district and community projects.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "5e522c36-b49f-4c43-969c-19a896be52d3", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "ting to activities promoting professional inquiry.\n• Financial Education Instructor avoids involvement in school activities and district and community projects.\nFramework for Teaching Personal Finance\n\n4e: Growing and developing professionally.\nUnsatisfactory Financial Education Instructor engages in no professional development activities to enhance knowledge or skill levels. Financial Education Instructor resists feedback on teaching performance from either supervisors or more experienced colleagues.\nFinancial Education Instructor makes no effort to share knowledge with others or to assume professional responsibilities.\nBasic Financial Education Instructor participates to a limited extent in professional activities when convenient. Financial Education Instructor engages in a limited way with colleagues and supervisors in professional conversation about practice, including some feedback on teaching performance.\nFinancial Education Instructor finds limited ways to assist other Financial Education Instructors and contribute to the profession.\nProficient Financial Education Instructor seeks out opportunities for professional development to enhance content knowledge and pedagogical/andragogical skills.\nFinancial Education Instructor actively engages with colleagues and supervisors in professional conversations about practice, including feedback about practice.\nFinancial Education Instructor participates actively in assisting other educators and looks for ways to contribute to the", "created_at": "2025-10-09"}
{"id": "e81b15b3-2406-431a-91b7-110518465be2", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "professional conversations about practice, including feedback about practice.\nFinancial Education Instructor participates actively in assisting other educators and looks for ways to contribute to the profession.\nDistinguished Financial Education Instructor seeks out opportunities for professional development and makes a systematic effort to conduct action research.\nFinancial Education Instructor solicits feedback on practice from both supervisors and colleagues. Financial Education Instructor initiates important activities to contribute to the profession.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "b0307329-4dd5-4c2a-9e0b-0588a97ad6a9", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "licits feedback on practice from both supervisors and colleagues. Financial Education Instructor initiates important activities to contribute to the profession.\nFramework for Teaching Personal Finance\n\nDistinguished • Financial Education Instructor seeks regular opportunities for continued professional development, including initiating action research and identifying why financial education programs may fail and how to implement corrective methods.\n• Financial Education Instructor actively seeks feedback from supervisors and colleagues, continually researches and identifies effective teaching methods and relevant content, and actively pursues continued learning opportunities (i.e. conferences, seminars).\n• Financial Education Instructor identifies strategies and techniques to ensure that participants have basic financial capability knowledge.\n• Financial Education Instructor pursues continued learning of content and pedagogical skills.\n• Financial Education Instructor continually sets instructional outcomes.\n• Financial Education Instructor consistently keeps him/herself abreast of current learning/ resources and technologies that will more effectively support financial capability instruction.\n• Considers and possibly implements professional feedback when aligned with program objectives.\nProficient • Financial Education Instructor seeks regular opportunities for continued professional development.\n• Financial Education Instructor welcomes colleagues and supervisors into the i", "created_at": "2025-10-09"}
{"id": "661fd4d5-fd43-4358-8875-eb73c7e6597a", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "ectives.\nProficient • Financial Education Instructor seeks regular opportunities for continued professional development.\n• Financial Education Instructor welcomes colleagues and supervisors into the instructional environment for the purposes of gaining insight and feedback.\n• Financial Education Instructor actively participates in organizations that contribute to professional growth opportunities.\n• Pursues continued learning of content and pedagogical skills and modifies instructional outcomes accordingly.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor participates in professional activities when required.\n• Financial Education Instructor reluctantly accepts feedback from supervisors and colleagues.\n• Financial Education Instructor contributes in a limited fashion to professional organizations.\nUnsatisfactory • Financial Education Instructor is not involved in any activity that might enhance financial knowledge or skill.\n• Financial Education Instructor purposely resists discussing performance with supervisors or colleagues.\n• Financial Education Instructor ignores invitations to join professional organizations or attend conferences.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "41f684cc-3af0-4f28-afae-86cb0f2e9993", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "ssing performance with supervisors or colleagues.\n• Financial Education Instructor ignores invitations to join professional organizations or attend conferences.\nFramework for Teaching Personal Finance\n\n4f: Showing professionalism as a qualified Financial Education Instructor.\nUnsatisfactory Financial Education Instructor displays dishonesty in interactions with colleagues, participants, and the public. Financial Education Instructor is not alert to participants’ needs and contributes to learning practices that result in some participants being illserved by the program.\nFinancial Education Instructor makes decisions and recommendations based on selfserving interests.\nFinancial Education Instructor does not comply with school or organizational regulations.\nBasic Financial Education Instructor is honest in interactions with colleagues, participants, and the public. Financial Education Instructor’s attempts to serve participants are inconsistent, and s/he may unknowingly contribute to some participants being ill-served by the school. Financial Education Instructor’s decisions and recommendations are based on limited, though genuinely professional, considerations.\nFinancial Education Instructor must be reminded by supervisors about complying with school or organizational regulations.\nProficient Financial Education Instructor displays high standards of honesty, integrity, and confidentiality in interactions with colleagues, participants, and the public. Financial Education Instruct", "created_at": "2025-10-09"}
{"id": "8d3a2c06-234c-4ba1-ae37-bb593f1ed419", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "Proficient Financial Education Instructor displays high standards of honesty, integrity, and confidentiality in interactions with colleagues, participants, and the public. Financial Education Instructor actively serves participants, working to ensure that all participants receive a fair opportunity to succeed.\nFinancial Education Instructor maintains an open mind in team or departmental decisionmaking. Financial Education Instructor complies fully with school or organizational regulations.\nDistinguished Financial Education Instructor can be counted on to hold the highest standards of honesty, integrity, and confidentiality and takes a leadership role with colleagues.\nFinancial Education Instructor is highly proactive in serving participants, seeking out resources when needed. Financial Education Instructor makes a concerted effort to challenge negative attitudes or practices to ensure that all participants, particularly those traditionally underserved, are honored in the educational environment. Financial Education Instructor takes a leadership role in team or departmental decision-making and helps ensure that such decisions are based on the highest professional standards.\nFinancial Education Instructor complies fully with school or organizational regulations, taking a leadership role with colleagues.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "dad15536-e261-4a6a-bfcb-a9b7a4431589", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "ghest professional standards.\nFinancial Education Instructor complies fully with school or organizational regulations, taking a leadership role with colleagues.\nFramework for Teaching Personal Finance\n\nDistinguished • Financial Education Instructor is considered a leader in terms of honesty, integrity, and confidentiality with participants, colleagues, and the community.\n• Financial Education Instructor is highly proactive in serving participants and/or colleagues.\n• Financial Education Instructor makes a concerted effort to ensure that opportunities are available for all participants to be successful and that support participants’ best interests, even in the face of difficult or conflicting policies.\n• Financial Education Instructor takes a leadership role in team and organizational decisionmaking and organizational guidelines/requirements.\n• Financial Education Instructor makes decisions that serve the school/organizational community (participants, Instructor, supervisors, public).\n• Financial Education Instructor focuses heavily on serving participants and assisting them to make positive changes in their financial behaviors.\n• Financial Education Instructor advocates for implementation of quality financial education programming within schools and the community.\n• Recognized in the community as a benchmark to which other Financial Education Instructors look for best practices.\nProficient • Financial Education Instructor is honest and known for having high standards of integ", "created_at": "2025-10-09"}
{"id": "b898ecb2-4e98-412a-8e52-bbaeb3dd3b1e", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "the community as a benchmark to which other Financial Education Instructors look for best practices.\nProficient • Financial Education Instructor is honest and known for having high standards of integrity.\n• Financial Education Instructor actively addresses participants’ and/or colleagues’ needs.\n• Financial Education Instructor actively works to provide opportunities for participants’ success.\n• Financial Education Instructor willingly participates in team and organizational decisionmaking and complies completely with organizational guidelines/requirements.\n• Financial Education Instructor promotes implementation of quality financial education programming within schools and the community.\n• Demonstrates integrity and professional ethics in interactions with participants, colleagues, and the public.\n• Focuses on serving participants to make positive changes in financial behaviors.\n• Makes decisions that serve the school/organizational community (participants, Instructor, supervisors, public).\n• Contributes meaningful opinions to organizational decision-making issues and advocates for implementation of quality financial education programming.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "7c5c8e36-d9d3-4f53-8bed-254d5c004dea", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "public).\n• Contributes meaningful opinions to organizational decision-making issues and advocates for implementation of quality financial education programming.\nFramework for Teaching Personal Finance\n\nBasic • Financial Education Instructor is honest.\n• Financial Education Instructor notices the needs of participants and/or colleagues but addresses them inconsistently.\n• Financial Education Instructor does not notice that some instructional practices result in poor conditions for participants.\n• Financial Education Instructor makes professional decisions on a limited basis.\n• Financial Education Instructor complies with organizational guidelines/requirements.\nUnsatisfactory • Financial Education Instructor is dishonest.\n• Financial Education Instructor does not notice the needs of participants and/or colleagues.\n• Financial Education Instructor engages in practices that are self-serving.\n• Financial Education Instructor willfully rejects organizational guidelines/requirements.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "11b578a1-b2b9-4b86-8cb3-1ace2d7087eb", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "cial Education Instructor engages in practices that are self-serving.\n• Financial Education Instructor willfully rejects organizational guidelines/requirements.\nFramework for Teaching Personal Finance\n\nAbout the National Financial Educators Council The National Financial Educators Council is dedicated to creating a world where people are informed to make qualified financial decisions that improve their lives, the lives of their loved ones, and the lives of people they reach around the globe. The organization focuses on improving the financial capabilities of individuals while raising awareness for the financial literacy movement.\nThe NFEC is an independent, for-profit financial literacy council with a social enterprise business model. This structure gives us the freedom to deliver an unbiased financial education and assist organizations in need of support. Social responsibility, conscious capitalism, and free enterprise are the fundamental principles underpinning our teachings and overall business model.\nThe NFEC’s commitment to gaining deeper understanding of personal finance topics helps the industry obtain empirical data, illuminates best practices, and shares professional opinions about the subject. Using surveys, research, crowdsourcing, and think tanks, the NFEC has developed the Framework for Teaching Personal Finance.\nCrowdsourcing Model The NFEC operates an active crowdsourcing model to leverage the knowledge possessed by other industry experts. We collaborate with t", "created_at": "2025-10-09"}
{"id": "f1f8187f-254f-430f-9f28-3bf791ad4ff5", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "ed the Framework for Teaching Personal Finance.\nCrowdsourcing Model The NFEC operates an active crowdsourcing model to leverage the knowledge possessed by other industry experts. We collaborate with those individuals who have experience in the education, finance, and personal money management fields to refine, fine-tune, and perfect the Framework.\nThe NFEC prides itself on being in a constant state of beta. Our material is improved and modified as new information becomes available or broader changes take place that warrant reiteration of the material. We value the comments, feedback, and opinions of those who review our publications.\nTo contribute your thoughts, please visit www.FinancialEducatorsCouncil.org/FTPF-contributors Framework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "c9de054d-64c0-4da3-a44d-5078f7ff1f72", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "ents, feedback, and opinions of those who review our publications.\nTo contribute your thoughts, please visit www.FinancialEducatorsCouncil.org/FTPF-contributors Framework for Teaching Personal Finance\n\nDevelopment Team The NFEC team is made up of individuals who are passionate about helping people improve their financial capabilities and promoting the overall financial literacy movement. The Framework for Teaching Personal Finance was developed through think tanks with industry experts and the NFEC’s Curriculum Advisory Board which is made up of a team of educators, personal finance experts, and financial professionals. The individuals instrumental in the development of the Framework for Teaching Personal Finance include:\nDr. Pamela Rosa is an Educational Consultant at the Danielson Group and the Senior Consultant for Effective Professional Practices. Dr. Rosa has supported schools nationally in the design, development, and implementation of Charlotte Danielson’s Framework for Teaching evaluation and professional growth process. As an educational consultant for the past 14 years, Dr Rosa specializes in teacher and principal evaluation and professional growth processes as well as teacher mentoring/coaching.\nDr. Ann Johnson is an independent consultant who works extensively with organizations internationally on implementing curriculum and assessment reform, developing high quality leadership teams, and developing training and implementation plans. Her practical approach to desi", "created_at": "2025-10-09"}
{"id": "38ecdb36-b1d5-4208-9239-0cbf6d59fe70", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "ganizations internationally on implementing curriculum and assessment reform, developing high quality leadership teams, and developing training and implementation plans. Her practical approach to design and alignment is based on 30 years’ experience as a classroom teacher, associate superintendent, building principal, and adjunct professor who has implemented long-term curriculum alignment and mapping initiatives.\nVince Shorb is CEO of the National Financial Educators Council. One of the council’s original founders, Shorb remains involved in educational development and raising awareness for the financial literacy movement. Before joining the NFEC, Shorb talked with more than 20,000 people about their personal financial situations and reviewed the personal financial statements of more than 10,000 clients. He leads the NFEC’s Advisory Board and has been instrumental in developing over 500 hours of financial literacy curriculum.\nDiane Larsen is an award-winning economics teacher and a NFEC Instructor. Diane is a 26year teaching veteran whose awards include being selected Jump$tart Coalition Outstanding Educator for 2008 as well as being the only California teacher chosen by CEE and the U.S.\nState Department to travel to South Africa as part of an international economics teacher exchange program. Her students have won high honors in the California State Stock Market Simulation, placing first in that competition in 2008, 2009, and twice in 2012.\nFramework for Teaching Personal Fin", "created_at": "2025-10-09"}
{"id": "c8b71b0f-ee8e-447e-a86d-c9e59f827415", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "ange program. Her students have won high honors in the California State Stock Market Simulation, placing first in that competition in 2008, 2009, and twice in 2012.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "a73e4738-1427-4136-9952-99dab6653e96", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "program. Her students have won high honors in the California State Stock Market Simulation, placing first in that competition in 2008, 2009, and twice in 2012.\nFramework for Teaching Personal Finance\n\nGary Jaeckel is the author of Teaching Personal Financial Education and a NFEC Instructor.\nHis passion for improving people’s financial capabilities took him from the corporate world to the financial literacy industry. He brings real-world experience to the academic side of the financial literacy field with his background in the financial and securities industries and corporate finance. He is a recognized expert in teaching personal finance and is known as an advocate promoting personal financial education as a stand-alone course in all schools across the country.\nErica Jackson served as Director for the Center for Financial and Consumer Outreach (at Penn State Erie, The Behrend College) and holds a certification as a Certified Financial Education Instructor (CFEI). Jackson has also served as the inaugural Executive Director for Junior Achievement’s Northwest PA Regional Office. Over the years, Erica has partnered with several agencies and organizations to advocate for financial capability including: National Financial Educators Council, Pennsylvania Treasury, Pennsylvania Department of Banking, and Jump$tart Coalition.\nHelen Graves With a diverse background in education, Adlerian psychology, Neuro-Linguistic Programming, and marketing, Helen Graves is fascinated by how people", "created_at": "2025-10-09"}
{"id": "214941a3-6f9e-42cd-ba32-e412875189ce", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "nt of Banking, and Jump$tart Coalition.\nHelen Graves With a diverse background in education, Adlerian psychology, Neuro-Linguistic Programming, and marketing, Helen Graves is fascinated by how people think and learn. She has taught all age levels both in a formal classroom and in workshops, conferences, and online seminars. She has recently moved into the field of content development and instructional design, and enjoys bringing her passion for clear communication and innovative solutions to the learning environment.\nDr. Pamela Enders is a psychologist and peak performance coach. As faculty member at Harvard Medical School, Dr. Enders served as a teacher and supervisor at the Massachusetts General Hospital (MGH) in Boston. With three decades of experience, she works with high-performing professionals to project confidence and poise in high-visibility, high-pressure situations.\nSteve Repak is a Certified Financial Planner™ and author of Dollars & Uncommon Sense: Basic Training for Your Money. Steve is an advocate for financial literacy and a 15-year veteran in the financial services industry. Steve’s expertise as an educator is demonstrated by how well his presentations are received by audiences, and from post-surveys collected which indicate the material’s impact.\nEllen Smith has a Master’s Degree in Early Childhood Special Education and several years of classroom experience. She works with the NFEC in producing and editing smart, easy-to-use educational resources. She is exp", "created_at": "2025-10-09"}
{"id": "9430dccb-a9b7-46e4-a7ff-f0ec88836729", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "a Master’s Degree in Early Childhood Special Education and several years of classroom experience. She works with the NFEC in producing and editing smart, easy-to-use educational resources. She is experienced in implementing and adapting curricula to meet critical needs of the learners.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "330f3e8a-b3a5-4139-9437-e461fb51059c", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "roducing and editing smart, easy-to-use educational resources. She is experienced in implementing and adapting curricula to meet critical needs of the learners.\nFramework for Teaching Personal Finance\n\nTony Steuer CLU, LA, CPFFE is a recognized authority on life, disability and long-term care insurance literacy and a member of the California Department of Insurance Curriculum Board and the National Financial Educators Council Curriculum Advisory Board. Tony’s Questions and Answers on Life Insurance and The Questions and Answers on Life Insurance Workbook were winners of the Excellence in Financial Literacy Education™ Award from the Institute for Financial Literacy® and have been named by Forbes as one of the nine great investment books worth reading.\nStan T. Webb has been a steady beacon in the financial education world. In addition to obtaining his professional securities licenses, Stan is a Certified Fund Specialist and a Certified Senior Advisor. Stan attained these designations in order to better help his clients achieve their financial goals. He leverages his real-world experience to contribute to the NFEC’s Curriculum Advisory Board.\nKristina McCormick has extensive experience in developing curricula and educational programs from inception. Ms. McCormick was instrumental in the NFEC’s project-based learning program for teens and young adults. She was able to apply classroom teaching methodology and curriculum models to promote active student learning through the integra", "created_at": "2025-10-09"}
{"id": "3ffce1e5-3604-4833-8582-ed86d8d35a58", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "the NFEC’s project-based learning program for teens and young adults. She was able to apply classroom teaching methodology and curriculum models to promote active student learning through the integration of technology in order to address the varied learning needs of all students.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "154c3ce2-a02b-45bc-8ab0-8b6e73d54090", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "gy and curriculum models to promote active student learning through the integration of technology in order to address the varied learning needs of all students.\nFramework for Teaching Personal Finance\n\nGlossary Andragogy – The science of understanding (= theory) and supporting (= practice) lifelong and life-wide education of adults. Andragogy consists of teaching strategies focused on adults, and is often interpreted as the process of engaging adult learners in the structure of learning experience.\nBenchmarks – Performance levels that represent best practices and clearly define standards for comparison.\nCertified Financial Education Instructor Benchmarks – Six categories of guidelines developed by the National Financial Educators Council with specific targets for implementing a financial education program. Included in these standards are the content and skills necessary to teach financial capability effectively.\nComponents (Narratives) – Distinct aspects of a Domain as defined by the Framework for Financial Education Instructors.\nCritical Attributes – Characteristics of teaching practice which may not be evident in all situations at all times. Instead, they can be used as the “look for” and “listen for” in teaching practice.\nDomains of Financial Education Instructor’s Practice – Four main areas of effective teaching practice (Planning and Preparation, Environment, Instruction, and Professional Responsibilities).\nElements – Specific aspects of a component narrative as defined", "created_at": "2025-10-09"}
{"id": "7ee51b0d-404c-49b6-9270-0becd8c553e2", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "Four main areas of effective teaching practice (Planning and Preparation, Environment, Instruction, and Professional Responsibilities).\nElements – Specific aspects of a component narrative as defined by the Framework for Financial Education Instructors Frameworkon-a-Page.\nFinancial Capability – Extended thinking regarding personal finance topics which requires connections, extension, and complex reasoning to make financial decisions aligned with one’s personal financial goals. A focus on behavior molding or modification is a core principle of financial capability.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "160db628-a99a-42a9-aa92-ba04be62db35", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "o make financial decisions aligned with one’s personal financial goals. A focus on behavior molding or modification is a core principle of financial capability.\nFramework for Teaching Personal Finance\n\nFinancial Literacy – Possessing the Levels of Performance – The Framework for knowledge and ability to recall information Financial Education Instructor’s rubric has related to personal finance. Possessing four levels of performance: Unsatisfactory – conceptual knowledge about how money represents teaching that is below licensing works. standard of “do no harm” or where the Financial Education Instructor does not Financial Psychology – The behavioral yet have understanding of the concepts characteristics related to personal finance underlying the component; Basic – represents topics. teaching that is sporadic, intermittent, or otherwise not entirely successful but where Financial Content – The material or the Financial Education Instructor has instruction that helps participants improve some understanding of concepts underlying their financial literacy levels and/or financial the component; Proficient – represents capabilities.\nFinancial Education Instructors who have a deep knowledge of content, professional Financial Educator – Anyone who teaches knowledge of participants and curriculum, personal finance, including volunteers, and a broad repertoire of strategies and educators, financial professionals, or any activities to use with participants; and other individual who teach", "created_at": "2025-10-09"}
{"id": "b7398437-e20e-49f0-9277-fb35e6392cd6", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "riculum, personal finance, including volunteers, and a broad repertoire of strategies and educators, financial professionals, or any activities to use with participants; and other individual who teaches personal Distinguished – represents a master finance. No qualifications are needed.\nteaching level where instructors make significant contributions in the classroom to Certified Financial Education Instructor – A encourage participants to take considerable full-time or part-time financial educator responsibility for their own learning, as who has graduated from the NFEC’s Certified well as outside the classroom as leaders Financial Education Instructor course. This among educational peers and the broader professional development course meets the community.\nFramework for Teaching Personal Finance standards and the instructor must meet Narratives – Distinct aspects of a Domain the Proficient level of the Framework for as defined by the Framework for Teaching Teaching Personal Finance standards in Personal Finance.\norder to obtain certification.\nParticipant – A school-age student, adult, or Framework-At-A-Glance – One-page group that participates in or partakes of the document that provides “at a glance – the instruction.\nfour key priority areas of the Framework for Financial Education Instructors,” as well as Pedagogy – The science and art of education.\naligned components and support elements Its aims range from skills acquisition to for each domain.\nfull development of the huma", "created_at": "2025-10-09"}
{"id": "9eb28160-ed04-4682-8ac1-548b9805db50", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "on Instructors,” as well as Pedagogy – The science and art of education.\naligned components and support elements Its aims range from skills acquisition to for each domain.\nfull development of the human being. In correlation with instructive strategies, the Key Performance Indicators – Metrics used to instructor’s own philosophical beliefs of measure progress toward an individual’s or instruction are harbored and governed by organization’s stated objective.\nthe pupil’s background knowledge and experience, situation, and environment, as well as learning goals set by the participant and the financial education instructor.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "e94115f4-bf30-4d26-83bc-25cdca36dd10", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "upil’s background knowledge and experience, situation, and environment, as well as learning goals set by the participant and the financial education instructor.\nFramework for Teaching Personal Finance\n\nReferences [1] Annamaria Lusardi and Olivia S. Mitchell, NBER Working Paper No. 17078 (May 2011), Baby Boomer retirement security: The roles of planning, financial literacy, and housing wealth.\n[2] Bennett et al., BMC Geriatrics, 12:30 (2012), Correlates of health and financial literacy in older adults without dementia.\n[3] Max Nisen, Business Insider (Sep. 16, 2013), Impact of Teachers on Lifetime Earnings.\n[4] Pamela D. Tucker and James H. Stronge, Association for Supervision and Curriculum Development (2005), Linking Teacher Evaluation and Student Learning.\n[5] William J. Webster and Robert L. Mendro, Dallas Public Schools (1997), The Dallas ValueAdded Accountability System Report.\n[6] W. L. Sanders, S. P. Wright and S. P. Horn, Journal of Personnel Evaluation in Education, Vol.\n11 (1997), Teacher and classroom context effects on student achievement: Implications for teacher evaluation.\n[7] R. J. Marzano, D. J. Pickering and J. E. Pollock, Association for Supervision and Curriculum Development, Alexandria, VA (2001), Classroom instruction that works: Research-based strategies for increasing student achievement [8] W. L. Sanders, Financial Literacy and Education Committee (2006), Taking Ownership of the Future.\n[9] Ben Johnson, Principal, blog article (undated), Student Commi", "created_at": "2025-10-09"}
{"id": "dd86ad28-5f3d-4e59-b77a-d6151c1b77e0", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "r increasing student achievement [8] W. L. Sanders, Financial Literacy and Education Committee (2006), Taking Ownership of the Future.\n[9] Ben Johnson, Principal, blog article (undated), Student Commitment Depends on Teacher Commitment.\n[10] Randal C. Archibold, New York Times article (November 18, 1999), Students’ Success Depends on Teachers Most, Poll Says.\n[11] Kenneth Leithwood, Karen Seashore Louis, Stephen Anderson and Kyla Wahlstrom, Wallace Foundation, Review of Research (undated), How leadership influences student learning.\n[12] Corinne Baron-Donovan, Richard L. Wiener, Karen Gross and Susan Block-Lieb, Association for Financial Counseling and Planning Education (2005), Financial Literacy Teacher Training: A Multiple-Measure Evaluation.\n[13] Richard Cordray, Director of the Consumer Financial Protection Bureau, Federal Reserve Bank of Chicago, Visa Inc. Financial Literacy and Education Summit, Chicago, IL (April 17, 2013), from prepared remarks.\n[14] Harrison Jacobs, Business Insider article (October 11, 2013), Here’s How to Raise Teachers’ Salaries without Spending a Dime.\nFramework for Teaching Personal Finance", "created_at": "2025-10-09"}
{"id": "ccb89566-83a2-4209-87c3-948ad0b62c2f", "doc_id": "83bdd194-02e0-4b31-8686-dc17c5bc7033", "title": "Framework for Teaching Personal Finance The Framework for Teaching personal Finance is a researched-based set of components grounded in a constructivist view of learning and teachi", "source_file": ".\\pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "page_start": 1, "page_end": 98, "section": null, "lang": "en", "text": "2013), from prepared remarks.\n[14] Harrison Jacobs, Business Insider article (October 11, 2013), Here’s How to Raise Teachers’ Salaries without Spending a Dime.\nFramework for Teaching Personal Finance\n\nThe National Financial Educators Council is dedicated to creating a world where people are informed to make qualified financial decisions that improve their lives, the lives of their loved ones, and the lives of people they reach around the globe.\nThrough demand- and supply-side surveys, research, and think tanks, the NFEC shares best practices with others in the industry so they can develop or improve their financial education programs.\nWebsite:\nwww.FinancialEducatorsCouncil.org Contact:\ninfo@financialeducatorscouncil.org 415-729-7290", "created_at": "2025-10-09"}
