{"id": "4eefa32a-0fcc-491c-9134-e85cfce3d133", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 3, "section": null, "lang": "en", "text": "Financial Literacy Standards & Framework for Learners NFEC Learner\n\nFramework & Standards for High School, College & Adults\n\nTable of Contents Introduction 4 Standards Objectives: Drive Learners to Higher-order Thinking Skill Sets 5 Financial Literacy Standards Topic Segmentation 6 Financial Psychology 7 › Values & Emotions 8 › External Influencers 9 › Decision-Making Process 10 › Financial Goals 11 › Philanthropy 12 Budgeting 13 › Personal Budget 14 › Savings 15 › Expenses 16 Account Management 17 › Financial Institutions & Professionals 18 › Procedures & Record-keeping 19 Jobs & Careers 20 › Career Choices 21 › Attaining Employment & Advancement 22 › Income & Benefits 23 Credit Profile 24 › Credit Profile & History 25 › Credit Building & Maintaining 26 › Credit Recovery 27 Loans & Debt 28 › Purpose & Planning 29 NFEC Learner Framework & Standards for High School, College & Adults\n\n› Choosing a Loan 30 › Loan Qualification 31 › Loan Management & Repayment 32 Entrepreneurship 33 › Exploring Entrepreneurship 34 › Starting a Business 35 Economic & Government Influences 36 › Taxation 37 › Tax Forms & Filing 38 › Government Policies & Influence 39 › Consumer Protection 40 Risk Management & Insurance 41 › Risk 42 › Contracts 43 › Fraud and Insurance 44 › Insurance 45 Investing 46 › Purpose and Planning 47 › Choosing Investments 48 About the National Financial Educators Council 49 Development Team 50 NFEC Learner Framework & Standards for High School, College & Adults", "created_at": "2025-10-09"}
{"id": "2dce68d5-5dfe-478a-9ad8-2258959d17cf", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 3, "page_end": 4, "section": null, "lang": "en", "text": "esting 46 › Purpose and Planning 47 › Choosing Investments 48 About the National Financial Educators Council 49 Development Team 50 NFEC Learner Framework & Standards for High School, College & Adults\n\nIntroduction The NFEC’s Financial Literacy Standards & Framework for Learners was developed to improve the quality and enhance the impact of instruction in financial literacy. Because each person has his or her own pre-existing financial habits, relationship with money, and current financial situation, teaching personal finance is a unique subject that requires a specialized framework to promote higher levels of learning.\nThe standards were developed to establish key benchmarks that guide more efficient instruction and learning across core personal finance topics. This framework supports a diverse set of stakeholders, including:\n• Educators (anyone delivering financial literacy coursework). These standards set performance goals for students, guidelines for educators, and tools for lesson plan preparation.\n• Learners (anyone learning personal finance topics). The framework provides learning goals that can be used to conduct self-assessment and guidelines for self-directed learning.\n• Organizations (groups involved in financial wellness programming). The standards give public assurance that providers are held to the highest standards of practice and are capable to quantify program performance.\nThese standards define what a person should know about personal finance across 10 core", "created_at": "2025-10-09"}
{"id": "ae530207-1e32-4d0b-a1e5-88164dbd8f5f", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 4, "page_end": 5, "section": null, "lang": "en", "text": "ce that providers are held to the highest standards of practice and are capable to quantify program performance.\nThese standards define what a person should know about personal finance across 10 core areas of relevant subject matter. The framework is designed to drive learners to higherorder thinking skill sets so they can apply what they have learned into real-life situations.\nThe NFEC has invested over a decade building, testing, and refining these standards.\n• Building. We brought together a team of subject matter experts, educators, learners, and individuals leading financial wellness programming to develop the standards.\n• Testing. Educational materials were developed based on these standards. The resources have been deployed directly by the NFEC to over 46,000 organizations and used by over 8,000 organizations.\n• Refining. Feedback was used to refine the standards based on new advancements and input from core stakeholders.\nI would like to personally thank everyone who contributed to the Framework and commend all those who have become involved in the financial education movement. Together we can educate the world’s citizens to make qualified financial decisions that improve their lives, the lives of their loved ones, and the lives of people they reach around the globe.\n- Vince Shorb, CEO National Financial Educators Council NFEC Learner\n\nFramework & Standards for High School, College & Adults", "created_at": "2025-10-09"}
{"id": "f5cbc63a-88ff-4ced-9b2e-3bd2a885fd5f", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 5, "page_end": 6, "section": null, "lang": "en", "text": "of their loved ones, and the lives of people they reach around the globe.\n- Vince Shorb, CEO National Financial Educators Council NFEC Learner\n\nFramework & Standards for High School, College & Adults\n\nStandards Objectives: Drive Learners to Higher-order Thinking Skill Sets DOK Level 4 – Extended Thinking At this level participants are given questions that require complex reasoning and analysis; they possess the ability to connect lessons with other concepts.\nLearners reach this Certification level after receiving higher than 80% on assessments, reports, interviews, and project-based assignments that demonstrate extended thinking.\nDOK Level 2 & 3 – Skill/Concept/ Strategic Thinking Level 2 Activities have participants connect information in the Recall group to be able to solve problems. Lesson plans at this level ask participants to develop relationships between concepts and interpret data. Level 3 Activities require higher cognitive rigor like planning, reasoning, and explaining the process used to derive the answer. Learners reach this Certification level after receiving an 80% or better on multiple choice, essay, and short-answer questions that demonstrate strategic thinking.\nDOK Level 1 – Recall These assessments test student’s ability to recall information like a name, fact, quote, or other basic piece of information.\nAt level 1 they should be capable to perform basic calculations or apply a formula. Learners reach this Certification level after completing multiple choic", "created_at": "2025-10-09"}
{"id": "5f4138d4-9557-468e-8131-e2450b5e71cb", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 6, "page_end": 7, "section": null, "lang": "en", "text": "quote, or other basic piece of information.\nAt level 1 they should be capable to perform basic calculations or apply a formula. Learners reach this Certification level after completing multiple choice testing and receiving a score of 80% or better.\nStandards Objectives: Drive Learners to\n\nHigher-order Thinking Skill Sets\n\nFinancial Literacy Standards Topic Segmentation For youth age 14 and older who have started high school, NFEC Financial Literacy Standards are set across 10 personal finance topic areas. Click on any of the topics on this page to directly navigate to specific topic standards.\nFinancial Psychology Loans & Debt View Standards View Standards Budgeting Entrepreneurship View Standards View Standards Economic & Account Management Government Influences View Standards View Standards Risk Management & Jobs & Careers Insurance View Standards View Standards Investments & Personal Credit Profile Finance Planning View Standards View Standards 6 Financial Literacy Standards Topic Segmentation", "created_at": "2025-10-09"}
{"id": "f24ba479-8464-40b0-aca1-7752a1865f48", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 7, "page_end": 8, "section": null, "lang": "en", "text": "nagement & Jobs & Careers Insurance View Standards View Standards Investments & Personal Credit Profile Finance Planning View Standards View Standards 6 Financial Literacy Standards Topic Segmentation\n\nBBaacckk ttoo SToupbitco Ppaicg Peage Financial Psychology Loans & Debt View Standards View Standards Financial Values & Emotions Psychology Budgeting Entrepreneurship View Standards View Standards View Standards This topic incorporates lessons on behavioral finance, the influence of External Influencers emotions on personal finances, peer influencers, advertising, personal money Economic & habits, financial decision-making processes, View Standards Account Management Government Influences lifestyle choices, and personal financial values.\nDecision-making View Standards View Standards Process & Behavior This section includes View Standards Risk Management & 5 Subtopics Jobs & Careers Insurance Financial Goals View Standards View Standards View Standards Investments & Personal Credit Profile Philanthropy Finance Planning View Standards View Standards View Standards 7 Financial Psychology", "created_at": "2025-10-09"}
{"id": "b820b9bf-dabc-46d6-a25f-b6784ded9640", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 8, "page_end": 9, "section": null, "lang": "en", "text": "nce Financial Goals View Standards View Standards View Standards Investments & Personal Credit Profile Philanthropy Finance Planning View Standards View Standards View Standards 7 Financial Psychology\n\nBack to Subtopic Page Values & Emotions Financial Psychology: Values & Emotions (Beginner) There’s a relationship between your values, emotions, and personal finances.\n• Define your definition of wealth based on your personal values, priorities, and goals.\n• Identify your values in relationship to money and finances.\n• Identify the role of emotions on one’s relationship with and thoughts about money.\nYour financial traits and habits affect your finances.\n• Identify your financial tendencies and habits that affect your financial goals.\n• Illustrate the impact of your financial traits on your financial decisions.\n• Identify the elements of being a good steward of money.\nFinancial Psychology: Values & Emotions (Intermediate) Your values and emotions will influence your financial decisions.\n• Explain the impact of personal values on various financial scenarios.\n• Explain how different emotional states can lead to different actions.\nYour ability to change your behavior has impact on your financial well-being.\n• Construct a plan to modify your personality traits, habits, and behaviors to align with your goals.\n• Summarize the steps you can take to become a good steward of your finances Financial Psychology: Values & Emotions (Advanced) To be fiscally responsible, your finances should", "created_at": "2025-10-09"}
{"id": "a15100eb-2b08-4982-a6ee-42647a51c4ee", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 9, "page_end": 9, "section": null, "lang": "en", "text": "align with your goals.\n• Summarize the steps you can take to become a good steward of your finances Financial Psychology: Values & Emotions (Advanced) To be fiscally responsible, your finances should align with your values and goals.\n• Explain how your financial values and goals may change across your lifetime and the adjustments you will make toward your plan.\n• Create a clear long-term financial plan to ensure its alignment with your values.\n8 Financial Psychology rennigeB", "created_at": "2025-10-09"}
{"id": "19caff11-bd28-4758-a9df-cdc5a022b1e5", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 9, "page_end": 10, "section": null, "lang": "en", "text": "may change across your lifetime and the adjustments you will make toward your plan.\n• Create a clear long-term financial plan to ensure its alignment with your values.\n8 Financial Psychology rennigeB\n\nBack to Subtopic Page External Influencers Financial Psychology: External Influences (Beginner) External factors can influence your financial decisions.\n• Describe the external factors that influence your financial decisions, including advertising, family, culture, and society.\nNot all financial information is accurate or truthful.\n• Explain different ways to distinguish between accurate and inaccurate financial information.\n• Illustrate how inaccurate information is disseminated though various external influencers, including the media, advertisers/marketers, friends, educators, and family members.\nFinancial Psychology: External Influences (Intermediate) There are marketing messages that are influencing your spending.\n• Summarize how various marketing techniques affect decision-making and spending.\n• Compare and contrast advertising messages to understand what they are trying to accomplish.\n• Assess whether financial information is objective, accurate, and current.\n• Identify the techniques and effects of deceptive advertising.\n• Explain how consumer decisions are influenced by advertising, promotions, packaging, and placement.\nFinancial Psychology: External Influences (Advanced) You can assess external information to make informed decisions that align with your goals.\n• Critiq", "created_at": "2025-10-09"}
{"id": "079da759-9665-49b1-b338-d2a63a4e4e31", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 10, "page_end": 11, "section": null, "lang": "en", "text": "ertising, promotions, packaging, and placement.\nFinancial Psychology: External Influences (Advanced) You can assess external information to make informed decisions that align with your goals.\n• Critique your financial plan and identify areas that may have been influenced by others and that do not align with your values.\n9 Financial Psychology rennigeB", "created_at": "2025-10-09"}
{"id": "2820709a-3508-4513-9cb9-5e53625a4538", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 11, "page_end": 12, "section": null, "lang": "en", "text": "decisions that align with your goals.\n• Critique your financial plan and identify areas that may have been influenced by others and that do not align with your values.\n9 Financial Psychology rennigeB\n\nBack to Subtopic Page Decision-Making Process Financial Psychology: Decision-Making Process (Beginner) There are factors that influence your decisions.\n• List ways in which financial decisions are influenced by external factors, including salespeople, marketing, and one’s emotional state.\nFinancial decisions affect your future.\n• Explain how short-term financial decisions affect the future financial decisions you must make.\nFinancial Psychology: Decision-Making Process (Intermediate) There is a process to making good financial decisions.\n• Summarize steps people should consider when making a financial decision including developing alternative solutions, cost/benefit analysis, selecting best solutions, or converting decision into action.\n• Explain the factors to consider when making financial decisions and resources that can help.\nFinancial Psychology: Decision-Making Process (Advanced) You are able to make financial decisions that align with your goals.\n• Analyze multiple sources of financial information available to help you make financial decisions.\n• Create a plan to make purchase decisions that provides adequate time to prepare to fund those acquisitions.\nThere are strategies you can use to adjust your emotional state to make logical financial decisions.\n• Identify strategi", "created_at": "2025-10-09"}
{"id": "72fa8fdb-03da-4cb2-b4a4-c343da71e647", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 12, "page_end": 13, "section": null, "lang": "en", "text": "se decisions that provides adequate time to prepare to fund those acquisitions.\nThere are strategies you can use to adjust your emotional state to make logical financial decisions.\n• Identify strategies you can use to modify your emotional responses to varying financial circumstances.\n• Create a financial planning and decision-making process that reduces the influence of emotions.\n10 Financial Psychology rennigeB", "created_at": "2025-10-09"}
{"id": "66dbbd06-9d8b-4ae3-8ba1-bcb8487cf384", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 13, "page_end": 14, "section": null, "lang": "en", "text": "o modify your emotional responses to varying financial circumstances.\n• Create a financial planning and decision-making process that reduces the influence of emotions.\n10 Financial Psychology rennigeB\n\nBack to Subtopic Page Financial Goals Financial Psychology: Financial Goals (Beginner) Goals affect your finances.\n• List ways in which goals can have positive and negative influence on your finances.\n• List factors that influence your personal financial goals.\n• Identify factors that affect your goals, including peers, culture, location, and past experiences.\n• List the advantages and disadvantages of setting financial goals.\nFinancial Psychology: Financial Goals (Intermediate) There are tools and techniques to help you set and prioritize your financial goals.\n• Summarize different goal-setting techniques and strategies.\n• Identify the steps to prioritize your financial goals.\nFinancial Psychology: Financial Goals (Advanced) There are methods to setting and accomplishing personal financial goals.\n• Apply goal-setting tools and techniques to make decisions about your daily life.\n• Create a realistic financial goal action plan and modify that plan as needed.\n• Create financial goals in consultation with the important people in your life.\n• Identify various factors that can influence your future goals.\n11 Financial Psychology rennigeB", "created_at": "2025-10-09"}
{"id": "67ff4f2d-c1dc-4cf9-8b65-7be69eaf2733", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 14, "page_end": 15, "section": null, "lang": "en", "text": "that plan as needed.\n• Create financial goals in consultation with the important people in your life.\n• Identify various factors that can influence your future goals.\n11 Financial Psychology rennigeB\n\nBack to Subtopic Page Philanthropy Financial Psychology: Philanthropy (Beginner) There are actions you can take to help make this world a better place.\n• Define philanthropy, volunteerism, and charities and their role in society.\n• Describe the difference between nonprofit organizations and social enterprise companies.\n• List ways to give back, including making donations, volunteering, and starting a business.\nFinancial Psychology: Philanthropy (Intermediate) You can give back in ways that that support your values and goals.\n• Compare various ways to give back and relate them to your strengths, passions, goals, and other personal factors.\n• Summarize causes important to you and compare organizations you seek to support to other organizations with similar missions.\nFinancial Psychology: Decision-Making Process (Advanced) Giving back is part of your overall financial plan.\n• Create a philanthropic and social enterprise plan and integrate it with your personal financial goals.\n12 Financial Psychology rennigeB", "created_at": "2025-10-09"}
{"id": "c987c1e7-108b-44c8-8d7b-fbd01c084707", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 15, "page_end": 15, "section": null, "lang": "en", "text": "(Advanced) Giving back is part of your overall financial plan.\n• Create a philanthropic and social enterprise plan and integrate it with your personal financial goals.\n12 Financial Psychology rennigeB\n\nBBaacckk ttoo SToupbitco Ppaicg Peage Budgeting Personal Budget The budgeting section includes lessons View Standards on day-to-day expenses, budgeting for retirement, how to save, tracking and reducing expenses, non-asset purchases, Savings needs versus wants, lifestyle choices that affect one’s budget, and major non-asset expenses (i.e. buying a car, renting a living View Standards space).\nExpenses This section includes 3 Subtopics View Standards 13 Budgeting", "created_at": "2025-10-09"}
{"id": "e4c6f20a-c891-4091-a881-5687959a9eb1", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 15, "page_end": 16, "section": null, "lang": "en", "text": "estyle choices that affect one’s budget, and major non-asset expenses (i.e. buying a car, renting a living View Standards space).\nExpenses This section includes 3 Subtopics View Standards 13 Budgeting\n\nBack to Subtopic Page Personal Budget Budgeting: Personal Budget (Beginner) A budget affects your financial wellness.\n• Define what is meant by the term “budget.” • Explain how having a budget may affect your financial well-being.\n• Explain the purpose and benefits of planning for emergencies and the role of building up an emergency fund.\nThere are specific steps associated with creating a budget.\n• Identify the components of a budget including the roles of income, expense, savings, and future expenses.\n• Explain balance sheet concepts: debit and credit.\n• Identify the steps you would go through to develop a budget.\nBudgeting: Personal Budget (Intermediate) There are tools to assist with budgeting.\n• Locate and describe resources for tracking income/expenses and obtain assistance with the overall budgeting process.\n• Identify a tool you feel might work for you.\nA budget aligned with your financial goals can help you prepare for life events.\n• Predict future expenses or opportunities that should be included in your budget planning process.\n• Explain how to create a budget that aligns with your financial goals.\n• Explain how factors like age, needs, and resources affect one’s budget.\n• Compare how budgets change as you take into account age, needs, and resources.\n• Summarize how", "created_at": "2025-10-09"}
{"id": "a3522f50-0e72-4045-a386-5372c61aabf2", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 16, "page_end": 16, "section": null, "lang": "en", "text": "s with your financial goals.\n• Explain how factors like age, needs, and resources affect one’s budget.\n• Compare how budgets change as you take into account age, needs, and resources.\n• Summarize how different circumstances can affect your personal budget.\nBudgeting: Personal Budget (Advanced) A budget should be modified as your financial goals and situation change.\n• Design a personal budget that will help you reach your long-term and short-term financial goals.\n• Explain how you would revise your budget to accommodate changing circumstances.\n14 Budgeting rennigeB", "created_at": "2025-10-09"}
{"id": "47f569c1-5875-4ddc-b36d-510b8d3f166b", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 16, "page_end": 18, "section": null, "lang": "en", "text": "Design a personal budget that will help you reach your long-term and short-term financial goals.\n• Explain how you would revise your budget to accommodate changing circumstances.\n14 Budgeting rennigeB\n\nBack to Subtopic Page Savings Budgeting: Savings (Beginner) Saving money has impact on your short-term and long-term budgets.\n• Explain the importance of saving money.\n• List different ways a budget can help you save money.\n• Explain the potential impact saving money can have on both a short-term and a long-term budget.\nThere are different strategies and steps involved in starting a savings plan.\n• List the steps involved in starting a savings plan.\n• Explain how you can include savings as a line item in your budget.\n• Explain how each of the following strategies can help you in the process of saving money:\nthe habit of paying yourself first, automatic payroll deductions, and automatic transfers from your checking to your savings account.\nBudgeting: Savings (Intermediate) Saving is a habit that can be developed.\n• Explain and give examples of what is meant by the term “habit.” • Summarize the steps to save money, including budgeting, developing the habit of saving, and automating your savings plan.\n• Relate personal values and goals that motivate you to save.\nThere are ways to increase the amount of money you save.\n• Compare savings vehicles that may help you reduce your tax burden.\n• Analyze and explain how your spending habits affect your ability to save.\n• Analyze your emplo", "created_at": "2025-10-09"}
{"id": "c1c59628-0eea-453a-b1cd-1b3cd781cf66", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 18, "page_end": 18, "section": null, "lang": "en", "text": "ease the amount of money you save.\n• Compare savings vehicles that may help you reduce your tax burden.\n• Analyze and explain how your spending habits affect your ability to save.\n• Analyze your employer’s benefits and estimate the value of participating in any available employer-sponsored savings plans.\nBudgeting: Savings (Advanced) A savings plan should adjust over time to stay in alignment with personal goals.\n• Design and implement a personal savings plan that both funds your current lifestyle needs and contributes toward your retirement future.\n• Explain how various factors will influence your savings needs including inflation, taxes, and lifestyle changes.\n• Analyze and explain how savings is connected to one’s financial needs at retirement.\n15 Budgeting rennigeB", "created_at": "2025-10-09"}
{"id": "d366a96d-ff86-47a8-8f1a-3eec2e437304", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 18, "page_end": 18, "section": null, "lang": "en", "text": "actors will influence your savings needs including inflation, taxes, and lifestyle changes.\n• Analyze and explain how savings is connected to one’s financial needs at retirement.\n15 Budgeting rennigeB\n\nBack to Subtopic Page Expenses Budgeting: Expenses (Beginner) There are different types of expenses that affect one’s short- and long-term finances.\n• Identify the common expenses people face in their everyday lives.\n• Explain the impact of expenses on a personal budget.\nYour purchase and expense decisions have impact on your budget.\n• Identify the impact of various lifestyle choices on spending, including living within your means, above your means, and at your means.\n• Explain the difference between wants and needs.\n• Identify your spending habits and common spending traps you encounter.\nBudgeting: Expenses (Intermediate) There are strategies to decrease and manage your expenses.\n• Explain the relationship between benefits and costs when making various spending decisions.\n• Brainstorm techniques that will help you decrease expenses, including comparison shopping, negotiating, and day-to-day expense management.\n• Identify spending mistakes and explain how to take proper corrective action.\nMajor expenses should be planned for in advance.\n• Estimate the larger expenses you may encounter at different stages in life, including college, automobile purchases, home ownership, marriage, children, and other major life expenses.\nBudgeting: Expenses (Advanced) Expenses can be modified ove", "created_at": "2025-10-09"}
{"id": "aecde25d-1f97-4160-9db5-2bf344c9be0b", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 18, "page_end": 19, "section": null, "lang": "en", "text": "ter at different stages in life, including college, automobile purchases, home ownership, marriage, children, and other major life expenses.\nBudgeting: Expenses (Advanced) Expenses can be modified over time to stay in alignment with your financial goals.\n• Design and implement a personal purchase and expense plan that balances short-term pleasures with long-term financial security.\n• Evaluate the impact of various factors on your expenses including inflation, taxes, and lifestyle changes.\n• Analyze how one’s ability to manage expenses is connected to one’s financial needs at retirement.\n16 Budgeting rennigeB\n\nBBaacckk ttoo SToupbitco Ppaicg Peage Account Financial Institutions Management & Professionals View Standards The lessons in this section cover banking and Procedures account management, record-keeping, debit & Record-keeping versus credit cards, savings and checking, bank account basics, comparing financial institutions, and automating one’s finances. View Standards This section includes 2 Subtopics 17 Account Management", "created_at": "2025-10-09"}
{"id": "f043c657-01df-4364-827a-bbbd59707474", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 19, "page_end": 21, "section": null, "lang": "en", "text": "versus credit cards, savings and checking, bank account basics, comparing financial institutions, and automating one’s finances. View Standards This section includes 2 Subtopics 17 Account Management\n\nBack to Subtopic Page Financial Institutions & Professionals Account Management: Financial Institutions & Professionals (Beginner) There are various financial institutions that offer a variety of products & services.\n• Identify the various types of financial institutions and the services they offer, including banks, credit unions, credit card companies, brokerage firms, investment companies, payday lenders, check cashing businesses, and mortgage firms.\n• Explain the difference between using checks, credit cards, and debit cards to make purchases.\n• Identify basic account management procedures, including account setup, deposits, and withdrawals.\nThere are people and tools that can help you manage your financial accounts.\n• List those financial professionals who could assist you to reach your financial goals. Identify the tools that will help you manage your financial accounts and interpret account data.\n• Identify ways to automate your financial accounts.\nAccount Management: Financial Institutions & Professionals (Intermediate) There are factors you can use to select financial institutions and professionals that are best suited for your needs.\n• Identify the factors to consider when selecting various financial service providers, including banking institutions, financial advisors", "created_at": "2025-10-09"}
{"id": "041ddf33-bfe3-4dc8-9a3e-25c6c9b3d36a", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 21, "page_end": 22, "section": null, "lang": "en", "text": "tutions and professionals that are best suited for your needs.\n• Identify the factors to consider when selecting various financial service providers, including banking institutions, financial advisors, tax professionals, bookkeepers, accountants, brokerage firms, and personal trading accounts.\nYou have rights and responsibilities when working with financial institutions and professionals.\n• Summarize the various rights you have when working with different financial intuitions and professionals.\n• Compare the advice provided by financial professionals with your goals.\n• Explain the different types of protection you have on various financial accounts.\nThere are costs associated with various financial services.\n• Identify and compare the fees associated with various accounts, including overdraft charges, interest, and other fees.\n• Explain the interest and fees associated with various types of financial accounts.\n• Explain how grace periods, interest calculation, and other fees affect various types of accounts.\nAccount Management: Financial Institutions & Professionals (Advanced) Management financial accounts should align with your financial goals.\n• Analyze which types of financial services and account options will enable you to progress toward your stated financial goals.\n• Design a plan to effectively manage and reduce the costs associated with financial accounts.\n• Create a plan to automate key aspects of your finances.\n• Analyze terms and conditions, disclosures, and other", "created_at": "2025-10-09"}
{"id": "dec1daed-ee2d-423b-b067-3716168cde8c", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 22, "page_end": 22, "section": null, "lang": "en", "text": "a plan to effectively manage and reduce the costs associated with financial accounts.\n• Create a plan to automate key aspects of your finances.\n• Analyze terms and conditions, disclosures, and other account options and select the option that best aligns with your needs.\nBuilding a team of financial professionals can assist you in reaching your financial goals.\n• Create criteria to determine whether advice provided by various professionals is accurate, objective, and in your best interests.\n• Analyze the services provided by financial professionals who are best suited to your current and future financial situations.\n• Design a plan to manage a team of financial professionals, mentors, and other advisors.\n18 Account Management rennigeB", "created_at": "2025-10-09"}
{"id": "5feb616a-c42e-413e-98a4-d5ab1b1b69de", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 22, "page_end": 23, "section": null, "lang": "en", "text": "fessionals who are best suited to your current and future financial situations.\n• Design a plan to manage a team of financial professionals, mentors, and other advisors.\n18 Account Management rennigeB\n\nBack to Subtopic Page Procedures & Record-keeping Account Management: Procedures & Record-keeping (Beginner) There are strategies you can use to manage your financial accounts.\n• Explain how to read your personal statements.\n• Explain how disclosures, terms, and conditions affect you.\n• Identify filing and record-keeping systems that will help you manage your financial accounts.\n• Analyze the financial terms and conditions to determine if you have a direct deposit option.\nFinancial records include many different types of personal information.\n• Identify how to keep financial records secure and how long to maintain those records.\n• Identify methods for disposing of outdated financial records.\n• Identify the appropriate steps to take when a credit or debit card is lost or stolen or a financial account is compromised.\nAccount Management: Procedures & Record-keeping (Intermediate) Properly managed accounts can reduce expenses and protect your information.\n• Identify ways to reduce the cost of various accounts.\n• Compare methods to track your accounts from various institutions and determine which method is best for your account(s).\n• Explain ways to ensure that your financial information is secure.\nAccount Management: Procedures & Record-keeping (Advanced) There are ways to manage y", "created_at": "2025-10-09"}
{"id": "d2a53b45-d30a-4016-b98b-c4409836f40c", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 23, "page_end": 25, "section": null, "lang": "en", "text": "mine which method is best for your account(s).\n• Explain ways to ensure that your financial information is secure.\nAccount Management: Procedures & Record-keeping (Advanced) There are ways to manage your accounts that provide you maximum benefits and protection.\n• Explain ways to manage your accounts that maximize benefits and provide you with the utmost protection.\n• Create a personalized system to protect your financial records.\n• Design a plan to automate your savings, payment, and money management systems.\n19 Account Management rennigeB\n\nBBaacckk ttoo SToupbitco Ppaicg Peage Jobs & Careers Career Choices & Opportunities The lessons in this section focus on topics View Standards associated with employment, including job skill preparation, resumes, how to get a job, interviewing, how to get a raise, career Attaining Employment planning, aligning career opportunities with & Advancement financial goals, understanding paystubs, switching jobs, understanding the job market, View Standards and alternative income opportunities.\nIncome & Benefits This section includes 3 Subtopics View Standards 20 Jobs & Careers", "created_at": "2025-10-09"}
{"id": "a902c9b7-8d77-4882-857d-899e53ae9824", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 25, "page_end": 25, "section": null, "lang": "en", "text": "anding paystubs, switching jobs, understanding the job market, View Standards and alternative income opportunities.\nIncome & Benefits This section includes 3 Subtopics View Standards 20 Jobs & Careers\n\nBack to Subtopic Page Career Choices Jobs & Careers: Career Choices (Beginner) Your passions, aptitude and skills affect your employment and earning potential.\n• Describe how your passions, interests, values, and talents can affect your career choices.\n• Identify how you would like to earn income.\n• Do you want something like - Research your interests to determine your potential earning capacity.\n• Describe the relationship between income and lifestyle.\nJobs & Careers: Career Choices (Intermediate) There are employment and income opportunities that align with your strengths, lifestyle goals, and interests.\n• Explain how individual skills and abilities apply to career choices.\n• Compare the benefits between full-time jobs, part-time jobs, careers, entrepreneurial endeavors, and other income opportunities.\n• Predict and explain how career choices, educational choices, skills, and economic conditions affect income.\nJobs & Careers: Career Choices (Advanced) There are strategies you can use to increase your value and make yourself more marketable in the job marketplace.\n• Brainstorm different strategies that will increase your value as an employee.\n• Analyze the job marketplace and develop a plan to acquire the skills and necessary experience to achieve your career goals.\n• Analyze", "created_at": "2025-10-09"}
{"id": "46fabf72-1c02-406f-83b3-c08776a8509f", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 25, "page_end": 25, "section": null, "lang": "en", "text": "ferent strategies that will increase your value as an employee.\n• Analyze the job marketplace and develop a plan to acquire the skills and necessary experience to achieve your career goals.\n• Analyze how economic and social trends can affect one’s career and income potential.\n21 Jobs & Careers rennigeB", "created_at": "2025-10-09"}
{"id": "0ccfd7ed-506c-4975-a516-9e0ac898fc51", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 25, "page_end": 26, "section": null, "lang": "en", "text": "op a plan to acquire the skills and necessary experience to achieve your career goals.\n• Analyze how economic and social trends can affect one’s career and income potential.\n21 Jobs & Careers rennigeB\n\nBack to Subtopic Page Attaining Employment & Advancement Jobs & Careers: Attaining Employment & Advancement (Beginner) TThere are steps you can take to improve employment options.\n• Identify the different steps and protocols for applying for employment.\n• List the skills necessary to enter one’s field of choice.\nJobs & Careers: Attaining Employment & Advancement (Intermediate) There are strategies you can incorporate to increase your earning potential.\n• Connect the relationship between the application process and your interview skills to your job earning potential.\n• Summarize key areas targeted by potential employers and explain how you could address each area in an interview.\n• Distinguish the main components of a resume to effectively showcase your value.\nYour network can increase exposure to potential opportunities.\n• Brainstorm individuals in your network who might have connections and could help you when seeking employment.\n• Explain the benefits of building a professional network and mentors.\n• Summarize how language, fashion, and communication skills can help you network more effectively.\nJobs & Careers: Attaining Employment & Advancement (Advanced) Your value in the global workforce is increased by the skills you possess.\n• Explain how your skills affect your value in", "created_at": "2025-10-09"}
{"id": "252a20f0-d608-48ae-aa77-f8dd7adc8120", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 26, "page_end": 26, "section": null, "lang": "en", "text": "ore effectively.\nJobs & Careers: Attaining Employment & Advancement (Advanced) Your value in the global workforce is increased by the skills you possess.\n• Explain how your skills affect your value in the global workforce.\n• Create a plan to attain employment opportunities, promotions, and raises.\n• Critique the value of your skill set and its impact on your earning potential.\n• Create a plan for acquiring the skills and experience you need to increase your earning potential and achieve your career goals.\n22 Jobs & Careers rennigeB", "created_at": "2025-10-09"}
{"id": "5cb1cabc-6d55-431b-9810-6fa321724c27", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 26, "page_end": 27, "section": null, "lang": "en", "text": "and its impact on your earning potential.\n• Create a plan for acquiring the skills and experience you need to increase your earning potential and achieve your career goals.\n22 Jobs & Careers rennigeB\n\nBack to Subtopic Page Income & Benefits Jobs & Careers: Income & Benefits (Beginner) Employers offer various benefits as part of a salary package.\n• Identify various employee benefits, including income, medical, dental, retirement plan matches, vacation time, and lifestyle benefits.\n• Explain how employee benefits can affect your budget – income and expenses.\nYour income can vary.\n• Identify various ways your income can change, including job loss, promotion, demotion, hour reduction, commissions, and bonuses.\nJobs & Careers: Income & Benefits (Intermediate) Employee benefits can influence your employment choices.\n• Compare employee benefits when evaluating employment options and explain their impact on your personal finances.\n• Evaluate sources of income and alternative resources to accurately compare employment options.\nYour income and benefit needs change over time.\n• Explain factors that cause income and benefits to change over time.\n• Analyze employment options throughout a lifetime and evaluate potential income and benefits as circumstances change.\nJobs & Careers: Income & Benefits (Advanced) Your income influences your overall financial plan.\n• Explain how you can increase your income.\n• Modify your earning plan as your financial goals adjust.\n• Create a plan to reduce th", "created_at": "2025-10-09"}
{"id": "6922fa18-7855-4e16-b0cf-a59f08c7eedd", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 27, "page_end": 28, "section": null, "lang": "en", "text": "efits (Advanced) Your income influences your overall financial plan.\n• Explain how you can increase your income.\n• Modify your earning plan as your financial goals adjust.\n• Create a plan to reduce the risk of relying on a single income source.\n• Develop a plan to change careers while remaining financially sound during the transition.\n23 Jobs & Careers rennigeB\n\nBBaacckk ttoo SToupbitco Ppaicg Peage Credit Profile Credit Profile & History This section focuses on essential elements View Standards related to one’s credit profile. Lessons on building, maintaining, and repairing one’s credit profile, credit history, the importance Credit Building & of good credit, and how credit affects a Maintaining person’s overall financial situation are included. View Standards This section includes Credit Recovery 3 Subtopics View Standards 24 Credit Profile", "created_at": "2025-10-09"}
{"id": "ed2e6890-881a-4b68-b5f1-b08e03de3206", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 28, "page_end": 30, "section": null, "lang": "en", "text": "f good credit, and how credit affects a Maintaining person’s overall financial situation are included. View Standards This section includes Credit Recovery 3 Subtopics View Standards 24 Credit Profile\n\nBack to Subtopic Page Credit Profile & History Credit Profile: Credit Profile & History (Beginner) Your credit history is graded and maintained by credit bureaus.\n• Identify existing credit bureaus, their purpose, and the information they record.\n• Explain the information contained in your credit history and report.\n• Explain the advantages and disadvantages of using credit.\n• Recognize that credit bureaus assign a personal credit score based on your credit history.\n• Identify the elements that go into calculating your credit score.\n• Explain how credit bureaus generate your credit score.\n• Identify how a credit history is established when you apply for and use credit.\nThere are organizations that review your credit report.\n• Identify organizations that have the right to review your credit reporting information.\n• Explain how third parties use and interpret your credit report data.\nCredit Profile: Credit Profile & History (Intermediate) Your credit history affects your personal finances.\n• Summarize how your credit history can affect your finances, including loan terms, employment, and qualifying for loans.\n• Explain why it is important to ensure that your credit report information is accurate.\n• Explain how information is presented on a credit report.\nYou have rights when it c", "created_at": "2025-10-09"}
{"id": "3159f7b0-a0fe-4d43-be3c-e4ded8e96060", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 30, "page_end": 30, "section": null, "lang": "en", "text": "and qualifying for loans.\n• Explain why it is important to ensure that your credit report information is accurate.\n• Explain how information is presented on a credit report.\nYou have rights when it comes to your credit report.\n• Identify the rights consumers have under the Fair Credit Reporting Act, including the right to examine credit reports and dispute information.\n• Explain how you can acquire and dispute information to manage your personal credit profile.\n• Distinguish between agencies that represent consumer rights and identify the types of consumer protection they provide.\n• Compare the consumer protection agencies that can assist you in credit dispute cases.\n• Research information and resources regarding a consumer’s rights in situations of identity theft and understand how to use them.\nCredit Profile: Credit Profile & History (Advanced) There are ways to leverage a positive credit profile to accomplish your financial goals.\n• Create a credit plan that helps you accomplish your financial goals.\n• Apply concepts of building a positive credit rating to your personal financial plan.\n25 Credit Profile rennigeB", "created_at": "2025-10-09"}
{"id": "4132edea-0590-45f2-a9eb-f1b5e616cb4f", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 30, "page_end": 31, "section": null, "lang": "en", "text": "inancial goals.\n• Create a credit plan that helps you accomplish your financial goals.\n• Apply concepts of building a positive credit rating to your personal financial plan.\n25 Credit Profile rennigeB\n\nBack to Subtopic Page Credit Building & Maintaining Credit Profile: Credit Building & Maintaining (Beginner) There are benefits to having positive credit history.\n• Identify the advantages of maintaining a positive credit history.\n• List the length of time positive data is retained by the credit bureaus.\nCredit Profile: Credit Building & Maintaining (Intermediate) There are procedures involved with building and maintaining a good credit history.\n• Summarize factors that affect a positive credit rating, including on-time payments, debt versus available credit, length of open credit, and how often you apply for credit.\n• Cite evidence supporting the importance of regularly reviewing and monitoring one’s credit history.\n• Compare the variety of options available to safeguard your credit profile.\n• Identify the skill sets needed to build and maintain a positive credit report.\nThere are ways to ensure that your credit is protected and information is accurate.\n• Identify different ways you can protect your credit.\n• Construct a plan to protect yourself from identity theft and fraud.\n• Analyze your credit report information and summarize ways to correct information.\nCredit Profile: Credit Building & Maintaining (Advanced) You can leverage your credit profile to accomplish your financi", "created_at": "2025-10-09"}
{"id": "fead813a-084d-4d98-8869-8e1f9848bd14", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 31, "page_end": 31, "section": null, "lang": "en", "text": "alyze your credit report information and summarize ways to correct information.\nCredit Profile: Credit Building & Maintaining (Advanced) You can leverage your credit profile to accomplish your financial goals.\n• Brainstorm different ways you can leverage your credit profile.\n• Create a plan to improve and maintain an excellent credit rating that may include the following steps: review your credit, assess credit report information, dispute errors, manage debt, protect against identity theft, pay bills on time, and/or limit the number of times you apply for credit.\n26 Credit Profile rennigeB", "created_at": "2025-10-09"}
{"id": "3aa11b76-b995-4783-8c20-87b703e6365e", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 31, "page_end": 32, "section": null, "lang": "en", "text": "dit, assess credit report information, dispute errors, manage debt, protect against identity theft, pay bills on time, and/or limit the number of times you apply for credit.\n26 Credit Profile rennigeB\n\nBack to Subtopic Page Credit Recovery Credit Profile: Credit Recovery (Beginner) There are methods to recover from a negative credit history.\n• Identify techniques for rebuilding your credit history and credit rating.\n• List the information needed to start a credit recovery plan, including details regarding collections, debts, and interest rates on debts.\n• Identify the length of time negative data can be retained on your credit report and the response time after you dispute an item.\nCredit Profile: Credit Recovery (Intermediate) There are specific steps to rebuilding one’s credit history.\n• Identify different ways to dispute items on your credit report and rebuild your credit.\n• Modify your budget, payments, and debt to align with your credit recovery goals.\n• Interpret any negative items listed on your credit report.\n• Summarize the different ways to dispute items on your credit report.\nThere are agencies that can assist in rebuilding your credit profile.\n• Identify different agencies that can help you rebuild your credit profile.\n• Compare the available resources that provide financial and credit assistance, including consumer credit counseling services, credit repair companies, debt consolidation firms, and other organizations; recognize the signs of a scam.\nCredit Profile:", "created_at": "2025-10-09"}
{"id": "bc90dbee-bde7-4460-b1a5-c2bc59184b78", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 32, "page_end": 33, "section": null, "lang": "en", "text": "nancial and credit assistance, including consumer credit counseling services, credit repair companies, debt consolidation firms, and other organizations; recognize the signs of a scam.\nCredit Profile: Credit Recovery (Advanced) A credit repair plan adjusts to align with your personal financial plan.\n• Explain ways to modify your credit recovery plan as circumstances change.\n• Analyze various methods to eliminate debt in relation to your credit recovery plan, including bankruptcy, negotiation, loan modification, short sales, foreclosure, and alternative methods to paying debt. Identify which strategy(ies) most closely align with your circumstances.\n• Critique the pros and cons of high-cost alternative financial services.\n• Analyze consumer credit laws and benefits they can provide as you implement your credit recovery plan.\n• Create a financial plan that applies to your family situation and assists your financial recovery.\n27 Credit Profile rennigeB\n\nBBaacckk ttoo SToupbitco Ppaicg Peage Loans & Debt Purpose & Planning The loans and debt section covers the various types of debt, payback options, qualification, View Standards terms, predatory lending, loan types, debt planning, and how taking on debt affects one’s financial situation. Choosing a Loan View Standards This section includes 3 Subtopics Loan Qualification View Standards Loan Management & Repayment View Standards 28 Loans & Debt", "created_at": "2025-10-09"}
{"id": "bf9a2849-897d-46e9-88da-3cebb5a46218", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 33, "page_end": 35, "section": null, "lang": "en", "text": "on debt affects one’s financial situation. Choosing a Loan View Standards This section includes 3 Subtopics Loan Qualification View Standards Loan Management & Repayment View Standards 28 Loans & Debt\n\nBack to Subtopic Page Purpose & Planning Loans & Debt: Purpose & Planning (Beginner) There are different types of loans that give you the ability to borrow money.\n• Define “loan.” • Identify different types of loans available.\nThere are reasons and consequences to taking on debt.\n• Define personal risks and responsibilities related to borrowing money.\n• Recognize the purposes, advantages, and disadvantages of debt.\n• Define leverage and how it is used to control assets.\nLoans & Debt: Purpose & Planning (Intermediate) There are different forms of debt that can offer benefits and/or consequences.\n• Categorize good versus bad debt and summarize the benefits and consequences of each.\nDebt can increase risk and potential reward.\n• Explain how debt can increase risk and reward.\n• Explain how someone may benefit financially from debt and the associated risk.\nLoans & Debt: Purpose & Planning (Advanced) Debt can be a part of your financial plan.\n• Explain the role debt plays in an overall personal financial plan.\n• Design a sample personal financial plan that includes potential debt.\n• Design a plan to get out of debt if an investment takes you off course.\n• Create a plan that leverages debt, yet remains aligned with your risk tolerance.\n29 Loans & Debt rennigeB", "created_at": "2025-10-09"}
{"id": "5b69dd12-b447-40f9-b8da-6bd74aaeb44b", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 35, "page_end": 35, "section": null, "lang": "en", "text": "es potential debt.\n• Design a plan to get out of debt if an investment takes you off course.\n• Create a plan that leverages debt, yet remains aligned with your risk tolerance.\n29 Loans & Debt rennigeB\n\nBack to Subtopic Page Choosing a Loan Loans & Debt: Choosing a Loan (Beginner) There is specialized vocabulary we use for loans and other financial terms.\n• Define loan qualification terminology including collateral, mortgage, risk, interest rate, down payment, and equity.\n• Define the different types of loans: balloon payment, fixed rate, variable rate, secured/ unsecured.\nThere are tools that help us calculate loan payments.\n• Use financial calculators and other tools to calculate loan payments.\nLoans & Debt: Choosing a Loan (Intermediate) Some lenders and financial institutions are involved in deceptive loan practices.\n• Identify different deceptive loan practices.\n• Explain how predatory lending practices can affect your financial history.\nThere are costs involved with getting a loan.\n• Evaluate and compare loan options and costs.\nSummarize the impact of interest, fees, and amortization on loan cost.\n• Evaluate how contracts and disclaimers tell us the terms of the loan.\n• Assess loan contracts and loan disclaimers to determine the terms and cost of a loan.\n• Evaluate and compare loan options and costs.\nSummarize the impact of interest, fees, and amortization on loan cost.\n• Evaluate how contracts and disclaimers tell us the terms of the loan.\n• Assess loan contracts and lo", "created_at": "2025-10-09"}
{"id": "84abcc1c-4331-4b60-b59b-fa2c62b82bf3", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 35, "page_end": 36, "section": null, "lang": "en", "text": "re loan options and costs.\nSummarize the impact of interest, fees, and amortization on loan cost.\n• Evaluate how contracts and disclaimers tell us the terms of the loan.\n• Assess loan contracts and loan disclaimers to determine the terms and cost of a loan.\nLoans & Debt: Choosing a Loan (Advanced) There are ways to evaluate loans and their impact on your personal financial plan.\n• Apply systematic decision-making to evaluate loan options (including no loan) for various products and terms.\n• Create a plan that evaluates the cost of borrowing and your decision to take on debt.\n• Analyze cost of borrowing to make a loan decision aligned with your goals.\n• Analyze the cost of refinancing or modifying loan terms to determine whether each strategy makes financial sense.\n30 Loans & Debt rennigeB", "created_at": "2025-10-09"}
{"id": "d07f36b0-62d7-4f50-b736-b992a7143ac0", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 36, "page_end": 37, "section": null, "lang": "en", "text": "borrowing to make a loan decision aligned with your goals.\n• Analyze the cost of refinancing or modifying loan terms to determine whether each strategy makes financial sense.\n30 Loans & Debt rennigeB\n\nBack to Subtopic Page Loan Qualification Loans & Debt: Loan Qualification (Beginner) Loan qualification guidelines affect the loan terms you receive.\n• Identify how one’s personal financial profile influences loan terms.\n• Identify the factors a lender considers when qualifying a person for a loan.\nThere are consequences to not paying debt.\n• Identify possible consequences for failing to repay a loan.\nLoans & Debt: Loan Qualification (Intermediate) There is a process lenders go through to qualify you for a loan.\n• Summarize how lenders evaluate loan applications and potential borrowers.\n• Explain how lenders evaluate your ability to repay the loan.\n• Calculate a borrower’s ability to afford various loan options.\nThere are things you can do to prepare to qualify for a loan.\n• Identify steps to prepare for loan qualification.\n• Prepare a sample loan application for qualification.\n• Summarize the calculations that help a person determine an appropriate debt load.\n• Use calculations to determine your appropriate debt load.\nBorrowers have rights and responsibilities.\n• Interpret the rights and responsibilities of buyers and sellers under consumer protection laws.\nLoans & Debt: Loan Qualification (Advanced) Loan decisions should align with your personal financial goals.\n• Analyze loa", "created_at": "2025-10-09"}
{"id": "c80ca870-70ae-4cc7-9e51-49957c593202", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 37, "page_end": 37, "section": null, "lang": "en", "text": "hts and responsibilities of buyers and sellers under consumer protection laws.\nLoans & Debt: Loan Qualification (Advanced) Loan decisions should align with your personal financial goals.\n• Analyze loan versus no-loan options and their impact on your financial situation.\n• Create a personal financial profile to help you qualify for the best loan terms.\n31 Loans & Debt rennigeB", "created_at": "2025-10-09"}
{"id": "1677e9ff-cf25-484f-9785-0946bcc085ae", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 37, "page_end": 38, "section": null, "lang": "en", "text": "l goals.\n• Analyze loan versus no-loan options and their impact on your financial situation.\n• Create a personal financial profile to help you qualify for the best loan terms.\n31 Loans & Debt rennigeB\n\nBack to Subtopic Page Loan Management & Repayment Loans & Debt: Loan Management & Repayment (Beginner) There are methods to monitor and help you evaluate your debt load.\n• Identify tools to monitor and evaluate debt.\n• Identify the warning signs and consequences of excessive debt.\n• Identify your current debt and responsibilities.\n• Identify loan terms needed to evaluate various loan options.\n• Identify payment due dates, late fees, prepayment penalties, interest rate changes, interest rate change triggers, and other details associated with various loan options.\nThere are solutions to deal with excess debt.\n• Identify options available to assist with excessive debt loads: creditor negotiation, bankruptcy, short sales, foreclosures, credit counseling, etc.\n• Explain the risks, legal consequences, and personal impact of various debt elimination or reduction options, including wage garnishment, credit impact, and repossession of assets.\nLoans & Debt: Loan Management & Repayment (Intermediate) There are various loan repayment methods available.\n• Construct a loan repayment plan for various loan types and goals.\n• Compare various debt payment and nonpayment methods in terms of your financial goals.\nThere are debt management strategies.\n• Compare debt management strategies, ways to r", "created_at": "2025-10-09"}
{"id": "b5e41d75-783b-428c-ad8e-da084b66f661", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 38, "page_end": 39, "section": null, "lang": "en", "text": "ious loan types and goals.\n• Compare various debt payment and nonpayment methods in terms of your financial goals.\nThere are debt management strategies.\n• Compare debt management strategies, ways to reduce risk, and ways to avoid financial problems associated with debt.\n• Explain eliminating debt through nonpayment and the possible effects on your personal financial profile.\nThere are organizations and professionals that can help you manage debt.\n• Identify various services that can help you deal with excessive debt issues, including credit counselors, lawyers, and financial professionals.\nLoans & Debt: Loan Management & Repayment (Advanced) There are ways to manage debt that align with your personal financial goals.\n• Explain ways to leverage debt that will benefit your financial goals.\n• Create a personal financial plan that leverages debt options.\n• Design and apply a systematic debt reduction plan that aligns with your personal financial goals.\n• Design a debt management plan to improve your personal financial profile.\n• Review loan repayment policies and identify repayment options and their impact on your overall financial profile.\nThere are debt exit methods that help you reduce the risk of borrowing.\n• Create an exit plan to mitigate the risks of a loan.\n• Create a debt management and payment plan.\n32 Loans & Debt rennigeB", "created_at": "2025-10-09"}
{"id": "079881ce-72f6-43c6-ab07-3953637f0fce", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 39, "page_end": 39, "section": null, "lang": "en", "text": "le.\nThere are debt exit methods that help you reduce the risk of borrowing.\n• Create an exit plan to mitigate the risks of a loan.\n• Create a debt management and payment plan.\n32 Loans & Debt rennigeB\n\nBBaacckk ttoo SToupbitco Ppaicg Peage Entrepreneurship Exploring Entrepreneurship The entrepreneurship sections covers the View Standards skills needed to become an entrepreneur, planning, whether starting a business is right for you, aligning entrepreneurial objectives Starting a Business with financial goals, business planning, evaluating opportunities, and managing the risk of a business venture. View Standards This section includes 2 Subtopics 33 Entrepreneurship", "created_at": "2025-10-09"}
{"id": "99ab6067-5cb8-4f5e-8ad4-13953f50b5f5", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 39, "page_end": 40, "section": null, "lang": "en", "text": "Starting a Business with financial goals, business planning, evaluating opportunities, and managing the risk of a business venture. View Standards This section includes 2 Subtopics 33 Entrepreneurship\n\nBack to Subtopic Page Exploring Entrepreneurship Entrepreneurship: Exploring Entrepreneurship (Beginner) There are benefits and drawbacks to being an entrepreneur.\n• Define entrepreneurship and social entrepreneurship.\n• List the potential rewards and risks of starting a business.\n• List the various roles an entrepreneur may play in the development and lifecycles of a business.\nEntrepreneurship: Exploring Entrepreneurship (Intermediate) There are factors to consider before starting a business.\n• Compare the characteristics of a successful entrepreneur with the traits of successful employees.\n• Match the mindset, skills, knowledge, education, economic conditions, and experiences related to business success.\n• Explain the relationship between continued skill development and future opportunities.\nEntrepreneurship: Exploring Entrepreneurship (Advanced) Your decision to start a business should be aligned with your financial goals.\n• Analyze how starting a business fits your lifestyle and financial goals.\n• Create a plan to start or not to start a business, based on your financial objectives.\n• Design a plan to have multiple streams of income.\n34 Entrepreneurship rennigeB", "created_at": "2025-10-09"}
{"id": "d214fecc-86a4-4c48-95ba-60398bd8d586", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 40, "page_end": 42, "section": null, "lang": "en", "text": "lifestyle and financial goals.\n• Create a plan to start or not to start a business, based on your financial objectives.\n• Design a plan to have multiple streams of income.\n34 Entrepreneurship rennigeB\n\nBack to Subtopic Page Starting a Business Entrepreneurship: Starting a Business (Beginner) A business plan can guide your entrepreneurial endeavors.\n• Explain the purpose of business plan.\n• Identify and list the main components of a business plan.\n• Explain the importance of defining and setting business goals and objectives.\nEntrepreneurship: Starting a Business (Intermediate) There are resources to help you create a business plan to start or expand your business.\n• Organize the various components of business plans including startup costs, business concept, executive summary, risk analyses, market analyses, sales strategies, marketing strategies, product details, and pricing.\n• Identify items you need to consider when estimating the cost of funding a business.\n• Explain how a business plan changes over the lifecycle of a business.\nThere are ways to assess a business’s feasibility and risk.\n• Explain low-cost and low-risk ways to start a business.\n• Summarize how you can develop the skills, knowledge, and experience needed to determine potential business viability, reward, and risk.\n• Compare risk and reward potential and use the comparison to decide whether starting a business is feasible.\n• Identify different ways to obtain capital for starting a business.\nEntrepreneurship:", "created_at": "2025-10-09"}
{"id": "c3dd1d67-cf3a-47f6-9ffa-1a24cb92c31d", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 42, "page_end": 43, "section": null, "lang": "en", "text": "k.\n• Compare risk and reward potential and use the comparison to decide whether starting a business is feasible.\n• Identify different ways to obtain capital for starting a business.\nEntrepreneurship: Starting a Business (Advanced) You can build a business that is in alignment with your interests and financial goals.\n• Design a contingency plan to minimize risk associated with your business.\n• Analyze case studies of businesses similar to your entrepreneurial vision and incorporate their successful features into your own business plan.\n• Explain relationships between future opportunities and various factors upon which you may capitalize, including skill development, governmental influences, networking, education, economic conditions, credibility, positioning, and business relations.\n• Create an action plan to work toward feasible business opportunities that meet your risk management objectives and align with your financial goals.\n• Critique opportunities and align your business prospects with your passions, strengths, and values.\n35 Entrepreneurship rennigeB", "created_at": "2025-10-09"}
{"id": "d2c9a8e7-1dbc-4861-a94a-869cc56c2a40", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 43, "page_end": 44, "section": null, "lang": "en", "text": "your risk management objectives and align with your financial goals.\n• Critique opportunities and align your business prospects with your passions, strengths, and values.\n35 Entrepreneurship rennigeB\n\nBBaacckk ttoo SToupbitco Ppaicg Peage Economic & Taxation Government Influences View Standards Tax Forms & Filing The lessons in this section focus on how the broader economy and government influence one’s personal finances. The coursework View Standards covers taxes, policy changes, government organizations, inflation, monetary policy, Government Policies consumer protection laws, how taxes & Influence are used, tax penalties, locating a tax professional, government organizations that influence people’s personal finances, View Standards consumer protection laws, impact of taxes on income, impact of taxes on investments, a general understanding of inflation, and Consumer Protection how government policies can affect one’s personal finances.\nView Standards This section includes 4 Subtopics 36 Economic & Government Influences", "created_at": "2025-10-09"}
{"id": "68833998-3c3a-4c5e-91dc-d2cd07384bde", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 44, "page_end": 45, "section": null, "lang": "en", "text": "ral understanding of inflation, and Consumer Protection how government policies can affect one’s personal finances.\nView Standards This section includes 4 Subtopics 36 Economic & Government Influences\n\nBack to Subtopic Page Taxation Economic & Government Influences: Taxation (Beginner) The government taxes you.\n• Identify how various taxes are collected including local, state, and federal taxes.\n• Explain the relationship between taxes and income.\n• Explain and give examples of what is meant by the term “tax.” • Describe how tax monies are spent.\n• Summarize a brief history of the federal income tax.\n• Identify the various forms of taxation.\nEconomic & Government Influences: Taxation (Intermediate) Taxes affect your personal finances and there are consequences for tax errors.\n• Explain how taxes affect your disposable income and the difference between net and gross income.\n• Identify and compare the amount you are likely to pay during different stages of your financial life.\n• Explain your liability for not paying taxes or for making an error on your tax return.\nTax rates vary based on your financial situation.\n• Review the tax rates on different sources of income and on different types of products and services purchased.\n• Explain why various forms of income are taxed differently.\n• Summarize how changing tax codes affect your income and potential tax refund.\nEconomic & Government Influences: Taxation (Advanced) You can minimize tax consequences to increase your wealth.\n• Ex", "created_at": "2025-10-09"}
{"id": "e98a8e8d-bde9-4d7e-bfc2-3ca808d7a72e", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 45, "page_end": 45, "section": null, "lang": "en", "text": "y.\n• Summarize how changing tax codes affect your income and potential tax refund.\nEconomic & Government Influences: Taxation (Advanced) You can minimize tax consequences to increase your wealth.\n• Explain personal financial planning strategies to reduce tax liabilities.\n• Create an estate plan to reduce tax liabilities to you and your heirs.\n• Analyze various investments and investment vehicles that offer tax benefits.\n• Develop a comprehensive tax and personal financial plan.\n37 Economic & Government Influences rennigeB", "created_at": "2025-10-09"}
{"id": "5db91c3a-bc6b-4e67-9862-1522e2083fb2", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 45, "page_end": 46, "section": null, "lang": "en", "text": "u and your heirs.\n• Analyze various investments and investment vehicles that offer tax benefits.\n• Develop a comprehensive tax and personal financial plan.\n37 Economic & Government Influences rennigeB\n\nBack to Subtopic Page Tax Forms & Filing Economic & Government Influences: Tax Forms & Filing (Beginner) There are different tax forms for different situations.\n• Distinguish between the different types of tax forms.\n• Identify where to locate tax forms for various situations.\nThere are resources to help you file taxes.\n• Identify different tax services and professionals who can help you file your taxes.\n• Identify resources that will help you understand the filing process for various taxes.\n• Identify the steps involved in choosing a professional tax advisor.\nEconomic & Government Influences: Tax Forms & Filing (Intermediate) There is information you should keep to complete your taxes.\n• Identify the different types of information needed to complete your taxes.\n• Construct a plan to maintain accurate records needed for your taxes.\nTax professionals offer different services and benefits.\n• Compare services of different tax advisors/tax filing services and identify the one you feel provides the most comprehensive service.\nEconomic & Government Influences: Tax Forms & Filing (Advanced) Accurate financial records are critical to your overall financial plan.\n• Evaluate which tax forms best align with your situation and provide you the maximum benefits.\n• Analyze your responsibility", "created_at": "2025-10-09"}
{"id": "375e093e-8157-42aa-b2b5-c2d071acbbd2", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 46, "page_end": 47, "section": null, "lang": "en", "text": "d) Accurate financial records are critical to your overall financial plan.\n• Evaluate which tax forms best align with your situation and provide you the maximum benefits.\n• Analyze your responsibility for filing taxes correctly and on time.\n• Explain how keeping accurate records will reduce your risk of tax problems.\nThere is a strategy for selecting an appropriate tax advisor.\n• Analyze the criteria to use when selecting a tax advisor.\n• Evaluate and choose a tax advisor/filing service that meets your budget and lifestyle needs.\n38 Economic & Government Influences rennigeB", "created_at": "2025-10-09"}
{"id": "d4968829-eade-47a1-82f5-4110a23c0831", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 47, "page_end": 47, "section": null, "lang": "en", "text": "• Analyze the criteria to use when selecting a tax advisor.\n• Evaluate and choose a tax advisor/filing service that meets your budget and lifestyle needs.\n38 Economic & Government Influences rennigeB\n\nBack to Subtopic Page Government Policies & Influence Economic & Government Influences: Government Policies & Influence (Beginner) There is a broader economic system that influences your financial goals.\n• Explain the impact of the economic system on one’s personal financial goals.\n• Describe how your decisions affect society and contribute to the overall economy.\n• Identify the interdependent roles of government, businesses, and global citizens and how that interdependence affects your finances.\nEconomic & Government Influences: Government Policies & Influence (Intermediate) There are government agencies that affect the financial industry and the broader economy.\n• Identify government agencies that may affect your personal financial situation.\n• Identify government policy’s role in financial cycles and crises.\n• Explain how government agencies regulate financial markets.\n• Explain how monetary policies affect the economy.\n• Summarize different goal-setting techniques and strategies.\n• Identify the steps to prioritize your financial goals.\nEconomic & Government Influences: Government Policies & Influence (Advanced) There are different ways you can influence government policy to improve your financial situation.\n• Explain how individuals and businesses influence government polic", "created_at": "2025-10-09"}
{"id": "fea628ba-eff2-4972-a464-a9d6e71bc19a", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 47, "page_end": 48, "section": null, "lang": "en", "text": "nt Policies & Influence (Advanced) There are different ways you can influence government policy to improve your financial situation.\n• Explain how individuals and businesses influence government policies.\n• Explain the relationship between your personal financial situation and broader economic and governmental policies.\n• Critique the government’s role in historical financial crises and suggest possible changes to improve the situation.\n• Explain the conflicts of interest that arise when financial companies are involved in government.\nThe government’s policies can be leveraged to improve your finances.\n• Design a personal financial plan that leverages various government policies and opportunities.\n• Identify various factors that can influence your future goals.\n39 Economic & Government Influences rennigeB", "created_at": "2025-10-09"}
{"id": "980adbcd-b5b7-46da-a50e-8df7d36490ac", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 48, "page_end": 48, "section": null, "lang": "en", "text": "gn a personal financial plan that leverages various government policies and opportunities.\n• Identify various factors that can influence your future goals.\n39 Economic & Government Influences rennigeB\n\nBack to Subtopic Page Consumer Protection Economic & Government Influences: Consumer Protection (Beginner) There are agencies, laws, and resources to protect you as a consumer.\n• Identify sources of consumer protection and assistance.\n• List consumer protection laws and the safeguards they provide.\n• List the government agencies that offer assistance.\n• Explain the services various government agencies provide to various individuals and businesses.\nEconomic & Government Influences: Consumer Protection (Intermediate) There are procedures required to take advantage of consumer protection laws and assistance programs.\n• Distinguish between the various government organizations that provide consumer protection and identify the protocol for working with these agencies.\nEconomic & Government Influences: Consumer Protection (Advanced) You can leverage government programs and/or policies to improve your financial situation.\n• Create a plan that takes advantage of government opportunities and policies to improve your financial situation.\n40 Economic & Government Influences rennigeB", "created_at": "2025-10-09"}
{"id": "98784091-b2e7-4c52-8731-8b808a571f9a", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 48, "page_end": 48, "section": null, "lang": "en", "text": "ies to improve your financial situation.\n• Create a plan that takes advantage of government opportunities and policies to improve your financial situation.\n40 Economic & Government Influences rennigeB\n\nBBaacckk ttoo SToupbitco Ppaicg Peage Risk Risk Management & Insurance View Standards Contracts This section covers how to identify and manage potential risk, investment risk, understanding contracts, types of fraud, View Standards fraud protection, and other topics related to personal risk management that can affect one’s finances. The insurance portion Fraud covers all aspects of choosing an insurance provider, understanding various insurance options, and choosing the right policies to View Standards protect one’s self.\nInsurance This section includes 4 Subtopics View Standards 41 Risk Management & Insurance", "created_at": "2025-10-09"}
{"id": "f22d8b30-9d1e-496d-87e1-78bcddb2df91", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 48, "page_end": 49, "section": null, "lang": "en", "text": "understanding various insurance options, and choosing the right policies to View Standards protect one’s self.\nInsurance This section includes 4 Subtopics View Standards 41 Risk Management & Insurance\n\nBack to Subtopic Page Risk Risk Management & Insurance: Risk (Beginner) Life involves financial risks and each person has a different risk tolerance.\n• Identify financial risk factors that affect you now, and others that may affect you in the future.\n• Identify your personal risk tolerance related to financial matters.\nRisk Management & Insurance: Risk (Intermediate) Financial risks can be managed through financial planning.\n• Compare risk management options, including risk avoidance, risk reduction, risk sharing, and risk retention; choose personal risk management options that align with your goals.\n• Hypothesize preventive measures to reduce your risk.\n• Compare risk management tools that can protect you in various situations.\nRisk Management & Insurance: Risk (Advanced) Financial decisions align with your financial plan and risk tolerance.\n• Design a risk management strategy that aligns with your risk tolerance levels.\n• Analyze various types of risk management to create a cost-effective risk management plan.\n42 Risk Management & Insurance rennigeB", "created_at": "2025-10-09"}
{"id": "c9453a6e-991e-42aa-8f8e-ce1de2cf6b7a", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 49, "page_end": 50, "section": null, "lang": "en", "text": "isk management strategy that aligns with your risk tolerance levels.\n• Analyze various types of risk management to create a cost-effective risk management plan.\n42 Risk Management & Insurance rennigeB\n\nBack to Subtopic Page Contracts Risk Management & Insurance: Contracts (Beginner) Contracts affect your financial decisions.\n• List the contracts in which you are likely to be involved during your lifetime, including car purchases, rental agreements, cell phone agreements, online purchase terms, and website terms and conditions.\n• Define when and why contracts are used.\n• Identify the components of contracts and their common terms and conditions.\nRisk Management & Insurance: Contracts (Intermediate) Your ability to understand contracts will have an impact on your financial decisions.\n• Interpret the responsibilities and rights provided by common agreements, terms and conditions, including credit card terms, lease agreements, automobile purchase agreements, loan agreements, phone agreements, and other common contracts.\n• Investigate professionals who can help you review agreements.\n• Explain the relationship between your ability to understand contracts and your personal finances.\nRisk Management & Insurance: Contracts (Advanced) Contractual agreements should be in alignment with your financial goals.\n• Analyze your current contracts to ensure that you agree with all the terms.\n• Create a plan to negotiate contract terms for various types of financial opportunities.\n• Identify pr", "created_at": "2025-10-09"}
{"id": "db6e9243-1b29-4b13-8fc9-cd8a55094a2a", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 50, "page_end": 50, "section": null, "lang": "en", "text": "r financial goals.\n• Analyze your current contracts to ensure that you agree with all the terms.\n• Create a plan to negotiate contract terms for various types of financial opportunities.\n• Identify professionals who can help you sign only those agreements that align with your overall financial plan.\n43 Risk Management & Insurance rennigeB", "created_at": "2025-10-09"}
{"id": "1d299230-c546-4766-825f-8ab036cfbb79", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 50, "page_end": 51, "section": null, "lang": "en", "text": "for various types of financial opportunities.\n• Identify professionals who can help you sign only those agreements that align with your overall financial plan.\n43 Risk Management & Insurance rennigeB\n\nBack to Subtopic Page Fraud and Insurance Risk Management & Insurance: Fraud (Beginner) There are different types of fraud and fraudulent behaviors.\n• List the common types of scams and fraud.\n• List common identity theft methods, including phishing, dumpster diving, theft, hard drive recovery, hacking, pharming, mail theft, and false scanners.\nRisk Management & Insurance: Fraud (Intermediate) Fraud can damage your personal finances.\n• Summarize the direct impact of various types of fraud, scams, and identity theft on your personal finances, including your credit profile, net worth, etc.\nRisk Management & Insurance: Fraud (Advanced) There are different ways in which individuals can protect themselves from fraud.\n• Explain ways to protect oneself from various types of fraud, scams, and identity theft.\n• Analyze the laws associated with identity theft, scams, and fraud and explain how they protect you.\nThere are different actions you can take to recover from fraud.\n• Identify different actions to recover from fraud.\n• Explain the actions one should take to restore one’s personal finances and security after experiencing various types of fraud, scams, and identity theft.\n• Design a plan to identify and connect with organizations and professionals that can provide fraud, scam, and i", "created_at": "2025-10-09"}
{"id": "461e33c5-efd0-4379-8045-d62a324dc6b8", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 51, "page_end": 51, "section": null, "lang": "en", "text": "nces and security after experiencing various types of fraud, scams, and identity theft.\n• Design a plan to identify and connect with organizations and professionals that can provide fraud, scam, and identity theft assistance.\n44 Risk Management & Insurance rennigeB", "created_at": "2025-10-09"}
{"id": "b23de256-8476-4ac0-bdf0-9f30e2c685fa", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 51, "page_end": 51, "section": null, "lang": "en", "text": "s, and identity theft.\n• Design a plan to identify and connect with organizations and professionals that can provide fraud, scam, and identity theft assistance.\n44 Risk Management & Insurance rennigeB\n\nBack to Subtopic Page Insurance Risk Management & Insurance: Insurance (Beginner) Insurance can protect your personal finances.\n• Identify the terminology associated with insurance.\n• List the different types of insurance and the protection they provide including health, life, automobile, long-term care, disability, homeowners, and renters insurance.\n• Identify the risks associated with not having various forms of insurance.\n• Illustrate the concept of insurance and explain the correlation between insurance and risk.\nRisk Management & Insurance: Insurance (Intermediate) Different types of insurance have different costs and protections.\n• Summarize key features of various types of insurance.\n• Identify factors that can increase or reduce insurance costs.\n• Categorize the types and amounts of insurance mandated by various government regulations.\n• Summarize the different sources of insurance including insurance options provided by yourself, your employer, and the government.\nThere are organizations and professionals that can assist you with your insurance needs.\n• Assess an insurance company and insurance professionals to determine whether they meet your different insurance needs.\n• Review insurance policies, rates, premiums, and deductibles to minimize costs in selected situatio", "created_at": "2025-10-09"}
{"id": "73995063-ff8b-4c04-b8a4-80e50bcbb371", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 51, "page_end": 52, "section": null, "lang": "en", "text": "company and insurance professionals to determine whether they meet your different insurance needs.\n• Review insurance policies, rates, premiums, and deductibles to minimize costs in selected situations.\n• Compare the insurance application and claims processes to guide your choice of an insurance company.\n• Explain the net benefits you receive on a claim.\nRisk Management & Insurance: Insurance (Advanced) Insurance coverage should be modified as your needs change.\n• Analyze insurance coverage needs based on various factors including age, personal risk tolerance, occupation, lifestyle, and financial profile to determine the best policy for you.\n• Connect your risk levels to your insurance costs (i.e., risk-based pricing).\n• Create a plan to have optimal amounts of insurance for current and future life stages.\n• Analyze different types of insurance coverage for selected situations and various personal life stages.\n• Create an individual or family insurance plan that aligns with your short- and long-term financial goals.\n45 Risk Management & Insurance rennigeB", "created_at": "2025-10-09"}
{"id": "4bfe07b3-b2f2-4bfb-a507-cf45cf72c9ba", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 52, "page_end": 52, "section": null, "lang": "en", "text": "elected situations and various personal life stages.\n• Create an individual or family insurance plan that aligns with your short- and long-term financial goals.\n45 Risk Management & Insurance rennigeB\n\nBBaacckk ttoo SToupbitco Ppaicg Peage Investing Purpose and Planning The investing section covers how to use View Standards savings, investment philosophies, major asset purchases, net worth, types of investments options, interest rates, ROI, Choosing Investments diversification, investing skill development, long-term planning, choosing investment advisors, and understanding the impact of View Standards inflation on one’s personal finances.\nThis section includes 2 Subtopics 46 Investing", "created_at": "2025-10-09"}
{"id": "576a1a9d-777e-418a-b7a4-f0b95c301d73", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 52, "page_end": 53, "section": null, "lang": "en", "text": "skill development, long-term planning, choosing investment advisors, and understanding the impact of View Standards inflation on one’s personal finances.\nThis section includes 2 Subtopics 46 Investing\n\nBack to Subtopic Page Purpose and Planning Investing: Purpose & Planning (Beginner) There are benefits and risks to investing.\n• Explain the benefits and risks involved with investing.\n• Summarize the benefits of creating a consistent investment plan.\nThere are different types of investments.\n• Recognize common available investment options including real estate, stocks, and commodities.\n• Identify the costs, fees, and/or commissions associated with various investments.\nThere is a specialized vocabulary associated with investing.\n• List where you can locate a glossary of investment terms.\n• Recall terms associated with investing including asset allocation, diversification, opportunity cost, dollar cost averaging, and compound interest.\nInvesting: Purpose & Planning (Intermediate) There are different investment principles and strategies.\n• Summarize basic investment principles and strategies including diversification, opportunity cost, dollar cost averaging, and compound interest.\n• Compare the differences between retirement, non-retirement, qualified, and non-qualified investments.\nThe economy and financial markets affect your investments.\n• Summarize how inflation may affect financial returns and one’s personal financial situation.\n• Assess the impact various global and economi", "created_at": "2025-10-09"}
{"id": "c127293d-d9c1-4047-9c18-48c3b6a49663", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "The economy and financial markets affect your investments.\n• Summarize how inflation may affect financial returns and one’s personal financial situation.\n• Assess the impact various global and economic market events may have on your investments.\nThere are tools and formulas to calculate the costs and return on an investment.\n• Demonstrate the ability to calculate compounding interest, return on investment, and time value of money.\n• Demonstrate how to calculate the rate of return necessary to reach one’s investment goal.\n• Calculate the average cost per share of investments using dollar cost averaging.\n• Calculate investment growth given different amounts, times, rates of return, and frequency of compounding.\n• Summarize the connection between compounding interest and time.\nInvesting: Purpose & Planning (Advanced) There are ways to align your investments with your personal financial goals.\n• Create an investment plan that considers various life factors including age, income, liabilities, assets, goals, family size, risk tolerance, and net worth.\n• Design a personal financial plan that compares various investment options.\n• Analyze the impact of inflation on your investment portfolio.\n• Compare the tax consequences of different investment options and distinguish tax-exempt, taxdeferred, and taxable investment options.\n• Compare the historical rates of returns from various markets.\nThe risk and reward of different investment options varies.\n• Analyze how your portfolio will cha", "created_at": "2025-10-09"}
{"id": "1daefd34-4d70-4a11-8f5f-927a62fb91c7", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "erred, and taxable investment options.\n• Compare the historical rates of returns from various markets.\nThe risk and reward of different investment options varies.\n• Analyze how your portfolio will change over the years to align with your risk and return goals.\n• Summarize the maximum amount of loss from various investment options.\n• Assess the return on investment potential of different investment opportunities.\n47 Investing rennigeB", "created_at": "2025-10-09"}
{"id": "12f9bcdd-3fca-4ee5-ada0-7353194e2281", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "risk and return goals.\n• Summarize the maximum amount of loss from various investment options.\n• Assess the return on investment potential of different investment opportunities.\n47 Investing rennigeB\n\nBack to Subtopic Page Choosing Investments Investing: Choosing Investments (Beginner) There are many considerations when evaluating investment options.\n• Differentiate among the types of investment vehicles.\n• Identify the types of financial institutions at which investment products can be purchased.\n• Describe the basic factors that affect the price of stocks, real estate, and other investment options.\n• Identify factors that influence investment planning (age, income, liabilities, assets, goals, family size, risk tolerance).\nInvesting: Choosing Investments (Intermediate) There are strategies for making good investment choices.\n• Explain the steps necessary to make informed investment decisions.\n• Describe the role risk tolerance plays in choosing investment vehicles.\n• Explain how risk tolerance may change with one’s situation.\n• Explain how diversification by investing in different types of financial assets can lower investment risk.\nThere are resources and individuals available to help with investment decisions.\n• Compile a list of resources to gain knowledge about investment vehicles and options.\n• Explain the factors to consider when selecting financial professionals.\n• Select appropriate financial services and products based on an evaluation of service and product inform", "created_at": "2025-10-09"}
{"id": "2df1573b-071f-4a0c-af33-7f8d9829aa04", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "ehicles and options.\n• Explain the factors to consider when selecting financial professionals.\n• Select appropriate financial services and products based on an evaluation of service and product information.\nEffective investing requires good decision-making skills.\n• Use systematic decision-making to select financial services or investments.\n• Explain why investors may sell stocks that have gained in value, but hold ones that have lost value. Explain why this may not make sense.\nInvesting: Choosing Investments (Advanced) There are ways to create an investment plan to increase your financial wellbeing.\n• Create a plan to build the financial foundation you need before investing.\n• Develop a sample diversified investment portfolio that aligns with your financial goals.\n• Evaluate the consequences of various financial decisions related to investing and the process for responsible financial planning.\n• Create a personal financial plan in which investment opportunities align with your lifestyle and long-term financial goals.\n48 Investing rennigeB", "created_at": "2025-10-09"}
{"id": "94c6d9b6-a351-400e-9b9a-14a6b1c02ae0", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "and the process for responsible financial planning.\n• Create a personal financial plan in which investment opportunities align with your lifestyle and long-term financial goals.\n48 Investing rennigeB\n\nAbout the National Financial Educators Council The National Financial Educators Council is dedicated to creating a world where people are informed to make qualified financial decisions that improve their lives, the lives of their loved ones, and the lives of people they impact around the globe.\nThe organization focuses on improving the financial capabilities of individuals while raising awareness for the financial literacy movement.\nThe NFEC is an independent, for-profit financial literacy council with a social enterprise business model. This structure gives us the freedom to deliver an unbiased financial education and assist organizations in need of support. Social responsibility, conscious capitalism, and free enterprise are the fundamental principles underpinning our teachings and overall business model.\nThe NFEC’s commitment to gaining deeper understanding of personal finance topics helps the industry obtain empirical data, illuminates best practices, and shares professional opinions about the subject. Using surveys, research, crowdsourcing, and think tanks the NFEC has developed the Framework for Teaching Personal Finance.\nCrowdsourcing Model The NFEC operates an active crowdsourcing model to leverage the knowledge possessed by others industry experts. We collaborate with", "created_at": "2025-10-09"}
{"id": "12ae0346-4d4f-4f02-a3ab-0ecddf307332", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "ed the Framework for Teaching Personal Finance.\nCrowdsourcing Model The NFEC operates an active crowdsourcing model to leverage the knowledge possessed by others industry experts. We collaborate with those individuals that have an experience in the education, finance and personal money management field to refine, fine-tune and perfect the Framework.\nThe NFEC prides itself on being in a constant state of beta. Our material is improved and modified as new information becomes available or broader changes have taken place that warrants reiteration of the material. We value the comments, feedback and opinions of those that review our publications.\nTo contribute your thoughts please visit www.FinancialEducatorsCouncil.org/FTPF-contributors", "created_at": "2025-10-09"}
{"id": "bcc52122-8d1e-4804-8dd6-729cdb269dc3", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "ration of the material. We value the comments, feedback and opinions of those that review our publications.\nTo contribute your thoughts please visit www.FinancialEducatorsCouncil.org/FTPF-contributors\n\nDevelopment Team The NFEC team is made up of individuals who are passionate about helping people improve their financial capabilities and promoting the overall financial literacy movement. The Framework for Teaching Personal Finance was developed through think-tanks with industry experts and the NFEC’s Curriculum Advisory Board which is made up of a team of educators, personal finance experts, and financial professionals. Those instrumental in the development of the Framework for Teaching Personal Finance include:\nDr. Pamela Rosa is an Educational alignment and mapping initiatives.\nConsultant at the Danielson Group and the Vince Shorb is CEO of the National Senior Consultant for Effective Professional Financial Educators’ Council. One of the Practices. Dr. Rosa has supported schools council’s original founders, Shorb remains nationally in the design, development, and involved in educational development and implementation of Charlotte Danielsons’ raising awareness for the financial literacy Framework for Teaching evaluation movement. Before joining the NFEC, Shorb and professional growth process. As an talked with more than 20,000 people educational consultant for the past 14 years, about their personal financial situation and Dr Rosa specializes in teacher and principal reviewe", "created_at": "2025-10-09"}
{"id": "49a260c7-eeec-4894-b07e-22decb0158aa", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "rowth process. As an talked with more than 20,000 people educational consultant for the past 14 years, about their personal financial situation and Dr Rosa specializes in teacher and principal reviewed the personal financial statements evaluation and professional growth of more than 10,000 clients. He leads processes as well as teacher mentoring/ the NFEC’s Advisory Board and has been coaching.\ninstrumental in developing over 500 hours of financial literacy curriculum.\nDr. Ann Johnson is an independent consultant who works extensively with organizations Diane Larsen is an award winning economics internationally on implementing curriculum teacher and a NFEC Instructor. Diane is and assessment reform, developing high a 26 year teaching veteran who’s awards quality leadership teams, and developing include being selected Jum$tart Coalition training and implementation plans. Her Outstanding Educator for 2008 as well as practical approach to design and alignment being the only California teacher chosen by is based on her thirty years experiences as a CEE and the U.S. State Department to travel classroom teacher, associate superintendent, to South Africa as part of an international building principal and adjunct professor economics teachers in an exchange program.\nhaving implemented long-term curriculum Her students have won high honors in the", "created_at": "2025-10-09"}
{"id": "baf9c804-71ff-4c8b-8407-b8302931e505", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "Africa as part of an international building principal and adjunct professor economics teachers in an exchange program.\nhaving implemented long-term curriculum Her students have won high honors in the\n\nDevelopment Team continued California State Stock Market Simulation expert in teaching personal finance and is placing 1st in 2008, 2009, and twice in known as an advocate promoting personal 2012. financial education as a stand-alone course in all schools across the country.\nSteven Alexander is the National Development Director for the NFEC. Erica Jackson served as Director for the Steven has more than 27 years of financial Center for Financial and Consumer Outreach experience working in different capacities (at Penn State Erie, The Behrend College) with major financial institutions, and holds a certification as a Certified including Bank of America Private Wealth Financial Education Instructor (CFEI). I Management, Wachovia Trust Nonprofit Jackson has also served as the inaugural and Philanthropic Services, Bank of New Executive Director for Junior Achievement’s York/Mellon, and TIAA/CREF Wealth Northwest PA Regional Office. Over the years, Management. He embraced the importance Erica has partnered with several agencies of financial literacy education early in his and organizations to advocate for financial career by obtaining his Certified Financial capability including: National Financial Planner (CFP) designation in 1990. Educators Council, Pennsylvania Treasury, Pennsylvan", "created_at": "2025-10-09"}
{"id": "bac5dba8-ae3d-4386-a754-a4d348c3c2a1", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "s to advocate for financial career by obtaining his Certified Financial capability including: National Financial Planner (CFP) designation in 1990. Educators Council, Pennsylvania Treasury, Pennsylvania Department of Banking and Jump$tart Coalition.\nGary Jaeckel is the author of Teaching Personal Financial Education and a NFEC Instructor, has passion for improving Helen Graves With a diverse background people’s financial capabilities took him in education, Adlerian psychology, Neurofrom the corporate world to the financial Linguistic Programming and marketing, literacy industry. He brings real world Helen Graves is fascinated by how people experience to the academic side of the think and learn. She has taught all age levels financial literacy field with his background both in a formal classroom as well as in in the financial and securities industries workshops, conferences and online seminars.\nand corporate finance. He is a recognized She has recently moved into the field of content development and instructional", "created_at": "2025-10-09"}
{"id": "d04aa454-b5ca-4c26-982b-cc4134fcd345", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "financial and securities industries workshops, conferences and online seminars.\nand corporate finance. He is a recognized She has recently moved into the field of content development and instructional\n\nDevelopment Team continued design, and enjoys bringing her passion Stan T. Webb has been a steady beacon in for clear communication and innovative the financial education world. In addition solutions to the learning environment. to obtaining his professional securities licenses, Stan is a Certified Fund Specialist and a Certified Senior Advisor, Stan attained Dr. Pamela Enders is a psychologist and these designations in order to better help peak performance coach. As faculty member his clients achieve their financial goals at Harvard Medical School where Dr. Enders and leverages his real world experience to serve as a teacher and supervisor at the contribute to the NFEC’s Curriculum Advisory Massachusetts General Hospital (MGH) in Board.\nBoston. With 3 decades of experience, she works with high-performing professionals to project confidence and poise in high Kristina McCormick has extensive experience visibility, high pressure situations. in developing curricula and educational programs from inception. Ms. McCormick was instrumental in the NFEC’s project-based Steve Repak is a Certified Financial Planner™ learning program for teens and young adults.\nand author of Dollars & Uncommon Sense: She was able to apply classroom teaching Basic Training for Your Money. Steve is an method", "created_at": "2025-10-09"}
{"id": "2c9c2012-a30c-499c-8430-8fcd655e74d1", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "ified Financial Planner™ learning program for teens and young adults.\nand author of Dollars & Uncommon Sense: She was able to apply classroom teaching Basic Training for Your Money. Steve is an methodology and curriculum models to advocate for financial literacy and a 15 year promote active student learning through the veteran in the financial services industry. integration of technology in order to address Steve has demonstrated expertise as an the varied learning needs of all students.\neducator from how his presentations are well received by the audience, and from the post-surveys collected which demonstrated the material made an impact.\nEllen Smith has a Master’s Degree in Early Childhood Special Education and several years of classroom experience. She works with the NFEC in producing and editing smart, easy-to-use educational resources.\nShe is experienced in implementing and adapting curricula to meet critical needs of the learners.", "created_at": "2025-10-09"}
{"id": "c374206b-2a67-487e-9ff4-d5ac5724174f", "doc_id": "196a0fb6-5dd1-402b-952f-a448d9e49228", "title": "Financial Literacy Standards & Framework for Learners NFEC Learner", "source_file": ".\\pdfs\\Learner-Framework-Standards-for-High-School-College-Adults-.pdf", "page_start": 1, "page_end": 53, "section": null, "lang": "en", "text": "experience. She works with the NFEC in producing and editing smart, easy-to-use educational resources.\nShe is experienced in implementing and adapting curricula to meet critical needs of the learners.\n\nThe National Financial Educators Council is dedicated to creating a world where people are informed to make qualified financial decisions that improve their lives, the lives of their loved ones, and the lives of people they impact around the globe.\nThrough demand- and supply-side surveys, research and think tanks the NFEC shares best practices with others in the industry so they can develop or improve their financial education program.\nwww.FinancialEducatorsCouncil.org info@FinancialEducatorsCouncil.org 702.620.3059", "created_at": "2025-10-09"}
