{"id": "fecbad84-921f-4a17-a530-7d73f60fc47a", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 1, "page_end": 2, "section": null, "lang": "en", "text": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the effectiveness of financial education initiatives while adhering to the same rigorous educational standards demanded by other foundational disciplines.\nElevate Financial Education Mandates to Meet Standards of Other Core Subjects Setting financial education standards on an equivalent basis with other subject areas could make a powerful difference in learning outcomes that would have a major impact on all Americans’ lives.\nFinancial education should be held to (at least) the same standards as other subjects in the typical school curriculum.\nThe basic premise of these standards is that financial literacy be treated the same as any other topic taught in schools – that is, the topic of financial literacy should be held at least to the same standards of rigor, pedagogy, and measurement as any other subject matter.\nOther subjects taught require specific educator qualifications, measured outcomes, quality of curriculum materials and educational methods, scaffolding, parental involvement, and ongoing education options. Financial literacy deserves the same treatment.", "created_at": "2025-10-09"}
{"id": "9849a5bf-d25e-4d45-bdde-0c9a7d53c494", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 2, "page_end": 4, "section": null, "lang": "en", "text": "fications, measured outcomes, quality of curriculum materials and educational methods, scaffolding, parental involvement, and ongoing education options. Financial literacy deserves the same treatment.\nPersonal Finance Delivers Relevant Skill Sets that Benefits 100% of Students The consequences of financial illiteracy across the nation are grim: oppressive debt, lack of savings, increasing numbers of bankruptcies, little or no retirement funds. And these negative consequences spill over into people’s relationships, work and personal lives, and physical and mental health.\nSimple early mistakes like paying a bill late, getting into excessive student debt, lacking employment skills, and deficient account management abilities can lead to long-term and potentially devastating consequences.\nUnlike other core subjects, financial literacy benefits 100% of students and teaches practical information graduates can implement in their daily lives. Other subjects require students to learn information most will never use for employment or in their daily lives.\n% of Subject Requirements Graduates that Benefit Financial Literacy 0 – 1 semester (1) 100% Math 3 – 4 years (2,3) <25% (4) Science 2 – 4 years (5) 5% (6) American Literature 1 year (7) <2% (7,8) Foreign Language 1 – 2 years (3) 15% (9) Social Studies 3 – 4 years (5) 16% (10)", "created_at": "2025-10-09"}
{"id": "b1734f97-86c9-4b58-8211-742b439abea0", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 4, "page_end": 4, "section": null, "lang": "en", "text": "mester (1) 100% Math 3 – 4 years (2,3) <25% (4) Science 2 – 4 years (5) 5% (6) American Literature 1 year (7) <2% (7,8) Foreign Language 1 – 2 years (3) 15% (9) Social Studies 3 – 4 years (5) 16% (10)\nProblem with Current Financial Literacy Mandates & Rating Systems Current financial literacy mandates fall short. Every US state fails to mandate financial literacy programs that meet basic requirements of all other core topics taught in high school. A review of recent literature on financial literacy mandates for high school indicates that all state mandates currently in place lack key elements required for other courses.(1,11–13) Current policy leaves setting educational standards up to each individual state. Although no standards are mandated at the federal level, the US Department of Education has developed some guidelines that are available for states to adopt voluntarily.\nSeveral organizations grade US states according to their financial education standards.(1,11,12) However, those state ratings are based primarily on the amount of instruction time and whether or not requirements or testing are in place. To date no one evaluates financial education in terms of program quality and rigor, teacher qualifications, or testing characteristics. Thus a state’s school system could have subpar programming, taught by severely underqualified teachers, with inadequate testing – and those factors would not be considered in the ratings.\nFinancial Literacy Programming Objectives The prim", "created_at": "2025-10-09"}
{"id": "12c42ade-fd12-411a-94ff-61292fab8ee5", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 4, "page_end": 5, "section": null, "lang": "en", "text": "e subpar programming, taught by severely underqualified teachers, with inadequate testing – and those factors would not be considered in the ratings.\nFinancial Literacy Programming Objectives The primary outcome goal of any financial education program is a measurable impact on students’ nearand long-term financial health. With high school-level coursework, there is added urgency – this phase represents the last proactive opportunity to help students prevent near-term financial problems and put graduates on course toward greater financial wellness.\nIf the objective is for students to learn how to earn income and manage their money – which is essential to preparing them for adult life – they require rigorous instruction that engages higher-level thinking skills and ensures longterm retention. Teachers of the subject should be well-qualified, competent, and skilled at engaging and motivating students. Testing should evaluate not only students’ knowledge and understanding of the content, but also their capability to analyze and apply the knowledge in real-world decision-making.", "created_at": "2025-10-09"}
{"id": "befe910a-d3fd-4980-b875-97120be5f9b3", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 5, "page_end": 7, "section": null, "lang": "en", "text": "motivating students. Testing should evaluate not only students’ knowledge and understanding of the content, but also their capability to analyze and apply the knowledge in real-world decision-making.\nPolicy and Standards Framework for High School Financial Literacy Education • Delivered in standalone Program classes and integrated into Structure other subjects.\n- Assign adequate time and level of rigor to subject matter.\n- Conduct ongoing education to support long- • Relevant content that Lesson term outcomes. prepares students for Plans financial life events.\n- Adopt proven curriculum that encourages higher-order thinking and application.\n- Customize lesson plans • Courses led by highly- based on socio-economic qualified personal status.\nEducators finance educators.\n& Leadership • Program development and deployment managed by experienced leaders.\n- Fund financial literacy • Learner outcomes programs.\nfocused on long-term Program financial wellness and • Encourage parental Support early indicators. involvement and provide parents with access to resources.\n- Start financial education courses in elementary school.\nProgram Structure Delivered in Assign adequate Conduct ongoing standalone classes time and level of education to and integrated into rigor to subject support long-term other subjects. matter. outcomes.", "created_at": "2025-10-09"}
{"id": "f22b6db0-d42f-4ef9-b0d2-2a7a6c944715", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 7, "page_end": 7, "section": null, "lang": "en", "text": "rogram Structure Delivered in Assign adequate Conduct ongoing standalone classes time and level of education to and integrated into rigor to subject support long-term other subjects. matter. outcomes.\nDelivered in Standalone Classes and Integrated Into Other Subjects.\nPersonal finance should be taught as a standalone class and given the same consideration as other core subjects schools teach. To maximize impact, financial education topics should also be integrated into other subjects to promote interdisciplinary learning and connections between different areas of knowledge.\nTeaching personal finance as a standalone course is important because it enables a focus on hands-on, practical, and “experiential” learning, which has been identified as a key characteristic of effective financial education programs.(14) That is, lessons in a standalone class can incorporate real-world experiences related to money and take into account students’ perceptions of future goals and upcoming life decisions.\nFor students, taking a standalone personal finance course provides an opportunity to handle real-world decisions in a safe environment.(15) High school students can practice the financial decision-making they will need to undertake post-graduation, such as paying for college, smart budgeting, and beginning to invest for retirement.\nIn addition, integration into other course subjects is helpful to increase students’ repeated exposure to lessons and deepen learning. According to a report by t", "created_at": "2025-10-09"}
{"id": "771d52cd-30f0-483a-ae59-fa795e627125", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 7, "page_end": 8, "section": null, "lang": "en", "text": "nd beginning to invest for retirement.\nIn addition, integration into other course subjects is helpful to increase students’ repeated exposure to lessons and deepen learning. According to a report by the National Association of Secondary School Principals, effective school subjects are those that are designed to be integrated with other subjects and to promote the development of higher-order thinking skills.(16) Moreover, interdisciplinary learning can help promote a deeper understanding of complex issues and prepare students for the challenges of the 21st century.\nScenarios Fallbrook High School falls under a state mandate to offer personal finance instruction at the 12th-grade level. The school chooses to teach a half-semester standalone course in Personal Finance and also to incorporate money management lessons into the required Economics & U.S. Government class.\nThis scenario meets standalone and integration requirements.\nCentury High School falls under a state mandate to offer personal finance instruction in grades 9 and 12. The school chooses to teach the 9th-grade section in the required Civics class, and the 12th-grade section in the required U.S. Government course.\nThis scenario does not meet standalone and integration requirements.", "created_at": "2025-10-09"}
{"id": "8ec53333-0cad-4561-a1cf-e9ecb71850b0", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 8, "page_end": 9, "section": null, "lang": "en", "text": "ses to teach the 9th-grade section in the required Civics class, and the 12th-grade section in the required U.S. Government course.\nThis scenario does not meet standalone and integration requirements.\nAssign Adequate Time and Level of Rigor to Subject Matter.\nThe Council for Economic Education tracks progress in personal finance education by state and publishes biennial reports. As indicated by the most recent report (2022), currently an insufficient amount of time is allocated toward personal finance in schools. While 9 states, including Alabama, Missouri, and Ohio, require standalone personal finance education for high school graduation, just 0.5 credits is the common requirement. Other states, such as California and Colorado, have a standalone personal finance course that is not required but may be offered as an elective. In states such as Arizona and Michigan, personal finance is integrated into other courses such as social studies or economics.(1) Overall, the survey found that the average amount of time spent on personal finance education in high schools is 18 hours, which is well under the time needed to gain and retain knowledge and well below what is required to make any long-term measurable impact on students’ lives in the future.\nUsing two models – Bloom’s Taxonomy of Higher Order Thinking Skills and Webb’s Depth of Knowledge (DOK) Framework (17,18) – we find that the current time and rigor requirements of most financial literacy programs only get students to use", "created_at": "2025-10-09"}
{"id": "cef9b936-a5bb-4d6c-ae78-39f566b23159", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 9, "page_end": 10, "section": null, "lang": "en", "text": "Higher Order Thinking Skills and Webb’s Depth of Knowledge (DOK) Framework (17,18) – we find that the current time and rigor requirements of most financial literacy programs only get students to use lower-order thinking skill sets. Simply having students reach the ‘understanding/remembering’ or ‘recall & reproduction’ levels (as shown in the graphic below) does little to improve students’ long-term financial wellness.\nCREATING 4 4 EXTENDED THINKING EVALUATING 4 ANALYZING 3 3 S TT HR IA NT KE INGI GC APPLYING 2 2 CS OK NIL CL ES P T& S UNDERSTANDING 1 1 RECALL & REPRODUCTION REMEMBERING 1 Bloom Webb", "created_at": "2025-10-09"}
{"id": "cd78fb99-98e8-40e4-a216-5858fa59241e", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 10, "page_end": 10, "section": null, "lang": "en", "text": "ancial wellness.\nCREATING 4 4 EXTENDED THINKING EVALUATING 4 ANALYZING 3 3 S TT HR IA NT KE INGI GC APPLYING 2 2 CS OK NIL CL ES P T& S UNDERSTANDING 1 1 RECALL & REPRODUCTION REMEMBERING 1 Bloom Webb\nGiven the importance of personal finance skills in adult life, the NFEC is advocating for more comprehensive personal finance education in high schools. Increased emphasis on personal finance education in high school can better prepare students for the financial challenges they will face as adults, and help them make informed decisions about managing their money and planning for their future.\nAt a minimum, every graduate should be able to develop an informed near-term financial plan and strategy (as stated in point ‘Relevant Content that Prepares Students for Financial Life Events’ below). Ideally, students should also have a long-term financial plan upon graduation.\nScenarios State A mandates one full year of financial education as a standalone course in high school and also requires that personal finance lessons be integrated into Civics & US Government classes. The program materials and pedagogy the state requires are designed to encourage students to reach at least the ‘analyzing’ level on Bloom’s Taxonomy and develop a long-term financial plan by the end of the course.\nState A meets time and rigor requirements.\nState B mandates that financial education be offered as an elective at the high school level.\nSchool districts are given discretion to decide which program material", "created_at": "2025-10-09"}
{"id": "d1476df1-75b4-4f52-bd6c-25fd1a5cb459", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 10, "page_end": 10, "section": null, "lang": "en", "text": "meets time and rigor requirements.\nState B mandates that financial education be offered as an elective at the high school level.\nSchool districts are given discretion to decide which program materials and pedagogy are used. Most schools use a curriculum package designed to get students to recall the content well enough to pass a final test.\nState B does not meet time and rigor requirements.", "created_at": "2025-10-09"}
{"id": "d9f7b03c-f583-4904-9b4f-81de99306621", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 10, "page_end": 12, "section": null, "lang": "en", "text": "terials and pedagogy are used. Most schools use a curriculum package designed to get students to recall the content well enough to pass a final test.\nState B does not meet time and rigor requirements.\nConduct Ongoing Education to Support Long-term Outcomes.\nWhy does our support for students’ education end when they graduate from high school? There is opportunity for continued contact and support of students’ financial well-being through ongoing education.\nHigh school students forget the majority of what they learn in school as soon as their final exams are over. That’s because they rarely have occasion to use the learning in real-life situations. Financial education represents a major exception to that rule. Young adults will be called upon to make real-world financial decisions even prior to graduation, and will need to manage money across their entire lifetimes.\nThe unifying outcome objective of K-12 financial education should be to produce high school graduates who have the competencies to make qualified financial decisions, manage their money effectively, and earn income that supports their needs and long-term plans.\nWith that overarching goal in mind, education should be continuous rather than intermittent, and should continue even after students graduate from high school. Ongoing education components can be automated and provided to students over the summer break. This piece is especially important after graduation. Graduates need a trusted source for information, insp", "created_at": "2025-10-09"}
{"id": "754321ce-21d9-4059-b6ae-93e154e1b572", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 12, "page_end": 12, "section": null, "lang": "en", "text": "Ongoing education components can be automated and provided to students over the summer break. This piece is especially important after graduation. Graduates need a trusted source for information, inspiration, and support as they prepare to meet life’s real-world challenges. Those who wish to learn more about personal finance should be provided with ample opportunities to do so.\nTechnology provides many opportunities to offer graduating students ongoing financial education. We need to move away from the mindset that education ends when students graduate from high school and take a long-term approach to their financial success and well-being.\nScenarios Ms. George teaches personal finance at Marston High School. In addition to the lessons she presents in the classroom, she has developed a set of brief “drip” education lessons designed to be sent to students at intervals over the summer break to keep financial education in front of mind and give them tools and exercises to practice what they’ve learned.\nThis scenario meets ongoing education standards.\nMs. Harry teaches personal finance at Wilmoth High School. She uses a curriculum package recommended by her school district, but the program has no ongoing education materials or suggestions.\nThis scenario does not meet ongoing education standards.", "created_at": "2025-10-09"}
{"id": "e5adbc4e-e48e-428b-bec9-ab219761a856", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 12, "page_end": 13, "section": null, "lang": "en", "text": "gh School. She uses a curriculum package recommended by her school district, but the program has no ongoing education materials or suggestions.\nThis scenario does not meet ongoing education standards.\nLesson Plans Adopt proven Relevant content Customize lesson curriculum that that prepares plans based on encourages higherstudents for socio-economic order thinking financial life events. status.\nand application.", "created_at": "2025-10-09"}
{"id": "1ea76f15-9a45-4f21-92a4-b6d4fc21e07e", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 13, "page_end": 13, "section": null, "lang": "en", "text": "Adopt proven Relevant content Customize lesson curriculum that that prepares plans based on encourages higherstudents for socio-economic order thinking financial life events. status.\nand application.\nRelevant Content that Prepares Students for Financial Life Events.\nAnother factor that contributes to the effectiveness of a school subject is the relevance of content to helping students prepare for the financial realities of life. According to a 2019 report by the Organization for Economic Co-operation and Development, effective school subjects are those that are designed to be engaging, meaningful, and relevant to students’ lives and interests. Further, engaging and relevant content can help promote student motivation, curiosity, and interest in learning about financial topics.(19) For high school students, personal finance instruction should help them build skills to handle the real-world decisions they need to make now or soon in their lives.\nHowever, most states that require financial education just offer a list of random topics to be included, rather than thoughtfully-designed lesson plans that prioritize students’ most urgent money management needs. As an example, the Florida state school financial education standards measure adopted in 2022 includes, among others, “Balancing a checkbook” and “Receiving an inheritance and related implications” as required study topics.(20) Other topics mandated – such as “Basic principles of money management, such as spending, credit, c", "created_at": "2025-10-09"}
{"id": "d201497f-6391-4a6c-89e8-a2725806b773", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 13, "page_end": 15, "section": null, "lang": "en", "text": "ng a checkbook” and “Receiving an inheritance and related implications” as required study topics.(20) Other topics mandated – such as “Basic principles of money management, such as spending, credit, credit scores, and managing debt, including retail and credit card debt” and “Basic principles of personal insurance policies” – are certainly relevant and important. But the requirements could define real-world outcomes for students if they were better framed as topics related to the students’ life stage.\nHigh school students are at a life stage where they have a high-priority need to learn specific financial skills that prepare them to move out on their own, pay for higher education, and set up and manage the right financial accounts. At what level is “Receiving an inheritance and related implications” related to a typical high school student’s current life and needs? Instead, they need to learn timely topics to avoid making mistakes that will cost them years of time and money to rectify. Youth need to start building a mountain, rather than digging out of a hole.\nThe NFEC calls for standards in high school financial education that at minimum require lessons based on near-term life events to ensure that our youth have the skills necessary to avoid common financial pitfalls that can disrupt their financial health.", "created_at": "2025-10-09"}
{"id": "131bcdb0-6288-41fa-ab52-f07c5cc84781", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 15, "page_end": 15, "section": null, "lang": "en", "text": "education that at minimum require lessons based on near-term life events to ensure that our youth have the skills necessary to avoid common financial pitfalls that can disrupt their financial health.\nHere are some of the most common financial pitfalls graduates fall into and financial milestones for which students should be prepared when they graduate:\nInitial Accounts Needed / Account Management Reason: Issues such as overdrafts or frequent insufficient funds can result in fees, potential account closure, and the inability to open other bank accounts, which can leave high-cost check cashing as the only option.\nCredit-building & Protection Reason: A small credit mistake can lead to years of limited access to financial resources, higher interest rates, fewer job opportunities, inability to rent housing, and difficulty obtaining loans or credit.\nIndependent Living Reason: Not knowing how to manage money when living independently can lead to financial instability, debt, credit issues, and difficulty achieving long-term financial goals.\nJob Search, Resumes, & Interviewing for Early Jobs Reason: Not knowing how to interview for a job or having a subpar resume can lead to missed opportunities, decreased confidence, lower wages, and potential difficulty securing employment.\nCareer and Income Exploration Reason: Failure to explore career options while young can lead to dissatisfaction with work, lack of fulfillment, and missed opportunities for personal and professional growth. It", "created_at": "2025-10-09"}
{"id": "546b027b-87fd-4bda-96a7-ee9002e613a1", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 15, "page_end": 16, "section": null, "lang": "en", "text": "Income Exploration Reason: Failure to explore career options while young can lead to dissatisfaction with work, lack of fulfillment, and missed opportunities for personal and professional growth. It is also a cause of added student loan debt for young adults who switch majors.\nHigher Education Exploration & Proactive College Financial Planning Reason: Student loan debt in the US currently totals $1.7 trillion,(21) with the average graduate owing $28,950.(22) These loans are often taken out by youth who lack the knowledge to make qualified financial decisions and can lead to long-term debt and missed opportunity cost that puts off important financial milestones like investing.\nAutomobile Options Reason: Overspending on a vehicle leads to financial strain, limited funds for other expenses, and potential difficulty selling or trading in the vehicle in the future. The inability to make timely payments can have impact on one’s credit, interest rates, and ability to make other purchases.", "created_at": "2025-10-09"}
{"id": "34ad803c-5bd0-4b05-be4b-e30bb79654f0", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 16, "page_end": 17, "section": null, "lang": "en", "text": "s, and potential difficulty selling or trading in the vehicle in the future. The inability to make timely payments can have impact on one’s credit, interest rates, and ability to make other purchases.\nScenarios Applegate High School offers a one-semester personal finance class at the 12th-grade level.\nOn the first day of the course, students complete a survey asking them to identify the five top life events they need to address before graduation. The instructor uses the data to choose the curriculum lessons that specifically help students prepare for their most pressing upcoming life events.\nThis scenario meets the standards for relevant content that prepares students for life events.\nUnderwood High School offers a one-semester personal finance class at the 12th-grade level. The instructor selects topics to cover based on a list of resources provided on the state Department of Education website.\nThis scenario does not meet the standards for relevant content that prepares students for life events.", "created_at": "2025-10-09"}
{"id": "e50515dc-fd29-4157-86a2-ae0eca72f2a4", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 17, "page_end": 17, "section": null, "lang": "en", "text": "pics to cover based on a list of resources provided on the state Department of Education website.\nThis scenario does not meet the standards for relevant content that prepares students for life events.\nAdopt Proven Curriculum that Encourages Higherorder Thinking and Application.\nAnother factor that contributes to the success of financial education programming is the use of a rigorous and engaging curriculum. According to a report by the National Research Council, a high-quality curriculum is one that is aligned with state standards, is challenging and relevant to learners, and promotes deeper understanding of key concepts and skills. Moreover, an engaging curriculum can help motivate students and foster a love of learning.(23) Lessons should increase in rigor and work students toward higher-order learning skill sets (for example, see Bloom’s Taxonomy of Higher-order Thinking Skills and Webb’s Depth of Knowledge framework).(17,18) High school students should be completing project-based learning and actively planning and building their financial foundations in alignment with near-term life events.\nTeaching financial education for maximum effect demands the best quality of curriculum resources and educational methodologies that optimize their delivery. The current information regarding financial education requirements in schools shows that some states simply provide teachers with a list of links to random resources.(24) In many states, mandated lessons do not align with national", "created_at": "2025-10-09"}
{"id": "21b23039-5dd7-483b-8b98-c59354d8cc7f", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 17, "page_end": 19, "section": null, "lang": "en", "text": "ing financial education requirements in schools shows that some states simply provide teachers with a list of links to random resources.(24) In many states, mandated lessons do not align with national standards, and the materials used to teach personal finance are often subpar in educational value. Some even promote financial products or government organization agendas.\nStandards should mandate that teachers select educational methodologies that help students improve their long-term financial outlooks.\nReaching this goal requires helping learners adopt positive financial behaviors and systems that support their journey toward financial security and wellness.", "created_at": "2025-10-09"}
{"id": "6b04db40-3d5a-44df-a2da-4cb1239c21e4", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 19, "page_end": 19, "section": null, "lang": "en", "text": "prove their long-term financial outlooks.\nReaching this goal requires helping learners adopt positive financial behaviors and systems that support their journey toward financial security and wellness.\nPrograms should be built around rigorous research-based instructional methodologies, including:\n- Backwards planning to ensure that lessons and activities build upon each other to support learner progress toward pre-defined outcomes.\n- Include active learning techniques, visual cues, case method-based activities, and project-based learning.\n- Audience adaptation to enable instructors to scaffold and adjust activities to support learners of all different motivations, knowledge levels, and learning styles.\n- Engagement with the affective dimension of learning and motivation in general, and of changing financial behaviors more specifically.\n- Recommendations for system development and long-term follow-up and support to encourage permanent change.\n- Have the students complete activities that help them with their current and near-term financial needs.\nExamples: creating a budget they can use now, deciding on a higher education path from an ROI perspective, setting up bank accounts, etc.\nScenarios Mrs. Jones’s financial education class is comprised entirely of lecture and quizzes.\nThis class does not meet best practice standards.\nMrs. Terry teaches financial education using different educational methodologies and delivery techniques including lecture, case studies, visual cues, activ", "created_at": "2025-10-09"}
{"id": "25a2f003-92f8-434c-86e0-fc72f99b9a7a", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 19, "page_end": 20, "section": null, "lang": "en", "text": "lass does not meet best practice standards.\nMrs. Terry teaches financial education using different educational methodologies and delivery techniques including lecture, case studies, visual cues, activities, and project-based learning.\nThis class aligns with best practice standards.", "created_at": "2025-10-09"}
{"id": "3d6320dd-5b66-49dd-a6fe-45bf8357850d", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 20, "page_end": 21, "section": null, "lang": "en", "text": "using different educational methodologies and delivery techniques including lecture, case studies, visual cues, activities, and project-based learning.\nThis class aligns with best practice standards.\nCustomize Lesson Plans Based on Socioeconomic Status.\nSuccessful financial education programs also must be differentiated and personalized to meet the diverse needs of all learners. According to a recent report by the National Center on Universal Design for Learning, effective school subjects are designed to be flexible and responsive to the needs and preferences of individual learners. Further, differentiation and personalization can help promote student engagement, motivation, and achievement.(25) Data should be considered to ensure that students are in a position to overcome any current family financial challenges and any negative habits picked up through generational influences.\nFor example, a student from a poor family may feel there is little hope to achieve any level of financial security; while students from rich families who are given whatever they want may lack understanding of delayed gratification or how to budget.\nSchools and teachers should work together to understand the socioeconomic diversity of a school and adjust lesson plans to help students achieve best results. Some data may already be available to support such differentiation – for example, the percentage of students in a school who receive subsidized school lunches. Surveys and other measurement methods", "created_at": "2025-10-09"}
{"id": "ec68b3f4-89b3-48b7-85a9-83d7ba53b1ea", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 21, "page_end": 22, "section": null, "lang": "en", "text": ". Some data may already be available to support such differentiation – for example, the percentage of students in a school who receive subsidized school lunches. Surveys and other measurement methods can be employed to deepen this understanding.\nPrograms selected should be flexible so highly-qualified educators can determine areas of most benefit to students and adjust lessons to meet learners’ needs.\nScenarios Caraway High School offers financial education as an elective for students in grades 11 and 12.\nThe instructors have no data available to determine students’ family socioeconomic status, so they use a packaged curriculum that provides the same lessons to all students.\nThis scenario does not meet standards for differentiation by socioeconomic status.\nPalmbridge High School gathers data on students’ family socioeconomic status as part of its entry requirements prior to the beginning of each school year. The financial education instructors analyze these data to segment the student population and offer coursework tailored to the needs of each group.\nThis scenario meets standards for differentiation by socioeconomic status.\nEducators & Leadership Program Learner outcomes Courses led by development focused on longhighly-qualified and deployment term financial personal finance managed by wellness and early educators.\nexperienced leaders. indicators.", "created_at": "2025-10-09"}
{"id": "3cf832ed-34f6-4367-80c4-7b40799c1287", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 22, "page_end": 23, "section": null, "lang": "en", "text": "ram Learner outcomes Courses led by development focused on longhighly-qualified and deployment term financial personal finance managed by wellness and early educators.\nexperienced leaders. indicators.\nCourses Led by Highly-qualified Personal Finance Educators.\nTeachers’ mastery of both content and pedagogy enables them to effectively convey complex concepts to their students. Compared with financial education, all other core subjects taught in school require years of specialized training. But although US states specify educator standards and continuing training requirements for teachers of other subjects, little or no training is provided or mandated to teach financial education.\nTeaching personal finance is different from teaching any other topic in school. Students have behavioral and emotional connections to the subject. Every child comes from a different financial situation and has a unique set of influences and goals. That’s why, as described by the Boston Public Schools’ Interactive Rubric for Effective Teaching, simply gaining content knowledge is not enough. Effective financial educators must be able to encourage students to reach higher levels of thinking. They must choose appropriate instructional models and adjust pedagogical approaches to meet student needs.(26) According to a 2013 report by the National Council on Teacher Quality, effective instruction involves the use of research-based instructional practices, the provision of timely and constructive feedback t", "created_at": "2025-10-09"}
{"id": "f838805e-ed17-477f-afe8-032e3acb4d09", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 23, "page_end": 23, "section": null, "lang": "en", "text": "rding to a 2013 report by the National Council on Teacher Quality, effective instruction involves the use of research-based instructional practices, the provision of timely and constructive feedback to students, and the use of data to inform and improve student learning. Moreover, effective instruction requires teachers who are knowledgeable and skilled in their subject areas and who are committed to ongoing professional development.(27) Compared to any other educational aspect, teachers have the greatest impact on student achievement.(28) Well-qualified teachers send more students to college and can boost a class’s lifetime income by as much as $250,000. On the flip side, poor teaching can continue to negatively affect students’ lives for many years after instruction ends.", "created_at": "2025-10-09"}
{"id": "88e2c6c8-25fd-457a-b6f9-79a61d1122ca", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 23, "page_end": 24, "section": null, "lang": "en", "text": "ents to college and can boost a class’s lifetime income by as much as $250,000. On the flip side, poor teaching can continue to negatively affect students’ lives for many years after instruction ends.\nAll personal finance educators should meet the standards set forth in the NFEC’s Framework for Teaching Personal Finance. Those standards include:\n- Demonstrating knowledge of the content and the pedagogy/andragogy of improving financial capabilities, financial psychology, and supporting the development of positive financial habits.\n- Demonstrating knowledge of participants’ cognitive abilities, willingness to change, motivating factors, and interests.\n- Setting instructional outcomes and financial behavior objectives.\n- Demonstrating knowledge of resources.\n- Designing coherent instruction.\n- Designing participants’ assessments.\n- Creating a classroom environment that is safe and supportive for students. This includes knowing what information students should not be asked to share with the class to protect their confidentiality, privacy, and security.\n- Communicating with participants about acquiring or changing financial behaviors.\n- Using questioning and discussion techniques that promote positive financial behaviors.\n- Engaging participants with relevant financial instruction.\n- Using assessment in instruction to measure behavioral change.\n- Demonstrating flexibility and responsiveness to participants’ learning needs.", "created_at": "2025-10-09"}
{"id": "db6adaee-8f50-4287-ab44-43b4af90d227", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 24, "page_end": 25, "section": null, "lang": "en", "text": "gaging participants with relevant financial instruction.\n- Using assessment in instruction to measure behavioral change.\n- Demonstrating flexibility and responsiveness to participants’ learning needs.\nScenarios Mr. Dunleavy is a social studies teacher who is charged with incorporating financial education into a 10th-grade Civics class. He has never taught personal finance before. Mr. Dunleavy is an avid investor, listens to personal finance podcasts weekly, and is confident on the topics.\nHe also went through specialized training and learned the methodologies to teach personal finance to maximize results.\nThis situation meets teacher preparation standards.\nMr. Walsh is a social studies teacher who is charged with incorporating financial education into a 10th-grade Civics class. He has never taught personal finance before, but he does his best and presents one segment in his afternoon class.\nThis class aligns with best practice standards.", "created_at": "2025-10-09"}
{"id": "a7c648b9-b748-4214-9623-987a2cb1bcae", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 25, "page_end": 27, "section": null, "lang": "en", "text": "ation into a 10th-grade Civics class. He has never taught personal finance before, but he does his best and presents one segment in his afternoon class.\nThis class aligns with best practice standards.\nProgram Development and Deployment Managed by Experienced Leaders.\nOne of the key factors that contributes to the success of any subject is the direction of experienced leaders who have proven their abilities to develop programs that improve student outcomes. According to a 2006 study by Waters and Marzano, effective school leaders are those who are able to create a clear vision, establish high expectations for student achievement, and provide support and resources to help teachers meet those expectations.(29) Among financial education programs currently mandated, most are shaped by legislators and school boards with little to no expertise in the development and deployment of financial literacy programming.\nWhile their agendas may be based on good intentions and a desire to help students, their lack of experience and expertise in financial education can do more harm than good.\nIndividuals who lead the development and deployment of financial education should have proven abilities in producing financial education programs that deliver positive results. They should represent organizations that meet third-party standards for excellence and represent best practices in the financial education space.\nScenarios The Independence School Board has voted to approve a mandate that high scho", "created_at": "2025-10-09"}
{"id": "5fb38a8d-7545-4872-8f4d-33e00a2a508f", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 27, "page_end": 27, "section": null, "lang": "en", "text": "ions that meet third-party standards for excellence and represent best practices in the financial education space.\nScenarios The Independence School Board has voted to approve a mandate that high school students must take a half-semester financial education course to graduate. They decide to let each individual high school in the district appoint an educator from within the school to choose the program materials and resources and determine how they’re implemented.\nThis scenario does not meet program leadership standards.\nThe Center City School Board has voted to approve a mandate that high school students must take a half-semester financial education course to graduate. They select an independent financial education provider with top credentials and proven experience in program development and deployment to lead the program in Center City schools.\nThis scenario meets program leadership standards.", "created_at": "2025-10-09"}
{"id": "a83dc952-69b9-4d29-988a-bf90575af8cd", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 27, "page_end": 28, "section": null, "lang": "en", "text": "ancial education provider with top credentials and proven experience in program development and deployment to lead the program in Center City schools.\nThis scenario meets program leadership standards.\nLearner Outcomes Focused on Long-term Financial Wellness and Early Indicators.\nMany states with personal finance instruction mandates do not require testing or evaluation, so educational success cannot be quantified. Outcome measures are essential for setting realistic expectations, designing effective teaching materials and methodologies, and evaluating student learning.\nWell-constructed programs use evaluative measures that go beyond just assessing content knowledge.\nThe primary outcome of any financial education program is actual improvement to students’ finances compared with control groups that have not received any financial education. Examples of such improvements might be increases in credit scores, higher savings rates, or creation of systems to manage one’s finances.\nEarly research showed that financial education can have impact on long-term behavior. In 2013 a group of researchers published a report for the Federal Reserve Board analyzing more than 13 years of data from three US states (Georgia, Idaho, and Texas) that had newly mandated financial literacy courses for the graduating class of 2007, with particular focus on the students’ credit behaviors after graduation.\nAccording to their analysis, students who completed the states’ financial education programs exhibi", "created_at": "2025-10-09"}
{"id": "8d08c071-f147-4092-9283-8554f6a4d5ff", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 28, "page_end": 28, "section": null, "lang": "en", "text": "graduating class of 2007, with particular focus on the students’ credit behaviors after graduation.\nAccording to their analysis, students who completed the states’ financial education programs exhibited more responsible borrowing and credit habits over time than young adults in neighboring states who did not receive such financial education.(30) While long-term outcomes are the ultimate measure of program impact, near-term measures can be good indicators of students’ likelihood of greater financial wellness and ability to apply financial lessons to real-world decisions in the future.", "created_at": "2025-10-09"}
{"id": "915f4039-b100-41d1-8f33-8698bc4c033c", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 28, "page_end": 28, "section": null, "lang": "en", "text": "measure of program impact, near-term measures can be good indicators of students’ likelihood of greater financial wellness and ability to apply financial lessons to real-world decisions in the future.\nThese near-term measures may include the following:\n- Financial Knowledge. For programs to be truly effective, the educator and educational resources should work toward activities that develop higherorder thinking skills and require increased cognitive processing. Pre-, post-, and long-term testing provide ways to measure content knowledge gains.\n- Financial Sentiment. Financial sentiment indicators measure students’ feelings/attitudes toward money and level of confidence when making financial decisions. These data can guide overall program design, educational methodologies, and financial education resources chosen.\n- Financial Behaviors. A top goal of financial education should be to encourage the adoption of positive financial behaviors that help lead students toward the results they desire. Behavioral measures can be quantified through Stages of Change Model (31) surveys and observation.\n- Financial Systems. Lesson plans should include activities that encourage students to establish financial systems. These systems should range from their accounts, to how their finances are managed, to calendar reminders of future activities. The systems can be measured to demonstrate participant action.\n- Financial Team. For high school students, their initial team may be a person at the ba", "created_at": "2025-10-09"}
{"id": "37489b6e-6a82-4fdf-a3a0-c164020a9b6b", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 28, "page_end": 29, "section": null, "lang": "en", "text": "ged, to calendar reminders of future activities. The systems can be measured to demonstrate participant action.\n- Financial Team. For high school students, their initial team may be a person at the bank whom they trust to help them with their accounts. A young person’s financial team might also include mentors and personal finance educators from whom they learn.\n- Financial Plan. Students should graduate from high school with a financial plan in place. Creating a financial plan – even one that will change many times as they mature – is a critical skill set and tool for achieving financial stability and security in the present as well as in the future. Planning helps students work toward goals and consider actions to keep them on track toward their agendas.", "created_at": "2025-10-09"}
{"id": "ba71ce84-1a7c-40f6-8954-56c3c776abba", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 29, "page_end": 29, "section": null, "lang": "en", "text": "tool for achieving financial stability and security in the present as well as in the future. Planning helps students work toward goals and consider actions to keep them on track toward their agendas.\nFurther, it’s notable that the current financial literacy rating systems focus solely on the amount of time spent teaching financial literacy in schools in a given state. For any other subject, the determination of an instructional program’s success would not be measured only by the amount of time students were required to spend studying the topic. Rather, success would be measured by students’ test scores and completion of projects and activities designed to prove proficiency in the subject matter. Financial literacy instruction also should be based on student learning outcomes, not just time spent in the classroom.\nScenarios Walden County School District requires personal finance to be taught in grades 6-12. The district leaves it up to the individual schools and teachers to determine how the students’ personal finance knowledge will be measured.\nThis district does not meet testing standards.\nCrook County School District requires personal finance to be taught in grades 6-12. Students are administered pre-tests at the beginning of each semester and post-tests at the end of each semester, surveys that gauge sentiment, behaviors, and systems. The assessments are carefully designed to measure student improvement in knowledge and application of the specific topics taught at each g", "created_at": "2025-10-09"}
{"id": "f8aa7584-3254-4e7e-b550-92f9d3c4f397", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 29, "page_end": 30, "section": null, "lang": "en", "text": "mester, surveys that gauge sentiment, behaviors, and systems. The assessments are carefully designed to measure student improvement in knowledge and application of the specific topics taught at each grade level.\nThis district aligns with testing standards.\nProgram Support Encourage parental Start financial Fund financial involvement and education courses literacy programs.\nprovide parents with in elementary access to resources. school.", "created_at": "2025-10-09"}
{"id": "cf610b9f-1282-4ea9-9591-459f4fca3f5f", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 30, "page_end": 31, "section": null, "lang": "en", "text": "sting standards.\nProgram Support Encourage parental Start financial Fund financial involvement and education courses literacy programs.\nprovide parents with in elementary access to resources. school.\nFund Financial Literacy Programs.\nMany states with financial literacy requirements are unfunded mandates. Legislation requires schools to teach personal finance, but no funding for the programming is provided in the bill. For example, Georgia, Florida, and Michigan provide no funding for mandated financial literacy coursework. According to the National Endowment for Financial Education (NEFE), “no additional funding is being provided for implementing the mandates. This lack of state funding puts a burden on local school districts.\nThey will need to pay for implementation costs or partner with private organizations to manage these expenses.”(32) Lack of funding for financial education can lead to low-value programming that does little to benefit students and can turn them off learning about the topic later. A recent report from the Economic Policy Institute underscores how our current system for funding public education – which relies primarily on state and local resources – shortchanges students, especially low-income students.(33) These funding inadequacies tend to be magnified during and after recessions, with repercussions that are costly for students and for the entire country. This problem will be particularly evident in the area of personal finance education, as students", "created_at": "2025-10-09"}
{"id": "a9068a92-9f0a-4aba-976c-c4ab2b6b09bc", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 31, "page_end": 31, "section": null, "lang": "en", "text": "ring and after recessions, with repercussions that are costly for students and for the entire country. This problem will be particularly evident in the area of personal finance education, as students are likely to be deprived of essential knowledge at the exact time when they need it most.\nFunding for financial education should include at minimum funds for professional development for current and potential teachers, resource information for both standalone and integrated presentation, rigorous and tested curriculum materials, and other resources needed to teach the course.\nScenarios State H mandates one semester of personal finance education as a requirement to graduate from high school. The legislative mandate does not set aside any funds for program implementation.\nState H does not meet the standards for funding financial education.\nState G mandates one semester of personal finance education as a requirement to graduate from high school. The legislative mandate sets aside specific funds from the State Department of Education to support teacher training, purchase of curriculum, and resources for integrating programming into various other subjects.\nState G meets standards for funding financial education.", "created_at": "2025-10-09"}
{"id": "6a074b28-ef2b-4599-9c36-34d09383a9d5", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 31, "page_end": 32, "section": null, "lang": "en", "text": "rtment of Education to support teacher training, purchase of curriculum, and resources for integrating programming into various other subjects.\nState G meets standards for funding financial education.\nEncourage Parental Involvement and Provide Parents with Access to Resources.\nParents’ influence on their children’s financial knowledge, attitudes, and habits has been well-documented across decades. When parents engage in financial discussions with children – especially when they start at a young age – it improves the children’s outlook on future financial situations. In a 2020 study, young adults who had discussions with their parents during childhood about spending behavior, financial investments, and the importance of savings were more likely to have positive attitudes toward saving and tracking expenses, which in turn had a positive effect on their financial well-being.(34) Developing a positive attitude toward money strongly predicts future financial health.\nIn a 2021 literature review, LeBaron and Kelley summarize substantial evidence supporting the strength of parental influence on financial socialization. Financial socialization is defined as “the process of acquiring and developing values, attitudes, standards, norms, knowledge, and behaviors that contribute to . . . financial viability and individual wellbeing.”(35) The evidence cited in their review points to parental discussions about money, positive behavior modeling, and experiential learning as particularly effe", "created_at": "2025-10-09"}
{"id": "7d7596fa-ac39-474c-8c14-fff804d11509", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 32, "page_end": 32, "section": null, "lang": "en", "text": "ncial viability and individual wellbeing.”(35) The evidence cited in their review points to parental discussions about money, positive behavior modeling, and experiential learning as particularly effective for improving financial socialization among emerging young adults.\nStandards for financial education should call for programs and interventions that encourage parents to initiate dialogues with their teens about money, including the importance of savings, family income, spending behavior, and financial products.\nMaterials should be provided to parents to involve them as active participants in tandem with the financial education youth receive at school. All curriculum and lesson plans used should be made available for parental review and parents should be given access to become actively involved in their teens’ financial education.\nScenarios Mr. Cooper teaches one semester of personal finance education at Danby High School. In addition to the personal finance lessons, he uses a set of handouts as homework assignments he sends home with students to complete with a parent. He also invites his students’ parents to review all the financial education materials and information he uses in the classroom.\nThis scenario meets parental involvement standards.\nMr. Lennox teaches one semester of personal finance education at Winston High School. He uses a curriculum package that does not include any materials or presentations for parents, and makes no effort to reach out to parents about", "created_at": "2025-10-09"}
{"id": "e713745b-19fa-4c5b-ab54-bd68548536b7", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 32, "page_end": 32, "section": null, "lang": "en", "text": "of personal finance education at Winston High School. He uses a curriculum package that does not include any materials or presentations for parents, and makes no effort to reach out to parents about the instruction.\nThis scenario does not meet parental involvement standards.", "created_at": "2025-10-09"}
{"id": "48489209-a63b-4bda-997f-be23c53ee45d", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 32, "page_end": 33, "section": null, "lang": "en", "text": "package that does not include any materials or presentations for parents, and makes no effort to reach out to parents about the instruction.\nThis scenario does not meet parental involvement standards.\nStart Financial Education Courses in Elementary School.\nTo maximize the benefits high school students receive from gaining financial education that meets the standards outlined above, outcomes will improve if we are able to begin shaping positive financial behaviors during their developmental years. Children start learning about the financial world at a very early age by observing the behaviors of their family and friends. But those influences aren’t always the most effective models for teaching children responsible financial decision-making. Formal personal finance education in elementary school can help students transition from basic to more advanced concepts in high school, and thus prepare them better for the financial challenges and opportunities of adulthood.(13) Financial habits form between ages 7 and 9,(36) that is, when children are in second to third grades.\nCurrently, most school financial education starts too late and too little time is dedicated to the subject. We recommend allowing for proper educational scaffolding by beginning financial education in elementary school and increasing cognitive rigor across grade levels.\nStudent outcomes should align with their level of cognitive development and reading/math proficiency.\nInstruction should meet financial literacy", "created_at": "2025-10-09"}
{"id": "7acc5927-4a4d-4b11-b5f5-91f7cc583f9d", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 33, "page_end": 33, "section": null, "lang": "en", "text": "ol and increasing cognitive rigor across grade levels.\nStudent outcomes should align with their level of cognitive development and reading/math proficiency.\nInstruction should meet financial literacy standards for kids that are appropriate for cognitive abilities at their age.\nPiaget’s Theory of Cognitive Development could usefully be applied as a model for separating material based on cognitive abilities. This theory specifies children’s understanding of key concepts according to the following stages: Pre-operational, ages 2-7; Concrete Operational, ages 7-11; and Formal Operational for those older than 11. Above age 11, learning barometers are separated based on students’ math abilities and understanding. Students learn skills that are essential to making fundamental personal finance calculations, including negative numbers, rates, decimals, and basic statistics needed to solve personal finance problems.(37) As posited by Piaget’s Theory of Cognitive", "created_at": "2025-10-09"}
{"id": "622dc4b8-1f24-46aa-892f-cbcfed02ac54", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 33, "page_end": 33, "section": null, "lang": "en", "text": "g fundamental personal finance calculations, including negative numbers, rates, decimals, and basic statistics needed to solve personal finance problems.(37) As posited by Piaget’s Theory of Cognitive\nDevelopment, learning barometers can be set based on the child’s age and developmental stage. During the elementary years, financial education should help students gain a basic understanding of money and help them shape positive behaviors, habits, and financial sentiment. Training during these years should be focused on developing knowledge and applying basic personal finance principles, molding behaviors, and helping students develop positive relationships with money.\nLessons should be integrated on a regular and consistent basis across core topics. For elementary school, lessons could be easily integrated into other core subjects; but time should also be allocated to lessons and projects solely focused on personal finance.\nScenarios Second-grade teacher Mrs. Young is charged with teaching personal finance in her class. She decides to present a lesson on budgeting. The students seem confused and don’t understand the basic concepts behind the material.\nThis scenario does not meet standards for alignment with cognitive developmental stage.\nSecond-grade teacher Mrs. Harcourt is charged with teaching personal finance in her class.\nShe finds an accredited program that scaffolds lessons based on children’s cognitive stage.\nUsing this curriculum, she presents an activity where the st", "created_at": "2025-10-09"}
{"id": "81461e31-42c9-4736-8c29-d5c3f4e342dc", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 1, "page_end": 33, "section": null, "lang": "en", "text": "ed with teaching personal finance in her class.\nShe finds an accredited program that scaffolds lessons based on children’s cognitive stage.\nUsing this curriculum, she presents an activity where the students play a math game using different denominations of money.\nThis scenario meets standards for alignment with cognitive developmental stage.", "created_at": "2025-10-09"}
{"id": "0f5067dc-1e7e-4453-a528-92e63d163339", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 1, "page_end": 33, "section": null, "lang": "en", "text": "ng this curriculum, she presents an activity where the students play a math game using different denominations of money.\nThis scenario meets standards for alignment with cognitive developmental stage.\nReferences 1. Council for Economic Education. 2022 Survey of the States: Economic and personal finance education in our nation’s schools. New York: Council for Economic Education; 2022.\n2. Grove A. High school course requirements for college admissions. ThoughtCo [Internet]. 2021 Feb 27; Available from: https://www.thoughtco.com/high-school-course-requirements-collegeadmissions-788858 3. National Association of College Admissions Counseling. High school classes required for college [Internet]. National Association for College Admissions Counseling; 2023. Available from: https://www.\nnacacfairs.org/learn/prep/high-school-classes-required-for-college-admission/ 4. Handel MJ. What do people do at work? A profile of U.S. jobs from the survey of workplace Skills, Technology, and Management Practices (STAMP). Journal of Labour Market Research. 2016;49:117–97.\n5. Education Commission of the States. High School Graduation Requirements [Internet]. Denver, CO:\nEducation Commission of the States; 2019. Available from: https://reports.ecs.org/comparisons/highschool-graduation-requirements-01 6. Cheeseman Day J, Martinez A. Does majoring in STEM lead to a STEM job after graduation? [Internet].\nWashington, DC: U.S. Census Bureau; 2021 Jun. Available from: https://www.census.gov/library/ stor", "created_at": "2025-10-09"}
{"id": "6a6f9114-0f20-4205-8ba2-db581573c5cd", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 1, "page_end": 33, "section": null, "lang": "en", "text": ". Cheeseman Day J, Martinez A. Does majoring in STEM lead to a STEM job after graduation? [Internet].\nWashington, DC: U.S. Census Bureau; 2021 Jun. Available from: https://www.census.gov/library/ stories/2021/06/does-majoring-in-stem-lead-to-stem-job-after-graduation.html 7. U.S. Bureau of Labor Statistics. Job Outlook [Internet]. Washington, DC: US Bureau of Labor Statistics; 2021. Available from: https://www.bls.gov/ooh/media-and-communication/writers-and-authors.\nhtm#tab-6 8. U.S. Bureau of Labor Statistics. Occupational Outlook Handbook: Field of degree: English [Internet].\nWashington, DC: U.S. Bureau of Labor Statistics; 2019. Available from: https://www.bls.gov/ooh/fieldof-degree/english/english-field-of-degree.htm 9. Nazareth S. Should foreign languages be mandatory? Claremont Courier [Internet]. 2019 Oct 23 [cited 2022 Nov 2]; Available from: https://thewolfpacket.org/4894/opinions/should-foreign-languagesbe-mandatory/#:~:text=The%20mandatory%20classes%20are%20problematic%20for%20many%20 reasons%2C,do%20a%20good%20job%20of%20teaching%20foreign%20languages.\n10. U.S. Bureau of Labor Statistics. Employment by major industry sector [Internet]. Washington, DC: U.S.\nBureau of Labor Statistics; 2021. Available from: https://www.bls.gov/emp/tables/employment-bymajor-industry-sector.htm 11. American Public Education Foundation. The Nation’s Report Card on Financial Literacy [Internet].\nCollierville, TN: American Public Education Foundation; 2022. Available from: https://www.\nt", "created_at": "2025-10-09"}
{"id": "f1f82d71-b3f0-4d83-9d9c-e662f697a8be", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 1, "page_end": 33, "section": null, "lang": "en", "text": "or.htm 11. American Public Education Foundation. The Nation’s Report Card on Financial Literacy [Internet].\nCollierville, TN: American Public Education Foundation; 2022. Available from: https://www.\nthenationsreportcard.org/ 12. Champlain College C for FL. National High School Financial Literacy: Report Summary [Internet].\nBurlington, VT: Champlain College: The Center for Financial Literacy; 2017. Available from: https:// www.champlain.edu/centers-of-experience/center-for-financial-literacy/report-national-high-schoolfinancial-literacy/results-summary", "created_at": "2025-10-09"}
{"id": "b518f8b3-12ef-4595-9157-e8d0f0b77825", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 1, "page_end": 33, "section": null, "lang": "en", "text": "e: The Center for Financial Literacy; 2017. Available from: https:// www.champlain.edu/centers-of-experience/center-for-financial-literacy/report-national-high-schoolfinancial-literacy/results-summary\n13. Council for Economic Education. National Standards for Financial Literacy [Internet]. New York: Council for Economic Education; 2013 [cited 2014 Sep 23]. Available from: http://www.councilforeconed.org/ wp/wp-content/uploads/2013/02/national-standards-for-financial-literacy.pdf 14. Amagir A, Groot W, van den Brink HM, Wilschut A. A review of financial-literacy education programs for children and adolescents. Citizenship, Social & Economics Education. 2018;17(1):56–80.\n15. Andruss P. New education trend: Students required to take personal finance classes. Is it working? USA Today Back to School [Internet]. 2022 Aug 18; Available from: https://www.usatoday.com/story/money/ personalfinance/2022/08/18/high-school-finance-classes-retirement-planning/10308783002/ 16. National Association of Secondary School Principals. Creating a culture of inquiry. Reston, VA: NASSP; 2015.\n17. Forehand M. Bloom’s Taxonomy: Original and revised. In: Orey M, editor. Emerging perspectives on learning, teaching, and technology. Athens, GA: The Global Text Project; 2010.\n18. Hess K. A guide for using Webb’s Depth of Knowledge with Common Core State Standards. Oakbrook Terrace, IL: The Common Core Institute; 2013.\n19. Organisation for Economic Co-operation and Development. Innovative learning environm", "created_at": "2025-10-09"}
{"id": "82a0c76e-362d-4dbe-a1dc-6f5b66247657", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 1, "page_end": 33, "section": null, "lang": "en", "text": "b’s Depth of Knowledge with Common Core State Standards. Oakbrook Terrace, IL: The Common Core Institute; 2013.\n19. Organisation for Economic Co-operation and Development. Innovative learning environments. Paris, France: OECD; 2019.\n20. Cabrera B. High School Graduation Requirements in Personal Finance [Internet]. HB1115 Mar 8, 2022. Available from: https://flsenate.gov/Session/Bill/2022/1115/Analyses/h1115e.\nEEC.PDF#:~:text=The%20bill%20requires%20that%20beginning%20with%20students%20 entering,complete%20to%20earn%20a%20standard%20high%20school%20diploma.\n21. Friedman Z. Student loan debt statistics in 2022: A record $1.7 trillion. Forbes [Internet]. 2022 May 16; Available from: https://www.forbes.com/sites/zackfriedman/2022/05/16/student-loan-debt-statisticsin-2022-a-record-17-trillion/?sh=3a96d65b4d5a 22. Hahn A. 2023 student loan debt statistics: Average student loan debt. Forbes [Internet]. 2023 May 9; Available from: https://www.forbes.com/advisor/student-loans/average-student-loan-debt-statistics/ 23. EdReports.org. Why materials matter. National Research Council; 2006.\n24. National Financial Educators Council. Exploring how many states require financial education [Internet]. Las Vegas, NV: National Financial Educators Council; 2019. Available from: https://www.\nfinancialeducatorscouncil.org/how-many-states-require-financial-education/ 25. National Center on Universal Design for Learning. The UDL Guidelines [Internet]. Seattle, WA: National Center on Universal Design f", "created_at": "2025-10-09"}
{"id": "27239662-778c-49f3-bf4a-151890de152a", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 1, "page_end": 33, "section": null, "lang": "en", "text": "ducatorscouncil.org/how-many-states-require-financial-education/ 25. National Center on Universal Design for Learning. The UDL Guidelines [Internet]. Seattle, WA: National Center on Universal Design for Learning; 2018. Available from: https://udlguidelines.cast.org/ 26. Boston Public Schools. Interactive Rubric for Effective Teaching [Internet]. Roxbury, MA: Boston Public Schools; Available from: https://www.bostonpublicschools.org/Page/280#:~:text=Subject%20 Matter%20Knowledge%20extends%20beyond,into%20content%20yields%20richer%20learning.\n27. Greenberg J, McKee A, Walsh K. Teacher prep review: Program performance in early reading instruction.\nWashington, DC: National Council on Teacher Quality; 2013 Jun.\n28. Terada Y. Understanding a teacher’s long-term impact. Edutopia [Internet]. 2019 Feb 4; Available from:", "created_at": "2025-10-09"}
{"id": "ec10a6fa-d383-429c-85d5-df8424213165", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 1, "page_end": 33, "section": null, "lang": "en", "text": "in early reading instruction.\nWashington, DC: National Council on Teacher Quality; 2013 Jun.\n28. Terada Y. Understanding a teacher’s long-term impact. Edutopia [Internet]. 2019 Feb 4; Available from:\nhttps://www.edutopia.org/article/understanding-teachers-long-term-impact#:~:text=Compared%20 to%20any%20other%20aspect%20of%20schooling%2C%20teachers,can%20boost%20a%20 class%E2%80%99s%20lifetime%20income%20by%20%24250%2C000.\n29. Waters JT, Marzano RJ. School district leadership that works: The effect of superintendent leadership on student achievement [Internet]. Denver, CO: Mid-continent Research for Education and Learning; 2006 Sep. Available from: https://files.eric.ed.gov/fulltext/ED494270.pdf 30. Brown A, Collins JM, Schmeiser M, Urban C. State mandated financial education and the credit behavior of young adults. Washington, DC: Federal Reserve Board; 2014. (Finance and Economics Discussion Series).\n31. Prochaska JO, Velicer WF. The Transtheoretical Model of Health Behavior Change. The Science of Health Promotion. 1997;12(1):38–48.\n32. Donahue E. Not all mandates are created equal: A 2022 legislative recap [Internet]. National Endowment for Financial Education. 2022. Available from: https://www.nefe.org/news/2022/08/notall-mandates-are-created-equal.aspx 33. Allegretto S, García E, Weiss E. Public education funding in the U.S. needs an overhaul [Internet].\nWashington, DC: Economic Policy Institute; 2022 Jul. Available from: https://www.epi.org/publication/ public-educatio", "created_at": "2025-10-09"}
{"id": "1fef85d1-529e-4120-9f59-1b487627efd2", "doc_id": "8a83af96-2dd5-41b7-9475-8e8e8cf2ebf4", "title": "Policy and Standards Framework for High School Financial Literacy Education Designed to empower policymakers, educational institutions, and various stakeholders to optimize the eff", "source_file": ".\\pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "page_start": 1, "page_end": 33, "section": null, "lang": "en", "text": "cía E, Weiss E. Public education funding in the U.S. needs an overhaul [Internet].\nWashington, DC: Economic Policy Institute; 2022 Jul. Available from: https://www.epi.org/publication/ public-education-funding-in-the-us-needs-an-overhaul/#:~:text=Education%20funding%20 generally%20is%20inadequate%20and%20inequitable%3B%20It,get%20less%20funding%20per%20 student%20than%20low-poverty%20districts.\n34. Utkarsh, Pandey A, Ashta A, Spiegelman E, Sutan A. Catch them young: Impact of financial socialization, financial literacy and attitude towards money on financial well-being of young adults. International Journal of Consumer Studies. 2020;44:531–41.\n35. LeBaron AB, Kelley HH. Financial socialization: A decade in review. Journal of Family and Economic Issues. 2021;42((Suppl 1)):S195–206.\n36. Phelan R. 4 ways to teach kids about money before their habits are set at age 9. Business Insider [Internet]. 2021 Oct 25; Available from: https://www.businessinsider.com/personal-finance/why-weneed-to-teach-kids-about-money-2021-10 37. National Financial Educators Council. Kids Financial Literacy Standards (PK – 8th Grade). Las Vegas, NV: National Financial Educators Council; 2018.", "created_at": "2025-10-09"}
