{"id": "95c0663a-ccf8-4f08-b9e9-f98955d00570", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 0, "text": "1 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?\nGetting into Debt at a Young\nAge as Part of a Lifecycle\nPhase: A Cause for Concern?\nYoung adults often experience limited financial resources, marked\nby relatively lower earnings and fewer assets, while at the same\ntime experiencing major life events, struggling to make ends meet,\nand with a tendency toward a particular lifestyle. Looking at it from\na positive perspective, debt facilitates the acquisition of assets and\nmaintains a steady level of consumption. Although indebtedness is\na normal phase in a young adult’s lifecycle, excessiveness of it can\nlead to serious consequences.\nStarting a career, buying a car, getting married, they are juggling significant life milestones, with a\npursuing further education, buying a house, raising penchant for a specific lifestyle. These major life\nchildren – these are the usual major life events events require a huge amount of money and are\nyoung people face in their life. At this stage, they most likely financed through some forms of debt.\nhave relatively lower income and fewer assets, yet In making ends meet, young people may opt to\n\nGetting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern? 2\nPsychological Health and Financial The Current Situation to Ponder Upon\nBank Negara Malaysia (BNM), in its Financial\nConsequences\nTable 1\nStability Review Second Half 2022, reported that\nenrolment in the Debt Management Programme\nPsycholo", "created_at": "2026-01-03"}
{"id": "33af3c70-b0f2-437f-9eff-e8cbd0f5b491", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 1, "text": "Current Situation to Ponder Upon\nBank Negara Malaysia (BNM), in its Financial\nConsequences\nTable 1\nStability Review Second Half 2022, reported that\nenrolment in the Debt Management Programme\nPsychological Health Financial\n(DMP) of the Credit Counselling and Debt\nConsequences Consequences\nManagement Agency (AKPK) rose to 34,670\nMental health disorders Risk of going into debt borrowers in 2022 from 23,711 in the previous\ntraps\nyear, an increase of 46.35 percent. Out of those\nDeteriorating family Reduction in credit who registered in the DMP, 15,600 (44.96 percent)\nrelationships scores\nborrowers are aged between 30 and 39 years old\nDifficult social Delayed asset and 3,700 (10.66 percent) are in the 20 to 29 years\ninteractions accumulation old age group.\nBeing declared\nbankrupt The Malaysian Department of Insolvency (MdI), in\nits most recent statistics, revealed that there are\n33,388 cases of individual bankruptcy for a period\nborrow money especially when they are running from 2019 until February 2023, and 6,361 cases or\nlow on funds to survive until the next pay check. 19.05 percent of them are represented by young\nadults aged below 25 years old and between 25 to\nMoreover, at a young age, individuals often find 34 years old. The breakdown of bankruptcy cases\nthemselves influenced by the lifestyle of their by sources of bankruptcy show that the top five\npeers in terms of the brands of clothes they wear, causes of bankruptcy are personal financing (49.31\nthe types of restaurants", "created_at": "2026-01-03"}
{"id": "c6399f55-6168-442f-82f8-5b23ac887efd", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 2, "text": "y the lifestyle of their by sources of bankruptcy show that the top five\npeers in terms of the brands of clothes they wear, causes of bankruptcy are personal financing (49.31\nthe types of restaurants they frequent, and the percent), business financing (16.95 percent), vehicle\ngadgets they use. Keeping up with these trends hire-purchase (11.20 percent), home financing (8.23\ncan lead to their income becoming insufficient, percent) and credit card debt (6.44 percent). These\nand they end up using facilities like credit cards, statistics by AKPK and MdI provide an indication\npersonal loans, easy payment schemes, and buy- that a considerable number of young adults are\nnow-pay-later (BNPL) schemes to address their having difficulties with their debts.\nfinancial issues.\nDebt Management Programme\nFrom a positive angle, debt plays a role in\nApproved by Agensi Kaunseling\nhelping individuals acquire assets and better\ndan Pengurusan Kredit (AKPK)\nmanage their spending. For example, with\nhousing loans or mortgages, young adults can\npurchase a house through instalments over\n40\nan extended period. Hence, debt enables\nasset acquisition and wealth accumulation.\n35\nIn addition, debt can facilitate and maintain a\nsteady standard of living in situations where 5.5\nthe income is inadequate to meet basic needs, 30\nas well as during emergencies. Easy payment 5.1\nschemes provided by credit card issuers, for 25\n9.9\nexample, enables the purchase of household\n4.6\nitems through either zero-interest or low", "created_at": "2026-01-03"}
{"id": "6015f1e7-12ea-40f8-976a-838e27c63589", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 3, "text": "c needs, 30\nas well as during emergencies. Easy payment 5.1\nschemes provided by credit card issuers, for 25\n9.9\nexample, enables the purchase of household\n4.6\nitems through either zero-interest or low-interest 20 8.1\nmonthly payments.\n6.5\n15\nIt is common for young adults to carry consumer\ndebts such as car loans, housing loans, education 15.6\n10 12.6\nloans, and credit cards because they are at\n9.8\nthe stage of starting a life and in the process\nof accumulating assets and building up their 5\ncareer. Although indebtedness among young 4 2.9 3.7\nadults is a natural part of the lifecycle, excessive 0\nindebtedness can lead to serious consequences. 2020 2021 2022\nIf the debts are unmanageable, there is a potential 20-29 years old 30-39 years old\nrisk that young adults may fall into detrimental\n40-49 years old ≥50 years old\npsychological health consequences and adverse\nfinancial consequences.\nSource: Financial Stability Review – Second Half 2022\n)sdnasuohT(\nslaudividnI\nfo\n.oN\nFigure 1\n\n3 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?\nIndividual Bankruptcy Cases by Age Group from 2019 until February 2023\nFigure 2\n15,000 12,811\n8,922\n10,000\n6,255 5,186\n5,000\n106 108\n0\nBelow 25-34 35-44 45-54 55 years old No available\n25 years old years old years old years old and above information\nCases\nSource: Malaysian Department of Insolvency (MdI)\nIndividual Bankruptcy Cases by Sources of Bankruptcy from 2019\nuntil February 2023\nFigure 3\nCorporate Guarantor 1.90", "created_at": "2026-01-03"}
{"id": "07ecd5bf-15e8-4103-8323-c32c3c046f9f", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 4, "text": "rs old and above information\nCases\nSource: Malaysian Department of Insolvency (MdI)\nIndividual Bankruptcy Cases by Sources of Bankruptcy from 2019\nuntil February 2023\nFigure 3\nCorporate Guarantor 1.90% EPF Contribution 0.95%\nTax Debt 2.20% Education Financing/Scholarship 1.90%\nOther Debts 2.58% Social Guarantor 0.05%\nCredit Card Debt 6.44%\nHome Finance 18.23%\nPersonal Financing 49.31%\nVehicleHire-Purchase\n11.20%\nBusiness Financing 16.95%\nSource: Malaysian Department of Insolvency (MdI)\nThe Ease of Having Access to Credits and the Super Sale, Malaysia Mega Sale Carnival, Malaysia\nConvenience Associated With it, Fuel Impulsive Year-End-Sale, Single’s Day 11.11 Sale, and 12.12\nBuying Behaviours and Lead to the Problem of Sale, including festival-related sales during Hari\nIndebtedness Among Young Adults. Raya, Chinese New Year, Deepavali and Christmas,\namong others.\nToday, getting access to credit is relatively easier\nwith the availability of credit cards, electronic According to the Malaysia Market Insight Report\npayment facilities and buy-now-pay-later (BNPL) 2022, Malaysians are shifting their purchasing\nschemes. These credit facilities are closely tied to habits away from traditional brick-and-mortar\nconsumption behaviour and current trends. Mega stores and moving toward online shopping. The\nsales are quite common in Malaysia, and shoppers report states that Malaysians are deemed to be\nare accustomed to waiting for these major sales to bargain hunters, as evidenced by huge tr", "created_at": "2026-01-03"}
{"id": "83503219-39c8-4c92-b751-398a8123e99c", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 5, "text": "hopping. The\nsales are quite common in Malaysia, and shoppers report states that Malaysians are deemed to be\nare accustomed to waiting for these major sales to bargain hunters, as evidenced by huge traffic\nget good bargains. Among them are the Malaysia spikes in online market places on specific dates of\n\nGetting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern? 4\nmajor sales such as on the 11.11 sales, where 60 that they have being grappling with indebtedness\nto 70 percent of these huge traffics are converted problems since they were younger. From a human\ninto actual purchases. The surge in these figures lifecycle perspective, young adults are typically in\nis propelled by a variety of payment options, a phase of accumulating wealth, with a long way\nincluding credit cards, online bank transfers, to go in life. If they are declared bankrupt, their\ne-wallets, and BNPL schemes, which allow for financial future might be compromised.\nquick and easy checkouts.\nPersonal financing has been identified as the\nIn recent years, BNPL has emerged as a new type leading cause of bankruptcy cases. Other major\nof easy payment scheme that allows shoppers to sources of bankruptcy are business financing,\nsplit their payments into three equal instalments, vehicle hire-purchase, home financing, and credit\nfor instance. According to BNM’s Financial card debt. A majority of these are consumptionStability Review Second Half 2022, four major non- related financing that facilita", "created_at": "2026-01-03"}
{"id": "a52710d6-e458-4b88-ab99-75af85dda4a4", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 6, "text": ", home financing, and credit\nfor instance. According to BNM’s Financial card debt. A majority of these are consumptionStability Review Second Half 2022, four major non- related financing that facilitate individuals to\nbank BNPL players control 96 percent of the total accumulate assets and to achieve a desired\nBNPL transaction values. According to the same lifestyle. The ease of obtaining credit, combined\nreport, 44 percent of BNPL users are between with the convenience of using it online, encourages\nthe ages of 18 and 30. It is a matter of concern impulsive purchasing behaviour, particularly in\nthat the proportion of BNPL users with overdue online shopping. Engaging in impulsive purchasing\npayments is also increasing, from 7 percent in the may lead to debt accumulation, and it can escalate\nfourth quarter of 2021 to 14 percent in the second to indebtedness. Therefore, young adults must\nquarter of 2022, and finally to 17 percent in the always be wary of the consequences of having\nfourth quarter of 2022. excessive and unmanageable debt.\nAge vs Indebtedness Accumulation of Excessive Debt at a Young\nIndebtedness among young adults is a growing Age Will Lead to Financial and Psychological\nconcern in Malaysia. As highlighted in the Consequences.\nprevious section, individuals under AKPK’s Debt\nManagement Programme (DMP) were those • Distort the accumulation of wealth – one\nranging from ages 20 to 39, which accounts for reason is that, a portion of the hard-earned\n55.62 percent of the", "created_at": "2026-01-03"}
{"id": "ff1d0b0e-0178-43aa-866c-7641a02de2cf", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 7, "text": "s Debt\nManagement Programme (DMP) were those • Distort the accumulation of wealth – one\nranging from ages 20 to 39, which accounts for reason is that, a portion of the hard-earned\n55.62 percent of the total DMP enrolment as of income must be directed towards loan\nthe second half of 2022, 44.96 percent for those repayment instead of investing in incomebetween 30 to 39 years old, and 10.66 percent generating assets. Another reason is the\ncame from the age range of 20 to 29 years old. potential risk that some of the assets might be\nrepossessed by the creditors in loan default\nBased on the report released by the Malaysian situations.\nDepartment of Insolvency (MdI) in 2023, young\nadults aged 34 years old and below represent • Get caught in a debt trap – a debt trap refers\n19.05 percent of total bankruptcy cases and ranks to a situation where an individual takes a new\nthe third highest age group in these cases. The debt to cover the existing debts. This normally\nhighest number of bankruptcy cases is recorded occurs when the individual is unable to meet\nfor the age group of between 35 to 44 years the current obligations under existing debts,\nold with 12,811 cases or 38.37 percent of total prompting them to seek other borrowing\nbankruptcy cases. alternatives.\nBankruptcy is the legal status marked by a court • Lower credit score – a high level of debt\norder, attained by individuals who are unable to service ratio (DSR) and late payment may lower\nmeet their loan obligations. Prior to t", "created_at": "2026-01-03"}
{"id": "3d7a30ae-1ece-40d1-8087-568ada22cfe2", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 8, "text": "us marked by a court • Lower credit score – a high level of debt\norder, attained by individuals who are unable to service ratio (DSR) and late payment may lower\nmeet their loan obligations. Prior to the filing an individual’s credit score, which makes it\nof a bankruptcy notice in court, creditors would harder for them to obtain credit in the future.\nhave sought a civil judgment on the individual for\nbeing delinquent on the debt payment through • Financial stress – being in debt could lead to\ncivil court proceedings. The entire process, from financial stress which could affect the mental\ncivil court proceedings to bankruptcy filing, to the health, relationship, and overall well-being of\nissuance of a court order is lengthy, which means young adults.\nthat bankrupt individuals have had to be privy to\nthe problems of indebtedness long before the • Delay life milestones – being in debt may\nlegal proceedings against them. The age group delay certain important life milestones such as\nof between 35 to 44 years old, who represent the getting married, having children, and pursuing\nhighest age group of bankruptcy cases, suggests further education.\n\n5 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?\nin the economy, and the level of household\n• Reduce the quality of life – young adults may debt of a country is normally measured by the\nbe compelled to sacrifice their quality of life to household debt as a percentage of the gross\nmake debt payments. For ex", "created_at": "2026-01-03"}
{"id": "6dba7179-c5ba-4233-acd3-c3c0422d1912", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 9, "text": "ality of life – young adults may debt of a country is normally measured by the\nbe compelled to sacrifice their quality of life to household debt as a percentage of the gross\nmake debt payments. For example, they might domestic products (GDP). Malaysia has recorded\nneed to get part-time jobs to earn more money a high household debt as a percentage of GDP\nto cover their living expenses and to repay their in the past few years with ratios of more than 80\nloans. percent since 2012. The highest household debt\nas a percentage of GDP was recorded in 2020 at\n• Being declared bankrupt – the worst 93.32 percent. Recent data shows that Malaysia’s\nconsequence of high indebtedness is being household debt as a percentage of GDP stands\ndeclared bankrupt, which can lead to financial at 81.2 percent for the second half of 2022, with\nstress and reduced social welfare. Bankrupt residential properties financing contributing the\nindividuals face several restrictions, including most with 59.7 percent of the overall household\nthe transfer of all their assets and properties debt in Malaysia. Personal financing accounts for\nto the Director General of Insolvency (DGI). 12.8 percent, motor vehicles financing accounts for\nFurthermore, they are not allowed to be 12.7 percent, non-residential properties financing\nappointed as directors or involved in the accounts for 5.6 percent, securities financing\nmanagement of a company, and are not accounts for 5.2 percent, while credit cards\nallowed to travel overse", "created_at": "2026-01-03"}
{"id": "76a090a4-822f-4283-9594-987d91653b93", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 10, "text": "cing\nappointed as directors or involved in the accounts for 5.6 percent, securities financing\nmanagement of a company, and are not accounts for 5.2 percent, while credit cards\nallowed to travel overseas unless with the DGI’s represent 2.8 percent, and other debts constitute\npermission. 1.2 percent of the total household debt. Research\nhas found that a high-level of household debts of\nAll these consequences are the direct impact of a country causes instability to the financial system\nindebtedness on the individuals’ well-being. The and depresses the economic growth, apart from\nconsequences of individual indebtedness extend deteriorating social and psychological health.\nbeyond personal finances, as it also has an impact It is, therefore, very important to address the\non the financial system and on the economy, as issue of indebtedness especially among young\ndiscussed in numerous academic research. At adults because of the damaging consequences\nthe aggregate level, household debt signifies to the individuals, the financial system, and the\nthe consumer debts within the household sector economy.\nComposition of Household Debt by Purpose - Second Half of 2022\nFigure 4\nOthers 1.2%\nCredit Cards 2.8%\nMotor Vehicles 12.7%\nPersonal Financing 12.8%\nResidential Properties 59.7%\nSecurities 5.2%\nNon-Residential\nProperties\n11.20%\nSource: Financial Stability Review Second Half 2022\n\nGetting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern? 6\nWho Plays a Key Role in Ad", "created_at": "2026-01-03"}
{"id": "00de7b97-ba86-412c-81b8-071254b354b6", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 11, "text": "Non-Residential\nProperties\n11.20%\nSource: Financial Stability Review Second Half 2022\n\nGetting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern? 6\nWho Plays a Key Role in Addressing the Issue providing support when the borrowers have\nof Indebtedness Among Young Adults? repayment difficulties. Transparency of financing\nThe issue of indebtedness among young adults rates, fees, and charges, will ensure that loan\nrequires attentions from various parties – not only providers provide significant information\nby the individuals themselves, but also education to their borrowers for them to make better\nproviders, loan providers, and the government borrowing decisions. Responsible lending\nthrough its regulatory bodies. should go together with financial education,\nfor example, prospective loan applicants could\n• Young adults – young adults should take undergo brief readings or videos on financial\nthe necessary efforts to be equipped with literacy topics and subsequently be assessed to\nfinancial knowledge for them to acquire basic determine their financial literacy level as a prefinancial planning skills. Financial planning is an requisite of loan approval. This may enhance\nessential life skill because managing one’s own the loan approval process to ensure a more\nfinancial matters is an integral aspect of life. thorough evaluation on the suitability of the\nFinancial knowledge can be acquired either by potential borrowers.\nattending seminars conducted by accredit", "created_at": "2026-01-03"}
{"id": "835d4513-5777-440f-b573-697c7208c5c2", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 12, "text": "nancial matters is an integral aspect of life. thorough evaluation on the suitability of the\nFinancial knowledge can be acquired either by potential borrowers.\nattending seminars conducted by accredited\ntrainers, by reading newspapers, magazines, • The government through its regulatory\nand websites, or by watching videos on bodies – the Malaysian government has\nsocial media. Numerous certified financial implemented several regulations on the\nprofessionals regularly share their financial adoption of lending practices. Bank Negara\nplanning knowledge on social media platforms, Malaysia, for example, has introduced measures\noffering resources valuable for young adults. to limit the amount of credit that individuals\nAdditionally, young adults can adopt proactive can access based on their income, as well as\nmeasures to prevent excessive debt, such as to regulate credit card marketing practices.\navoiding unnecessary expenses, limiting the use To enhance past efforts, the government may\nof credit cards, and establishing and adhering control credit access by regulating fringe or\nto a budget. Young adults need to be aware shadow lending activities. There are lending\non the avenues where they can seek credit activities that are provided by non-banks\ncounselling in case of financial difficulties, such and are not under the regulation of the Bank\nas going to the Credit Counselling and Debt Negara Malaysia, often charging higher rates\nManagement Agency (AKPK). of interest. They are either", "created_at": "2026-01-03"}
{"id": "d2317b60-6e07-4649-9e88-90a30d3b6096", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 13, "text": "ties, such and are not under the regulation of the Bank\nas going to the Credit Counselling and Debt Negara Malaysia, often charging higher rates\nManagement Agency (AKPK). of interest. They are either regulated by other\nauthorities or in some cases, even unregulated.\n• Education providers – institutions of higher With the situations of high household debt and\nlearning, training providers, and training arms high bankruptcy cases in recent years, it is the\nof regulatory bodies can play an eminent role right time to regulate shadow lending activities\nin instilling financial literacy and debt literacy in Malaysia.\namong young adults, for instance, topics on\nmoney management, borrowings and interest Our Opinion\ncalculation, the importance of savings and Addressing the issue of debts among young\ninvestments, and the power of compounding. adults requires a multifaceted approach that\nIn a press release on 17 February 2023, the includes financial education and government\nCredit Counselling and Debt Management regulations. It is crucial to provide young adults\nAgency (AKPK) stated that 41.8 percent of with financial education to enhance their financial\npeople aged 30 to 40 years old face financial literacy.\ndifficulties, due to the lack of knowledge in\nfinancial management. Therefore, it is essential They should be given a basic understanding of\nto educate young adults to improve their money management, investing, borrowing, and\nfinancial literacy. The strategy and approach of the time", "created_at": "2026-01-03"}
{"id": "fc28ea88-1fd6-4953-84e3-f76dc6d62606", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 14, "text": "essential They should be given a basic understanding of\nto educate young adults to improve their money management, investing, borrowing, and\nfinancial literacy. The strategy and approach of the time value of money, as well as the ability to\neducating young people should be creatively apply that knowledge effectively. Individuals with\ndesigned to capture their interest, and this can good financial literacy can better manage their\nbe done through online games, social media day-to-day finances and avoid financial difficulties.\nposts, and interactive videos.\nThe government‘s regulatory bodies may\n• Loan providers – banks and other lending implement stricter credit assessments and\ninstitutions can improve their current practice oversee shadow lending activities. Furthermore,\nof responsible lending by being more the regulatory bodies can take steps to encourage\ntransparent on product disclosure, scrutinising lending institutions to adopt responsible lending\nthe affordability of potential borrowers, and practices.\n\n7 Getting into Debt at a Young Age as Part of a Lifecycle Phase: A Cause for Concern?\nCollaboration between the government’s facing financial difficulties, it is advisable for them\nregulatory bodies, the financial education to seek guidance from AKPK’s qualified financial\nproviders, and the loan providers can help ensure counsellors. AKPK also offers Debt Management\nthat young Malaysians improve their financial Programmes (DMP) catered to young adults with\nliteracy and p", "created_at": "2026-01-03"}
{"id": "bb01d580-0edf-4466-9cd4-ddfa475e73dc", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 15, "text": "oviders, and the loan providers can help ensure counsellors. AKPK also offers Debt Management\nthat young Malaysians improve their financial Programmes (DMP) catered to young adults with\nliteracy and promote responsible borrowing to debt-related issues to alleviate their debt burden.\nprevent financial problems at a young age and to It is rather typical for young adults to borrow\nsafeguard the financial well-being of young adults. money at this phase of their life where they are\nfacing major life events and seeking lifestyle\nFurther information on financial literacy and well- aspirations, as they have relatively lower income\nbeing can be obtained from AKPK’s e-learning and fewer assets to meet their needs. While\nportal at https://power.akpk.org.my/eLearning/ borrowing is common, young adults need to\nHome/BrowseElearnings. Individuals can also maintain control of their spending and borrowing.\nattend public events organised by AKPK, such Without it, they may be caught in a debt trap and\nas corporate workshops and seminars, to gain may be subjected to a deteriorating financial and\nand enhance their financial knowledge. For those social well-being.\nABOUT THE AUTHOR\nMahdhir Abdullah is a lecturer at Islamic Science University of Malaysia (USIM) Academic Team,\nCapital Market and Wealth Management, Islamic Banking & Finance, Islamic Finance,\nFaculty of Economics and Muamalat.\nmahdhir@usim.edu.my\nReferences\nAgensi Kaunseling dan Pengurusan Kredit. (2022, July 12). Look before you leap", "created_at": "2026-01-03"}
{"id": "2e5ce693-c593-41ed-8c97-3aadcbe2fe77", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 16, "text": "anagement, Islamic Banking & Finance, Islamic Finance,\nFaculty of Economics and Muamalat.\nmahdhir@usim.edu.my\nReferences\nAgensi Kaunseling dan Pengurusan Kredit. (2022, July 12). Look before you leap into debts. The Star.\nhttps://www.akpk.org.my/look-you-leap-debts.\nAgensi Kaunseling dan Pengurusan Kredit. (2023, February 17). AKPK : Thirty-nine institutions of higher\nlearning offer personal financial management course. The Star. https://www.akpk.org.my/akpkthirty-nine-institutions-higher-learning-offer-personal-financial-management-course.\nBank Negara Malaysia. (2023). Financial Stability Review Second Half 2022. In Intellectual Property. http://\nwww.eestipank.info/pub/en/dokumendid/publikatsioonid/seeriad/finantsvahendus/_2004_1/\nfsy_504.pdf.\nBunn, P., & Rostom, M. (2014). Household debt and spending. Bank of England Quarterly Bulletin, 54(3),\n304–315. http://search.ebscohost.com/login.aspx?direct=true&db=bth&AN=98503635&lang=e\ns&site=ehost-live.\nCommissionfactory. (2021). Malaysia Market Insight Report.\nMalaysia Department of Insolvency. (2023). Bankruptcy Statistic as at February 2023.\nMian, A., Sufi, A., & Verner, E. (2017). Household debt and business cycles worldwide. Quarterly Journal\nof Economics. https://doi.org/10.1093/qje/qjx017.\nRani, M. S. A., Nordin, S. H. B., Chin Ching Lau, Sheng Ling Lim, & Zhen Shing Siow. (2017). Rich debt, poor\ndebt: Assessing household indebtedness and debt repayment capacity. Bank for International\nSettlements Papers, 91, 153–168. http:", "created_at": "2026-01-03"}
{"id": "7f8e93cb-615e-4b8d-a52a-a88a09558405", "doc_id": "c2f599ef-b44f-4bdc-a326-6493798337c4", "title": "Article 6 (Getting Into Debt)", "source_file": "pdfs\\ARTICLE 6 (GETTING INTO DEBT).pdf", "chunk_index": 17, "text": "Ching Lau, Sheng Ling Lim, & Zhen Shing Siow. (2017). Rich debt, poor\ndebt: Assessing household indebtedness and debt repayment capacity. Bank for International\nSettlements Papers, 91, 153–168. http://www.bis.org/publ/bppdf/bispap91.pdf#page=167.\nZabai, A. (2017). Household debt: Recent developments and challenges. BIS Quarterly Review,\nDecember, 39–54.\nZainol, Z., Daud, Z., Nur, A., Nizam, H. K., Rashid, R. A., & Alias, N. (2016). Exploring Factors that Contribute\nto Individual Indebtedness among Young Muslims. International Journal of Economics and\nFinancial Issues, 6(S7), 320–328. http: www.econjournals.com.", "created_at": "2026-01-03"}
