{"id": "f97e5031-ea7a-4063-950b-a1133ec3cde3", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 0, "text": "1 Digital Financial Literacy Fuels Financial Resilience\nDigital Financial Literacy\nFuels Financial Resilience\nDigital financial services are gaining global acclaim for their\npotential to improve financial accessibility and resilience, with\ndigital financial literacy being a crucial aspect.\nWhat is Digital Financial Literacy? financial literacy. Even though many Malaysians\nDigital financial literacy is a blend of digital and use technology and are more confident in using\nfinancial literacy, focusing on the use of digital digital channels, certain safety precautions may be\ntechnologies and financial skills such as personal overlooked. Therefore, even if they are immersed\nfinancial management, budgeting, and investing. in the digital economy, they may not be digitally\nIt involves the acquisition of knowledge, skills, literate. This is evidenced by the nearly daily media\nconfidence, and competencies to make informed coverage of online frauds such as the Macau scam,\ndecisions using digital and financial applications. investment and loan scams, love scams, and even\nmule account activities that prey on vulnerable\nAccess to digital banking products and services Malaysians and frequently involve large sums of\nis highly dependent on the level of digital and money.\n\nDigital Financial Literacy Fuels Financial Resilience 2\nThe Pandemic Caused the Rise of Digital Banking As a result, the rapid increase in digitalisation\nWhich Necessitates Digital Financial Literacy underscores the signific", "created_at": "2026-01-03"}
{"id": "9d651117-9ad5-4adc-b5ff-00248655e9af", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 1, "text": "cy Fuels Financial Resilience 2\nThe Pandemic Caused the Rise of Digital Banking As a result, the rapid increase in digitalisation\nWhich Necessitates Digital Financial Literacy underscores the significance of digital financial\nDigital banking is the digitalisation of classic banking literacy for effective transaction management\nactivities and services, which are traditionally available and security measures, thereby strengthening\nin physical branches. Digital financial services financial resilience.\nare enhancing global financial accessibility and\nresilience, enabling individuals to manage Current Digital Financial Behaviour of Malaysians\nand recover from financial shocks, ultimately The FCI 2021 report revealed startling findings\ncontributing to their financial well-being. about Malaysians’ susceptibility to online financial\ntransactions. Based on the FCI survey, one-third\nThe COVID-19 pandemic has significantly of those polled are willing to share their sensitive\naccelerated the digitalization of Malaysia’s information such as bank account passwords or PIN\nfinancial services industry. KPMG’s early pandemic numbers with close friends, and nearly two-thirds\nsurvey (Business Insider, 2020) discovered that do not consider a website’s security features before\n77% of Malaysians considered digital banking as conducting online transactions. This suggests that\nthe next development in financial services, 82% Malaysians tend to be trusting individuals, even\nhave already used internet b", "created_at": "2026-01-03"}
{"id": "981aa598-a776-4b8d-996a-76d23fbf3542", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 2, "text": "ered digital banking as conducting online transactions. This suggests that\nthe next development in financial services, 82% Malaysians tend to be trusting individuals, even\nhave already used internet banking facilities, and though deciding whom to trust is one of the most\nsimilarly, 82% are willing to open online accounts important life skills for them to have.\nregulated by Bank Negara Malaysia (BNM).\nAnother survey carried out a year later by the In addition, Malaysians do not bother to check\nFinancial Capability and Inclusion Demand whether the website on which they are making\nSide Survey 2021 (FCI 2021) revealed that many payments is legitimate and trustworthy. Accordingly,\nMalaysians are using digital financial services these people are far more likely to be duped into\npost-pandemic. Another similar observation entering their banking information through a bogus\nis provided by the World Bank’s Global Findex website. This in turn enables fraudsters to commit\nSurvey (2021), which reports that 79% of fraud with customers’ data. Even worse, fraudsters\nMalaysian adults used digital payments, 42% of are now becoming more skilled at exploiting\nwhom were doing so for the first time because technology and targeting victims, particularly\nof the pandemic. those with a nonchalant attitude and a lack or low\nawareness of cybercrime via online methods.\nFintech Malaysia’s (2022) latest report also\nrecorded 27.4 million internet users by January As a result of that troubling and deeply conc", "created_at": "2026-01-03"}
{"id": "89831322-8abc-4076-a6af-7473fab9b07e", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 3, "text": "and a lack or low\nawareness of cybercrime via online methods.\nFintech Malaysia’s (2022) latest report also\nrecorded 27.4 million internet users by January As a result of that troubling and deeply concerning\n2022, with internet banking quadrupling in situation, several parties have expressed concern\nthe last decade and usage rates rising to over about Malaysians’ digital financial literacy level.\n100% during the 2020 pandemic alone. Online BNM stated in a recent press conference that the\nbanking penetration was at 112.5%, while low, limited, and very concerning level of digital\nmobile banking penetration stood at 61.8%. financial literacy among Malaysians, combined\nAnother recent report by Agensi Kaunseling dan with their low awareness, trust, and confidence\nPengurusan Kredit (AKPK) (2022) also confirmed in digital services, are preventing them from\nthat the pandemic has prompted Malaysians confidently using digital financial services and\nto embrace digital technology as they surfed participating in the digital economy.\nand shopped digitally, leading to an increase\nin online purchases and spending. Since then, Recent Initiatives in Promoting Digital Financial\na vast majority of Malaysians have used and are Literacy\ncomfortable with using the internet and mobile Digitalisation, in fact, began long before the\nbanking services for their daily transactions. pandemic. Unfortunately, Malaysians, including\nDue to the reliance on mobile banking, online businesses, are falling short of", "created_at": "2026-01-03"}
{"id": "1c1489ba-1e7c-4d2d-ada0-9fef44d9c79e", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 4, "text": "fact, began long before the\nbanking services for their daily transactions. pandemic. Unfortunately, Malaysians, including\nDue to the reliance on mobile banking, online businesses, are falling short of the government’s\nmobile banking has surpassed social media as digitalisation goals. Therefore, to enhance the\nthe second most popular application (ASEAN digitalisation of the country’s financial services,\nDigital Generation Report, 2022). the government and its agencies have consistently\nmade efforts through various initiatives.\nAdditionally, digital financial services growth in\nMalaysia has fronted to 98% of small merchants One such initiative is the establishment of the\nand businesses accepting digital payments, Financial Education Network (FEN) in 2016. FEN is\nfavouring them for efficiency, time savings, and an inter-agency collaboration co-chaired by BNM\ncost-effectiveness. The acceptance of digital and the Securities Commission Malaysia (SC), with\npayments has catalysed the use of other digital founding members that include the Ministry of\nfinancial services, such as savings and borrowing. Education (MOE), Perbadanan Insurans Deposit\n\n3 Digital Financial Literacy Fuels Financial Resilience\nMalaysia (PIDM), the Employees Provident Fund risen to 17% in the second half of 2022, compared\n(EPF), AKPK, and Permodalan Nasional Berhad to 14% in the second quarter (Q2) of 2022 and 7%\n(PNB). FEN focuses primarily on financial literacy in Q4 of 2021. The schemes continue to target\nand", "created_at": "2026-01-03"}
{"id": "37e51c2b-7367-4a7f-aa22-e6e935a567b0", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 5, "text": "mpared\n(EPF), AKPK, and Permodalan Nasional Berhad to 14% in the second quarter (Q2) of 2022 and 7%\n(PNB). FEN focuses primarily on financial literacy in Q4 of 2021. The schemes continue to target\nand did not initially prioritise digital financial selected segments of Malaysian households,\nliteracy until recently, when it emerged as a global with a majority of users being younger and lowerconcern. income borrowers. BNM said that about 44% of\nBNPL users are aged between 18 and 30. More\nWith the goal of promoting prudent financial than 80% of BNPL users earn less than RM3,000 a\nmanagement attitudes and behaviours, and month and are more susceptible to financial stress.\ntowards improving the financial literacy among\nMalaysians, FEN had developed a five-year The current level of digital financial literacy among\nNational Financial Literacy Strategy from 2019 Malaysians will exacerbate rising cybercrime and\nto 2023. Various campaigns and roadshows have out-of-control impulse purchases. Several groups\nbeen designed, such as Financial Literacy Month have been identified as being digitally underserved\n(FLM), which is a monthly event in October aimed and lacking digital and financial literacy. According\nat raising consumer awareness and improving to media reports, the elderly, women, and young\nfinancial literacy, including digital literacy among generations are the most vulnerable and easily\nMalaysians. preyed upon.\nIssues to Be Addressed Most elderly people are either not digitally li", "created_at": "2026-01-03"}
{"id": "a40d1e0a-2b0f-4192-a2ee-c0b7958fef2c", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 6, "text": "oung\nfinancial literacy, including digital literacy among generations are the most vulnerable and easily\nMalaysians. preyed upon.\nIssues to Be Addressed Most elderly people are either not digitally literate\nDespite the significant increase in digital financial or savvy enough to protect their personal and\nusage, which is highly beneficial, Malaysians’ sensitive data from being exposed. Seniors living\ncurrent digital financial behaviour is concerning. alone are at greater risk of becoming victims of\nThe digitalisation of commerce and banking has financial fraud because they lack social support/\nopened doors to cybercrime. According to Polis networks, and, not least, technological illiteracy.\nDiraja Malaysia (PDRM), cases of online fraud are Nevertheless, even where digital literacy is present,\non an upward trend and worrying (Salleh, 2022). older people remain vulnerable and susceptible\nThe PDRM Commercial Crimes Investigation if they are not savvy or vigilant enough (based\nDepartment (CCID) reported that 71,833 fraud on heightened awareness and/or experience) to\ncases were recorded from 2020 to May 2022. respond to the tactics of fraudsters as embodied\nOnline fraud accounted for 48,850 cases, or 68% in phishing.\nof all frauds, with 26,213 cases being tried in court.\nWomen, despite being educated and professional,\nThe internet has also become more appealing, are also a popular target for con artists. Some\nluring people to overspend. With the increased women fall victim to onli", "created_at": "2026-01-03"}
{"id": "9e708aca-952d-4f3d-8a21-ca5766d9fcb5", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 7, "text": "e being educated and professional,\nThe internet has also become more appealing, are also a popular target for con artists. Some\nluring people to overspend. With the increased women fall victim to online romance scams and\navailability of online shopping via various platforms, love scams because they are lonely, while others\nincluding social media, the proclivity to make enjoy the thrill of an adventure or are even attracted\nimpulsive purchases has increased, making it nearly to the idea of being in a relationship and in love.\nimpossible to avoid. The situation is deteriorating Scammers use these women’s trust and feelings\nfurther as more “buy-now-pay-later” (BNPL) services to gain access to their financial resources through\nhas become available, raising fears that many internet love fraud.\npeople will become trapped in a long-term debt\ntrap. BNPL options are available in a variety of Even though the younger generations are digital\nretail sectors, from fashion to travel, and are natives, they are not immune and are frequently\noffering alternative payment methods and, in\nsome cases, interest-free terms. The trend, which\nhas been accelerated by the COVID-19 pandemic\nand exacerbated by rising income inequality, is\nbeneficial for many Malaysians seeking to stretch\ntheir ringgit without incurring additional long-term\ndebts.\nBNM (2023) stated in its Financial Stability Review\nreport that there is an increasing trend in missed\nrepayments among selected larger BNPL players,\nimplying th", "created_at": "2026-01-03"}
{"id": "f14d6dfb-9763-4a9d-8306-347d0e01858d", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 8, "text": "incurring additional long-term\ndebts.\nBNM (2023) stated in its Financial Stability Review\nreport that there is an increasing trend in missed\nrepayments among selected larger BNPL players,\nimplying that such risks are increasing. The central\nbank said that the share of BNPL users with overdue\npayments in the fourth quarter (Q4) of 2022 had\n\nDigital Financial Literacy Fuels Financial Resilience 4\nduped by scams. Because the younger generation Hence, the integration of digital financial literacy\nhas grown up with online services, their increased into educational programmes, workplace training,\nvigilance, trust, and reliance on them makes them community outreach initiatives, and online resources\nmore vulnerable to scams if they are unaware of can equip individuals of all ages with the necessary\nthe tactics used by the scammers. For example, knowledge and skills for responsible financial\ncollege and university students who are struggling decisions in the digital age. Consequently, ongoing\nfinancially and feel pressured to keep up with their efforts to adapt financial literacy programmes to the\npeers are more likely to be scammed because they evolving digital landscape should be maintained,\nare drawn in by the promise of quick and easy as they are critical in dealing with new financial\nmoney and good deals. technologies and trends.\nLower-income or marginalised communities are Way Forward\nanother group that must not be overlooked. They Technology is extremely important nowadays.\nfr", "created_at": "2026-01-03"}
{"id": "a2b5d1e4-e3ec-4c07-8273-2477f5806f11", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 9, "text": "l\nmoney and good deals. technologies and trends.\nLower-income or marginalised communities are Way Forward\nanother group that must not be overlooked. They Technology is extremely important nowadays.\nfrequently have limited access to digital financial People are being forced to digitalise whether they\nservices or lack the knowledge and skills required like it or not, hence navigating the digital world is\nto use them effectively. critical. With the proliferation of mobile and other\ndigital financial products, the continued expansion\nConsequences of digital financial services, and the growth of\nDigital financial literacy is crucial today as all the gig economy, in which individuals take more\nfinancial services and products are now accessible responsibility for their own financial planning,\nin digital form in nearly all global economies. making it critical for consumers to be digitally\nTechnological innovation is rapidly transforming financially literate to effectively use digital financial\nvarious sectors, especially the finance industry, technology products and services and avoid online\nnecessitating a significant increase in digital fraud and costly mistakes.\nliteracy knowledge to effectively navigate these\ntechnological advancements. At the consumer level, they must learn and practise\ngood cybersecurity habits to avoid becoming\nThe absence of digital financial literacy gives a victim of fraud. On a macro level, all parties,\nrise to a series of problem, affecting not only the i", "created_at": "2026-01-03"}
{"id": "3d5664aa-22b6-4a36-b6d5-b8c898e05450", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 10, "text": "tise\ngood cybersecurity habits to avoid becoming\nThe absence of digital financial literacy gives a victim of fraud. On a macro level, all parties,\nrise to a series of problem, affecting not only the including the government, regulators, agencies,\nindividuals but also the society and the country as society, and the public, must collaborate to\na whole. For instance, in the previous two years promote digital financial literacy among citizens to\n(2020 - 2022), a substantial loss of RM5.2 billion increase access to, and utilisation of digital financial\nwere reported in the country due to online scam services while maintaining financial inclusion gains.\ncases. The following are among the initiatives that can be\nundertaken:\nTherefore, greater financial sophistication is • Initiate awareness campaigns to educate the\nrequired to effectively use financial technology public about mitigation measures, available\nproducts and services and avoid costly financial support programmes, consumer protection\nmistakes and frauds such as phishing, hacking, issues, complaints, and redress mechanisms\nunauthorised use of data, discriminatory treatment, and possible risks.\nand behavioural issues such as excessive borrowing. • Engage with providers of digital financial\nConsequently, to be highly financially literate, services by promoting responsible business\nthey must first be digitally and financially literate practices and raising public awareness of\nto understand the technological constraints, releva", "created_at": "2026-01-03"}
{"id": "6c608a91-4b41-4e07-92cb-2ae79baf0e0f", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 11, "text": "literate, services by promoting responsible business\nthey must first be digitally and financially literate practices and raising public awareness of\nto understand the technological constraints, relevant risk issues and mitigation measures.\nrisks, and hazards associated with internet-based • Make extensive use of digital networks and\nfinancial transactions. media to spread digital financial literacy\noutreach.\nThe importance of digital financial literacy should • Consider using celebrities and social media\nbe immediately recognised, as failure to do so can influencers as digital financial literacy campaign\nresult in significant financial consequences. High endorsers.\nlevels of online scams can damage consumer\ntrust, lower e-commerce sales, and negatively In a nutshell, digital financial literacy provides\nimpact foreign investment and international individuals with the necessary skills to navigate\nrelations. Countries with high prevalence of online the digital financial landscape, make informed\nscams may need to invest in public awareness decisions, and enhance financial resilience.\ncampaigns and educational programmes to help Effectively using digital tools and resources can\ncitizens recognise and avoid scams, requiring help individuals protect themselves from financial\nsignificant resource expenditure. setbacks and ensure long-term financial well-being.\n\n5 Digital Financial Literacy Fuels Financial Resilience\nABOUT THE AUTHOR\nDr. Wan Rasyidah Wan Nawang\nAcademic Team, Islamic", "created_at": "2026-01-03"}
{"id": "3875dd95-355a-4513-bb15-9d4d249a8156", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 12, "text": "resource expenditure. setbacks and ensure long-term financial well-being.\n\n5 Digital Financial Literacy Fuels Financial Resilience\nABOUT THE AUTHOR\nDr. Wan Rasyidah Wan Nawang\nAcademic Team, Islamic Business & Management, Marketing,\nBusiness & Management, Senior Lecturer\nwrasyidah@usim.edu.my\nReferences\nAbd Samad, S., & Mansor, N. (2013). Population ageing and social protection in Malaysia. Malaysian\nJournal of Economic Studies, 50(2), 139-156.\nAKPK (2022a). Cukupkah simpanan persaraan anda? Deduced from https://www.akpk.org.my/\nperancangan-persaraan\nAKPK, (2020). Saving awareness still lacking. https://www.akpk.org.my/saving-awareness-still-lacking\nAKPK, (2022b). Love, Lies & Money. https://www.akpk.org.my/ms/love-lies-and-money\nBéné, C., & Friend, R. M. (2011). Poverty in small-scale fisheries: old issue, new analysis. Progress in\nDevelopment Studies, 11(2), 119-144.\nBakeri, (2020). Malaysia 2030: Cabaran Negara Tua. Pg. 1. Terengganu Strategic & Integrity Institute\n(TSIS)\nBarnard, (2022). How might the cost of living crisis affect long-term poverty?. 8 SEP 2022. Inequality\n& Poverty. https://www.economicsobservatory.com/how-might-the-cost-of-living-crisis-affectlong-term-poverty\nBerita Harian (2023). 'Simpanan persaraan rakyat Malaysia pada tahap membimbangkan' | Nasional |\nBerita Harian (bharian.com.my). 17 February, 2023\nCEIC, (2021). Malaysia Household Debt: % of GDP. https://www.ceicdata.com/en/indicator/malaysia/\nhousehold-debt--of-nominal-gdp\nChe Amani, N., Kahar, R", "created_at": "2026-01-03"}
{"id": "4e0f1c50-2e15-46d6-a522-44f67dca649a", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 13, "text": "erita Harian (bharian.com.my). 17 February, 2023\nCEIC, (2021). Malaysia Household Debt: % of GDP. https://www.ceicdata.com/en/indicator/malaysia/\nhousehold-debt--of-nominal-gdp\nChe Amani, N., Kahar, R., Ibrahim, R., and Hasbullah, M. (2021). Older Financial Abuse Experience: A\nQualitative Study from the Perspective of Older Persons in Malaysia. HRMARS. http://dx.doi.\norg/10.6007/IJARBSS/v11-i8/10409\nDoSM (2022a). Current Population Estimates, Malaysia 2022. Department of Statistics, Malaysia. ISSN\n2426-2273\nDepartment of Statistic Malaysia (DoSM), (2022b). Abridged life table, Malaysia, 2019-2022. Department\nof Statistics Malaysia Official Portal (dosm.gov.my)\nDepartment of Statistics, Malaysia (2019). Household Income and Basic Amenities Survey Report 2019,\nThe Key Findings.\nEPF, (2019). EPF Wages War On Fraudulent Withdrawal Syndicates. https://www.kwsp.gov.my/en/web/\nguest/w/epf-wages-war-on-fraudulent-withdrawal-syndicates\nEPF, (2022). EPF Receives 5.3 Million Applications Under The Special Withdrawal Facility. https://\nwww.kwsp.gov.my/en/web/guest/w/epf-receives-5.3-million-applications-under-the-specialwithdrawal-facility\nKlasen, S., Lechtenfeld, T., & Povel, F. (2011). What about the women? Female headship, poverty and\nvulnerability in Thailand and Vietnam (No. 76). Discussion Papers.\nLaraia, B. A. (2013). Food insecurity and chronic disease. Advances in Nutrition, 4(2), 203-212.\nLSE (2019). Income inequality among different ethnic groups: the case of Malaysia. Septemb", "created_at": "2026-01-03"}
{"id": "98483f90-8e20-4929-bccd-e63cc8a59e4f", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 14, "text": "sion Papers.\nLaraia, B. A. (2013). Food insecurity and chronic disease. Advances in Nutrition, 4(2), 203-212.\nLSE (2019). Income inequality among different ethnic groups: the case of Malaysia. September 11th,\n2019. Malaysia. https://blogs.lse.ac.uk/businessreview/2019/09/11/income-inequality-amongdifferent-ethnic-groups-the-case-of-malaysia/\nMalay Mail, (2022). Survey: Malaysians start to worry more about inflation than Covid-19 itself now. 19\nMay 2022. Malaysia. https://www.malaymail.com/news/malaysia/2022/05/19/survey-malaysiansstart-to-worry-more-about-inflation-than-covid-19-itself-now/7631\nNational Older Adults Policy (2011). Ministry of Women, Family, and Community Development. https://\nwww.kpwkm.\nNew Straits Times, (2020). Saving awareness still lacking. October 31, 2020. https://www.nst.com.my/\nnews/nation/2020/10/636843/saving-awareness-still-lacking\n\nDigital Financial Literacy Fuels Financial Resilience 6\nReferences (Cont.)\nOECD (2023). Old-age income poverty | Pensions at a Glance 2021: OECD and G20 Indicators | OECD\niLibrary (oecd-ilibrary.org)\nSaidi, N., Zainalaludin, Z., & Jamaluddin, A. (2021). Gender Analyses on the Vulnerability Types Suffered by\nPoor and Older Freshwater Fisheries Community Members in Peninsular Malaysia. International\nJournal of Academic Research in Business and Social Sciences, 11(12), 2046–2069\nShahar, S., Vanoh, D., Mat Ludin, A.F. et al. (2019). Factors associated with poor socioeconomic status\namong Malaysian older adults: an analysis", "created_at": "2026-01-03"}
{"id": "dc33f997-149d-488e-803b-0d03eb75a45b", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 15, "text": "ch in Business and Social Sciences, 11(12), 2046–2069\nShahar, S., Vanoh, D., Mat Ludin, A.F. et al. (2019). Factors associated with poor socioeconomic status\namong Malaysian older adults: an analysis according to urban and rural settings. BMC Public\nHealth 19 (Suppl 4), 549. https://doi.org/10.1186/s12889-019-6866-2\nSinar Harian (2023). Wujudkan segera skim kerja warga emas. https://www.sinarharian.com.my/\narticle/257900/berita/nasional/wujudkan-segera-skim-kerja-warga-emas\nAgensi Kaunseling dan Pengurusan Kredit. (2022). Rebuilding Financial Resilience: What Consumers\nCan Learn from the Pandemic. Kuala Lumpur.\nBusiness Today. (2020, 13 May). KPMG: Digital banks should focus on the unserved and underserved\nsegment. https://www.businesstoday.com.my/2020/05/13/kpmg-digital-banks-should-focus-onthe-unserved-and-underserved-segment/\nBank Negara Malaysia (2023a). Financial Inclusion Framework. 2023 – 2026. Strategy Paper. https://www.\nbnm.gov.my/documents/20124/55792/SP-2nd-fin-incl-framework.pdf\nBank Negara Malaysia (2023b). Financial Stability Review: First Half 2022. The Financial Capability and\nInclusion Demand Side Survey 2021. https://www.bnm.gov.my/documents/20124/8440087/\nfsr22h1_en_box1.pdf.\nFintech Malaysia. (2022). Malaysia Fintech Report 2021. https://fintechnews.my/wp-content/\nuploads/2021/05/Fintech-Report-Malaysia-2021-Fintech-News-Malaysia-x-BigPay.pdf.\nWorld Economic Forum (2022, December). ASEAN Digital Generation Report: Digital Financial Inclusion.\nhttps://www3", "created_at": "2026-01-03"}
{"id": "49f69303-bfe2-42df-8ad3-ca8091559a8c", "doc_id": "6961c031-eb13-4934-bcd7-183530a2de2e", "title": "Article 4 (Digital Financial)", "source_file": "pdfs\\ARTICLE 4 (DIGITAL FINANCIAL).pdf", "chunk_index": 16, "text": "tent/\nuploads/2021/05/Fintech-Report-Malaysia-2021-Fintech-News-Malaysia-x-BigPay.pdf.\nWorld Economic Forum (2022, December). ASEAN Digital Generation Report: Digital Financial Inclusion.\nhttps://www3.weforum.org/docs/WEF_ASEAN_Digital_Generation_Report_2022.pdf.\nSalleh, M. B. (2022, August 05). PDRM: Over RM5.2 billion Lost to Scams in Two Years. The Edge Markets.\nhttps://www.theedgemarkets.com/article/pdrm-over-rm52-billion-lost-scams-two-years.\nWorld Bank Group (2022). The Global 2021 Findex Database: Financial Inclusion, Digital Payments, and\nResilience in the Age of COVID-19. file:///C:/Users/HP/Downloads/9781464818974.pdf.", "created_at": "2026-01-03"}
