{"id": "7ba932e0-5255-4556-96d7-335d4ab72b8b", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 0, "text": "Educational Methodologies of\nPersonal Finance\n\nNational\nFinancial \\g\n\nEducators4*\nCouncil\n\nTable of Contents\nIntroduction 3\nProgram Design & User Experience 8\nUnderstanding the Learner 13\nIntroduction Lesson Segment 18\nWarm-up Activities 20\nReasons for Learning 24\nVisual Education 29\nPreviewing 32\nCase Method 37\nLecture 42\nSkill-building Activities 47\nProject-Based Learning 50\nAssessment 54\nOngoing Education 58\nConclusion 61\n\nIntroduction\nBasic financial literacy lessons are simple. Even through taking just a short course, most\npeople can understand essential personal finance topics and be ‘financially literate.’ But\nfinancial literacy is not enough when it comes to teaching personal finance.\nJust knowing the subject matter does little to improve a person’s financial behaviors and\npotential for a secure future. Helping improve a person’s long-term financial outlook requires\nhelping them adopt positive financial behaviors and systems that support their journey\ntoward financial security\nThe Challenge: Overcoming Pre-existing Habits & Unique Needs\nEvery person you are teaching has different financial habits, emotional connections with\nmoney, and current financial realities – each learner is different, and their unique needs\nshould be considered in the programming.\nFrom an early age, our financial attitudes and habits start to form. Brown University’s research\non chores demonstrates that financial habits tend to form and take firm root by as young as\nage nine (Jackson, 2017).\nUnf", "created_at": "2026-01-03"}
{"id": "3dd54afd-c666-4280-949d-a7e853408644", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 1, "text": "our financial attitudes and habits start to form. Brown University’s research\non chores demonstrates that financial habits tend to form and take firm root by as young as\nage nine (Jackson, 2017).\nUnfortunately, Americans are not developing ideal habits for long-term financial security.\nInstead, an array of data demonstrate the need for learning a different approach to handling\nmoney. For example, 84% are short of retirement savings targets (NFCC, 2019), 48% are poor\nor low-income (U.S. Census Bureau, 2019), 46% do not have $400 saved for an emergency\n(CFPB, 2016), and 72% are experiencing financial stress (American Psychological Association,\n2015\nEducational Methodologies of\nPersonal Finance\n3\n\nHow Outcomes are Measured\nAs mentioned above, every learner is different. Well-constructed programs consider more than\njust content knowledge. Here are four measures that will help maximize program impact:\n• Financial Knowledge. For programs to be truly effective, the educator and educational\nresources should work toward activities that develop higher-order thinking skills and require\nincreased cognitive processing. Pre-, post-, and long-term testing provide ways to measure\ncontent knowledge gains.\n• Financial Sentiment. Financial sentiment indicators measure a person’s feelings/attitudes\ntoward money and level of confidence when making financial decisions. The data will guide\nthe overall program design, educational methodologies, and financial education resources.\n• Financial Behavio", "created_at": "2026-01-03"}
{"id": "29aa77b8-9806-4756-b9ae-5152adf97213", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 2, "text": "toward money and level of confidence when making financial decisions. The data will guide\nthe overall program design, educational methodologies, and financial education resources.\n• Financial Behaviors. A top goal of financial education should be to encourage the adoption\nof positive financial behaviors that help lead participants toward the results they desire.\nBehavioral measures can be quantified through Stages of Change model surveys and\nobservation.\n• Financial Systems. Lesson plans should include activities that encourage participants to\nestablish financial systems. These systems should range from their accounts, to how their\nfinances are managed, to calendar reminders of future activities. The systems can be\nmeasured to demonstrate participant action.\n• Overall Results. The ultimate goal of financial education programming is improvement\nin people’s financial situation. Financial education programs should include systems and\nprocedures to ensure the best results and measure their impact on a person’s finances.\nEducational Methodologies of\nPersonal Finance\n4\n\nTo reach these goals, the program is built around reseinstructional methodologies, including\n• Backwards planning to ensure that lessons and activities build upon each other to\nsupport learner progress toward pre-defined outcomes;\n• Active learning techniques, including visual, social, self-regulated, and project-based\nlearning;\n• Audience adaptation to enable instructors to scaffold and adjust activities to suppor", "created_at": "2026-01-03"}
{"id": "46a93f21-9d8c-478e-ba3e-b4a69e43b21c", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 3, "text": "ed outcomes;\n• Active learning techniques, including visual, social, self-regulated, and project-based\nlearning;\n• Audience adaptation to enable instructors to scaffold and adjust activities to support\nlearners of all different motivations, knowledge levels, and learning styles;\n• Engagement with the affective dimension of learning and motivation in general, and of\nchanging financial behaviors more specifically;\n• Recommendations for system development and long-term follow-up and support to\nencourage permanent change.\nOverarching Benefit: Learn more about insurance options that can protect your finances and\nlivelihood.\nBenefits: Most people are uncertain about what their insurance covers and the coverage\ngaps they may have. By the end of this workshop, you will have identified areas where you\nmay need added protection and a clear plan in place to address those areas.\nEducational Methodologies of\nPersonal Finance\n5\n\nLessons from the NFEC: Research-guided instruction for deep learning and\nlong-term change\nThe NFEC’s curriculum aims to support educators to help students across the age spectrum\nnot only to acquire financial knowledge, but to transform their habits over the long run. As\nsuch, the curriculum incorporates insights from both the pedagogical canon and the body of\nresearch on how people change attitudes and behavior.\nAs a result, the following elements are key components of the NFEC curriculum:\nIntentional Program Design\n“Why are we even doing this?”\n“What’s the point?", "created_at": "2026-01-03"}
{"id": "1a22bbbb-c268-43fe-b74d-70deb9e56b0d", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 4, "text": "on how people change attitudes and behavior.\nAs a result, the following elements are key components of the NFEC curriculum:\nIntentional Program Design\n“Why are we even doing this?”\n“What’s the point?”\nThe curriculum has been designed in a modular format to support a range of learner needs\nand abilities, but each module scaffolds learner progress toward measurable outcomes in\nterms of knowledge, abilities, beliefs, and habits.\nEach lesson supports learner progress in a structured way, flowing from warm-ups that\nactivate prior knowledge and develop learner engagement/motivation, to interactive\nlearning activities that support diverse learning styles, to targeted assessments that help\nboth instructors and students evaluate what has been learned, and what remains murky.\nAudience Adaptation\n“But what I really want to know is...”\n“I can’t learn this way...?”\nLearners vary widely, from their learning styles and motivation levels to their content\nknowledge and financial habits. The NFEC recommends ongoing assessment and adaptation\nalong different dimensions of learning as a critical step. For example, pre-course surveys can\nhelp instructors understand both what users hope to get out of a course, and how students\nlearn best. They can then adapt the material to focus on and connect with high-priority\ntopics, while offering visual, kinesthetic, or social adaptations to common activities.\nEducational Methodologies of\nPersonal Finance\n6\n\nFrom Passive to Active Learning\n“I’m so bored. Are", "created_at": "2026-01-03"}
{"id": "62f11575-d09c-42ee-8ea9-2c7d7090b50b", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 5, "text": "igh-priority\ntopics, while offering visual, kinesthetic, or social adaptations to common activities.\nEducational Methodologies of\nPersonal Finance\n6\n\nFrom Passive to Active Learning\n“I’m so bored. Are we gonna be tested on this?”\n“Just tell me what to do and I’ll do it.”\nMaking long-term behavioral change is exceedingly difficult. The NFEC recommends using\nmetacognition, personal reason development, and self-regulated learning to invest students\nin the process. For example, offering learners choices about lesson focus or how they will\ncomplete certain activities, as well as opportunities to reflect on what is working in their\nlearning – and what they still need to learn – not only boosts engagement, but helps\ninstructors and learners monitor progress.\nMoreover, activities – particularly visual and social learning modes – help learners to actively\nprocess and apply information as they learn it, and project-based learning extends the\neffect of these activities by providing authentic opportunities for learners to put financial\nknowledge into action and solve complex problems in scaffolded ways.\nEngaging the Affective Dimension of Learning and Change\n“I just get so overwhelmed. I feel like giving up.”\n“Shopping makes me feel better!”\nEven more than financial barriers, emotions loom large when trying to change financial\nhabits. For some, this means feeling overwhelmed or not knowing where to start. For others,\nit means spending as a way of managing emotions. Critically, NFEC recom", "created_at": "2026-01-03"}
{"id": "93dcd50d-6587-4452-9a42-10e9af6280f7", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 6, "text": "arge when trying to change financial\nhabits. For some, this means feeling overwhelmed or not knowing where to start. For others,\nit means spending as a way of managing emotions. Critically, NFEC recommends ongoing\nassessment and adaptation along all dimensions of learning, and particularly using sentiment\nsurveys to evaluate how users feel about their learning and to help address the emotional\nroadblocks they may encounter.\nChange for the Long Run\n“I was doing so well, but now . . .”\nAlthough the NFEC aims to boost financial literacy knowledge, the real challenge is to\nhelp Americans develop positive financial habits over the long-term. As a result, we highly\nrecommend setting up systems that can provide long-term social and technical support\nfor learners’ attempts at change. At the same time, developing an understanding of the\ntranstheoretical model can help both learners and instructors develop patience and fortitude\nto move past the inevitable setbacks and relapses in their long-term efforts to instigate\nchange.\nEducational Methodologies of\nPersonal Finance\n7\n\nProgram Design & User Experience\nConsidering the user experience in course design is one of the keys to creating a pleasant,\nproductive experience for learners. Our course program is designed to carry out information\nsmoothly between the student and the instructor, and vice versa. Ideally this process starts\nin advance of the training and continues after the training, through the relationships built\nbetween instructo", "created_at": "2026-01-03"}
{"id": "41b36c1f-561c-4107-b6f9-cf24437dda18", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 7, "text": "othly between the student and the instructor, and vice versa. Ideally this process starts\nin advance of the training and continues after the training, through the relationships built\nbetween instructors and learners as well as between the learners themselves. The techniques\nemployed in the course design place the student at the center of the learning experience,\nin accordance with strategies that are known as High Impact Practices (HIP) by the National\nSurvey of Student Engagement and the Association of American Colleges and Universities.\nThe NFEC’s lesson plans use High Impact Practices in the following ways\n• A curriculum built on backwards design. lessons are built around clearly-defined learning\nobjectives that target students’ content knowledge, sentiment, behaviors, and outcomes.\nAs a result, the activities follow a sequential process to help learners build their\nknowledge and skills and change their attitudes and behaviors.\n• Meaningful engagement. the curriculum is organized around financial events that\nlearners may be experiencing, or can anticipate experiencing. NFEC also recommends\nthat instructors drill down on students’ answers to better understand their motivation,\nand do as much as possible to incorporate students’ individual interests within the\ncontent of the course.\n• Active and applied learning. students will present discussion topics related to the course,\nthus bringing real-life application to what they are learning. As established by the\naffective domain", "created_at": "2026-01-03"}
{"id": "53283801-4c45-411e-bfd3-7ccab53ab198", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 8, "text": "rse.\n• Active and applied learning. students will present discussion topics related to the course,\nthus bringing real-life application to what they are learning. As established by the\naffective domain of learning in Bloom’s Taxonomy, when a learner gives his or her own\nmeaning to the learning experience, the learning becomes more vivid and significant\nto the student.\nEducational Methodologies of\nPersonal Finance\n8\n\nBefore the Program Begins\nTo work toward a positive user experience, take care prior to the start of the education\nsession to set the stage and better understand the audience.\n• Program Design. Program design considers the flow of information and overall program\norganization. It is built around clearly-defined objectives that include students’ content\nknowledge, behaviors, sentiment, and outcome. The educational lessons are selected\nto address financial life events for which participants are preparing, or which they are\ncurrently experiencing.\n• Incorporate Student Interests through Pre-lesson Surveys. Use surveys to directly ask\nstudents what they want to learn and better understand their interests. When your\naudience feels that you’re listening and are there to maximize their time and really\nhelp them, they move into a better state to pick up the information you are sharing. This\npositive regard helps you build relationships with them before the event and lets them\nknow their thoughts are valued.\n• Pre-program Marketing & Communication. Professional communication", "created_at": "2026-01-03"}
{"id": "a4bd1d38-f1a4-479c-90f5-6f5e0a4b229b", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 9, "text": "sharing. This\npositive regard helps you build relationships with them before the event and lets them\nknow their thoughts are valued.\n• Pre-program Marketing & Communication. Professional communication and benefitdriven marketing help encourage interest in the subject. This early communication\nsets the stage for your event and includes program details, participant benefits, and a\ncall to action. Communications may include information about what to expect and preeducation lessons. They provide a way to help the learners feel secure in the program\nand the learning environment.\nEducational Methodologies of\nPersonal Finance\n9\n\nTips for Implementation\nFor teachers who wish to create a learning environment that is more interesting to the\nstudent, learner interest surveys are a simple and efficient tool. According to Edutopia expert\nRebecca Alber, “min[ing] for topics of interest by presenting students with questions, and\nthen look[ing] for any patterns in their responses (around music, for example)” is one of the\nbest ways to cater to their interests and discover new ways to relate their interests to the\ncourse. Decide which of their interests would be best for you to employ in the class.\nFor example, a learner interest survey could include questions such as:\n1) Make a list of the things you want to learn about.\n2) Mention five financial issues that are affecting people your age.\n3) What is one of your most memorable courses? Why?\n4) Describe something you enjoy doing as a hobby or", "created_at": "2026-01-03"}
{"id": "beab3a3b-c4a1-4394-8a51-11d9ee6d9ad8", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 10, "text": "s you want to learn about.\n2) Mention five financial issues that are affecting people your age.\n3) What is one of your most memorable courses? Why?\n4) Describe something you enjoy doing as a hobby or to relax\nYou can have learners fill out the survey using pen and paper, or ask them to fill out a Google\nForm. If you want students to respond quickly, you can make the interest survey a game using\nfree programs like Kahoot (which also is mobile-friendly!).\nIn addition to creating the questions yourself, you can ask the students to bring in questions\nof their own to ask their classmates, or brainstorm together with their peers to gather topics\nthey would like to learn within the course.\nEducational Methodologies of\nPersonal Finance\n10\n\nSources:\nAlber, R. (2017). “Fire up your class with student-interest surveys.” Edutopia, https://www.\nedutopia.org/blog/fire-up-class-student-interest-surveys-rebecca-alber [Accessed 5 Sep\n2018].\nAmerican Psychological Association (2015). American Psychological Association survey\nshows money stress weighing on Americans’ health nationwide. https://www.apa.org/\nnews/press/releases/2015/02/money-stress [Accessed 5 Sep 2018].\nBloom, B.S. (1984). Taxonomy of educational objectives: The classification of educational\ngoals. New York: Longmans Green.\nConsumer Financial Protection Bureau (CFPB) (2016). Financial literacy annual report.\nhttps://s3.amazonaws.com/files.consumerfinance.gov/f/documents/102016_cfpb_\nFinancialLiteracyReport.pdf [Accessed 5 Sep 20", "created_at": "2026-01-03"}
{"id": "4c62c7d9-9af2-4729-85cf-8649fbb32303", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 11, "text": "Financial Protection Bureau (CFPB) (2016). Financial literacy annual report.\nhttps://s3.amazonaws.com/files.consumerfinance.gov/f/documents/102016_cfpb_\nFinancialLiteracyReport.pdf [Accessed 5 Sep 2018].\nDePasquale, J. (2018). “Student interest surveys: Getting to know you.” Scholastic.com,\nhttps://www.scholastic.com/teachers/blog-posts/john-depasquale/2017/StudentInterest-Surveys-Getting-to-Know-You/ [Accessed 5 Sep 2018].\nJackson, R. (2017). Study finds habits in children take root by age 9 – Here’s what that\nmeans for parents. The Huffington Post, https://www.huffingtonpost.com/rebeccajackson/study-finds-habits-in-children-take-root-by-age-9_b_6755276.html [Accessed 5\nSep 2018].\nMcGill (2017). “Program design strategies to promote a healthy learning environment”\n[online]. Teaching and Learning Services (TLS), https://www.mcgill.ca/tls/teaching/\nprogram-design/healthy-program-design [Accessed 5 Sep 2018].\nNFCC (2019). 2019 Consumer Financial Literacy Survey. https://www.nfcc.org/2019consumer-financial-literacy-survey/ [Accessed 6 Aug 2019].\nU.S. Census Bureau (2018). Income and poverty in the United States: 2017. Washington,\nDC: U.S. Census Bureau. https://www.census.gov/library/publications/2018/demo/p60263.html [Accessed 6 Aug 2019].\nEducational Methodologies of\nPersonal Finance\n11\n\nUnderstanding the Learner\nUnderstanding the learner is essential to ensure success in education, because each learner has\nindividual needs and challenges that will affect their ability to lea", "created_at": "2026-01-03"}
{"id": "c2cbb390-3196-4160-bd24-fb43498c69bf", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 12, "text": "ance\n11\n\nUnderstanding the Learner\nUnderstanding the learner is essential to ensure success in education, because each learner has\nindividual needs and challenges that will affect their ability to learn and apply knowledge. In\norder to guarantee success, it is important to acknowledge these needs through intentionally\ndesigned instruction that accommodates student variables, including both knowledge and\nemotional state.\nAn educator who has a good understanding of the learner will practice a strategy called\n“scaffolding” in order to meet content-based needs by gradually moving students from\ninstructor-led practice to independent implementation of a concept or skill. Scaffolding is\ndefined as an educational practice in which the instructor identifies what a learner currently\ncan do, selects an issue outside their skill level, then provides guided instruction to help\nthe student reach that new skill level (Pinantoan, 2013; Vygotsky, 1978). Although it may\ntake more time to plan instruction that responds to students’ varying skill levels, scaffolding\nis extremely beneficial to learners, as they are more likely to acquire the desired skill or\nknowledge; is ultimately more efficient to implement; and increases learner motivation and\nengagement (Pinantoan, 2013).\nInformed educators also practice sentiment analysis in order to get insight into a learner’s\nfeelings or opinions toward the content and instruction, enabling the educator to more\neffectively respond to individual needs. Se", "created_at": "2026-01-03"}
{"id": "56cde9f5-e843-489c-bfbf-ea4019e8e3c3", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 13, "text": "practice sentiment analysis in order to get insight into a learner’s\nfeelings or opinions toward the content and instruction, enabling the educator to more\neffectively respond to individual needs. Sentiment is an expression of how a person feels\nabout a situation, event, or person. Sentiment analysis studies a person’s communications to\ndetermine their tonality – that is, whether the feelings being expressed are positive, negative,\nor neutral (Redmore, 2017). When teaching a financial literacy lesson or workshop, asking\nstudents to tell you how they feel about a topic – either orally or in writing – can help you\ntarget the problems that need the most immediate attention (Grossmann, n.d.), or adjust how\nyou present material to make it more interesting, accessible, or simply less daunting.\nSentiment analysis in written form allows the educator to collect and analyze data for\nlearners, and sometimes enables participants to be more forthcoming. Asking students to\nshare their feelings about a topic out loud, on the other hand, can build community and\nmake participants feel less alone. Either way, the educator can be much more successful in\ndetermining and increasing learner motivation.\nFinally, an educator can use the Transtheoretical Model of Behavior Change (aka Stages of\nChange Model; prochange.com, 2015) to determine a learner’s progress toward effecting\ntheir own changes and subsequently come up with a plan appropriate to their developmental\nlevel to maximize that change. Re", "created_at": "2026-01-03"}
{"id": "dba0ea4f-ad9d-4095-a75c-e75a58290cfe", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 14, "text": "del; prochange.com, 2015) to determine a learner’s progress toward effecting\ntheir own changes and subsequently come up with a plan appropriate to their developmental\nlevel to maximize that change. Researchers Prochaska, Diclemente, and Norcross created\nthe Transtheoretical Model to establish the process from thinking about, to permanently\nimplementing behavioral change. They posited that change can be categorized into five\nStages of Change: precontemplation (not ready), contemplation (getting ready), preparation\n(ready), action, and maintenance. The process of effecting complete change is often complex,\nas those in process of making a change will often fluctuate between levels when they\nexperience setbacks.\nEducational Methodologies of\nPersonal Finance\n12\n\nFor educators, the transtheoretical model points to:\n• The need to keep education light, especially for those who are not yet ready to change\n(i.e. the precontemplation stage). Focus on benefits, give them freedom to explore, and\nallow them to stray off course if they desire. Remember the goal we have for people at\nthis stage is to push them up to the preparation stage.\n• Scaffolding helps learners at all stages, but particularly learners at the earlier stages of\nchange. Give them smaller, easily achievable activities where they actually work on their\nfinances (i.e. start on their budget by entering in the income, then enter in housing, etc.).\nThese little successes produce momentum, which can help encourage further action", "created_at": "2026-01-03"}
{"id": "f7775bbb-a264-4251-bc22-5f72db9c0e4d", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 15, "text": "ey actually work on their\nfinances (i.e. start on their budget by entering in the income, then enter in housing, etc.).\nThese little successes produce momentum, which can help encourage further action.\n• Even people with highly-developed skills (maintenance level) can backslide. Once\npeople arrive at the maintenance stage, we shift the conversation toward additional\nplanning and preparation for life events that can have impact on their finances. We\nview this stage as an excellent opportunity to help them mentally prepare for potential\nfinancial disasters and more advanced planning.\n• Your primary task is to provide learners with tools to facilitate the changes they have\ndecided to undertake. In conjunction with scaffolding methods, intentionally setting\ngoals is one of the most essential tools for promoting self-efficacy to achieve change\n(Shockey & Seiling, 2004).\nEducational Methodologies of\nPersonal Finance\n13\n\nTips for Implementation\nImplementing the above practices effectively requires intentional design and planning. If\ndone properly, the time spent in the planning phase of instruction will help ensure that\nsubsequent teaching is both more efficient and more effective. Each practice is intrinsically\nrelated to the other two. To begin, programs and instructors can assess learners in the\nfollowing ways:\n• Use pre-testing to measure content knowledge. When instructors know more about\nthe students’ cognitive abilities and current topic knowledge, they can ensure suitable\nsc", "created_at": "2026-01-03"}
{"id": "b1cdf234-e591-49c0-b24b-dc77c480afc2", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 16, "text": "rners in the\nfollowing ways:\n• Use pre-testing to measure content knowledge. When instructors know more about\nthe students’ cognitive abilities and current topic knowledge, they can ensure suitable\nscaffolding and identify areas on which to focus.\n• Sentiment Survey. This survey measures a person’s feelings and attitudes toward money,\nlevel of confidence when making financial decisions, and hope for the future. The\npurpose of the survey is to help people understand their relationships with money and\nemotions around handling their personal finances. It gives the educator valuable cues\nabout how best to communicate with the students. When using sentiment analysis:\n› Pay attention to written communication from the learners, or implement periodic surveys\nor other modes of feedback to pinpoint the learner’s feelings on the instruction or subject\nmatter (Grossmann, n.d.).\n› Be aware that an individual learner may not be fully honest on a survey or may\nmiscommunicate a feeling. Focus instead on the information as a whole, looking for\ntrends and patterns among all learners (Grossmann, n.d.).\n› Use the information you gather to intentionally target and resolve learners’ concerns and\nstruggles. However, be wary of singling out any individual learner (Grossmann, n.d.).\n• Current Situation Survey. This survey measures a person’s assessment of his or her\nfinancial situation. Participants answer questions regarding their income, credit,\nsavings rate, loans and debt obligations, savings, an", "created_at": "2026-01-03"}
{"id": "c91bf2f8-7478-4e66-b3b0-7505e4f7ca96", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 17, "text": "urvey. This survey measures a person’s assessment of his or her\nfinancial situation. Participants answer questions regarding their income, credit,\nsavings rate, loans and debt obligations, savings, and investments. The goal is to better\nunderstand the participants’ current financial situations to best prescribe educational\nsolutions. When delivering this survey in group settings, you will receive a variety of\nanswers; but you will often find commonalities that you can use to group participants.\n• Financial Behaviors Survey. This survey helps learners identify their personal financial\nbehaviors. After completion, they diagnose the results and identify positive financial\nbehaviors (actions that help them work toward personal goals) and negative financial\nbehaviors (those that take them away from their goals).\nEducational Methodologies of\nPersonal Finance\n14\n\nThe NFEC includes all these measures in its training to help you understand the learners’\nunique situations and needs. Once you have determined the learners’ current capabilities,\nyou can determine what you want them to achieve with scaffolding (e.g. help from you or a\nmore skilled partner; Pinantoan, 2013). For example:\n• One way to scaffold learning is by modeling an expert version of the task (Pinantoan,\n2013; Zhao & Orey, 1999). For example, instructors may want to show students their\nown financial plans before helping students develop their budgets.\n• You can also break the task into bite-sized, accomplishable tasks. P", "created_at": "2026-01-03"}
{"id": "fcb98fd4-ac88-4b2e-88aa-af7322adb5fc", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 18, "text": "999). For example, instructors may want to show students their\nown financial plans before helping students develop their budgets.\n• You can also break the task into bite-sized, accomplishable tasks. Provide as much help\nas learners need to prevent them from becoming discouraged, but try to get them to do\nas much as they can on their own (or with peers) to promote their own skill development\nand confidence (Pinantoan, 2013).\nEducational Methodologies of\nPersonal Finance\n15\n\nSources:\nGrossman, C. (n.d.). “Sentiment analysis to help your internal communications.” Beekeeper\nBlog. https://blog.beekeeper.io/how-sentiment-analysis-can-help-your-internalcommunication-strategy/ [Accessed 8 Aug 2019].\nNoar, S.M., Benac, C.N., & Harris, M.S. (2007). Does tailoring matter? Meta-analytic review\nof tailored print health behavior change interventions. Psychological Bulletin, 4, 673-693.\nPinantoan, A. (2013). “Instructional scaffolding: A definitive guide.” InformED, https://www.\nopencolleges.edu.au/informed/teacher-resources/scaffolding-in-education-a-definitiveguide/ [Accessed 5 Sep 2018].\nProchange.com (2015). Transtheoretical Model (or Stages of Change). Prochange.com.\nhttps://www.prochange.com/transtheoretical-model-of-behavior-change [Accessed 10\nMar 2017].\nRedmore, S. (2017). “Using sentiment analysis to dig deeper into written communication.”\nQuirk’s Media. https://www.quirks.com/articles/using-sentiment-analysis-to-dig-deeperinto-written-communication [Accessed 6 Aug 2019].\nShockey,", "created_at": "2026-01-03"}
{"id": "64ba5d2b-635e-4855-8003-1c9433155ffe", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 19, "text": "ment analysis to dig deeper into written communication.”\nQuirk’s Media. https://www.quirks.com/articles/using-sentiment-analysis-to-dig-deeperinto-written-communication [Accessed 6 Aug 2019].\nShockey, S. S., & Seiling, S. B. (2004). Moving into action: Application of the Transtheoretical\nModel of Behavior Change to financial education. Association for Financial Counseling\nand Planning Education. Financial Counseling and Planning, 15(1), 41-52.\nVygotsky, L.S. (1978). Mind in society. Cambridge, MA: Harvard University Press.\nZhao, R., & Orey, M. (1999). “The scaffolding process: Concepts, features, and empirical\nstudies.” Unpublished manuscript, University of Georgia.\nEducational Methodologies of\nPersonal Finance\n16\n\nIntroduction Lesson Segment\nThe introductory segment to any lesson is used to help students understand how a subject\nrelates to their lives, build interest in the program, preview the upcoming lesson, and engage\nyour learners. This is a time for the instructor to establish initial rapport and gain better\nunderstanding of the audience’s needs. During the introduction, the educator’s focus should\nbe on the accomplishment of these goals:\n• Build rapport. Provides the educator opportunity to connect with participants and build\nrapport.\n• Gain a better understanding of students. Discussions centered around the participants’\nfeedback will help the educator understand their needs.\n• Provide an overview. Preview the upcoming lessons so students know the direction of\nthe co", "created_at": "2026-01-03"}
{"id": "369d1095-0a42-403e-9a44-4c5af9ae7c4b", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 20, "text": "ents. Discussions centered around the participants’\nfeedback will help the educator understand their needs.\n• Provide an overview. Preview the upcoming lessons so students know the direction of\nthe course. Ask Essential Questions. Include the essential questions – problems to be\nanswered – to help students develop a framework for understanding the overall big\npicture of the lesson.\n• Build interest and engagement. Build excitement and interest in the program and\ndifferentiate the subject matter from other trainings the participants have gone through.\n• Cite personal relevance and reasons. Help students understand the personal benefits and\nreasons for learning about this topic, and the areas of life on which it has impact\n• Activate prior knowledge. Look for ways to actively integrate students’ prior knowledge in\nall activities, creating lasting learning connections.\n• Strengthen understanding. Through asking questions, getting feedback, and observations,\nthe educator can better understand the audience and adjust the presentation to meet\ntheir needs.\n• Simplify. Help the learners gain confidence in their ability to learn the materials by\nsimplifying the lessons taught.\n• Connect with various learning styles. Engaging with various learning styles gives both\nthe learner and educator flexibility in class. Demonstrate to participants that they have\nsome freedom to learn in ways that appeal to them.\nThe NFEC integrates all these aspects into its curriculum. Be sure to modify the in", "created_at": "2026-01-03"}
{"id": "bbc5a993-4f76-4ed0-8b6b-6c7d0a9d633a", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 21, "text": "flexibility in class. Demonstrate to participants that they have\nsome freedom to learn in ways that appeal to them.\nThe NFEC integrates all these aspects into its curriculum. Be sure to modify the introductory\npresentation to reflect your personality. Consider adding a personal anecdote that can help\nyou connect with your audience. Have questions ready and be prepared to ask follow-up\nquestions to the students’ responses to deepen your understanding of their true motivations\nfor learning about money.\nEducational Methodologies of\nPersonal Finance\n17\n\nSources:\nBransford, J.D. Brown, A.L., & Cocking, R.R. [Eds.] (2000). How people learn: Brain, mind,\nexperience, and school. Expanded Edition. Washington, DC: National Academies Press.\nCenter for Instructional Development & Distance Education (2014). “The lecture method.”\nUniversity of Pittsburgh. http://www.cidde.pitt.edu/teaching/lecture-method [Accessed 6\nAug 2019].\nBrigham Young University (n.d.). “Lesson planning: Introduction & presentation.” BYU.\nlinguistics.byu.edu/faculty/henrichsenl/LessonPlanning/lp_12.html [Accessed 6 Aug\n2019].\nWashington University in St. Louis (n.d.) “Teaching with lectures.” The Teaching Center.\nteachingcenter.wustl.edu/resources/teaching-methods/lectures/teaching-with-lectures/\n[Accessed 6 Aug 2019].\nEducational Methodologies of\nPersonal Finance\n18\n\nWarm-up Activities\nWarm-up activities represent one important aspect of introducing a lesson. The warm-up\nactivities NFEC uses focus on using visual a", "created_at": "2026-01-03"}
{"id": "d1aaf42f-5eca-43dc-b818-ae4cbb9eeb56", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 22, "text": "Educational Methodologies of\nPersonal Finance\n18\n\nWarm-up Activities\nWarm-up activities represent one important aspect of introducing a lesson. The warm-up\nactivities NFEC uses focus on using visual and auditory cues to present essential questions,\nactivate prior knowledge, and support metacognition.\nAn essential question is a big question that the lesson will answer. Integrating essential\nquestions into a warm-up activity provides students with a roadmap for understanding\nthe lessons and applying them to real-world action (Essential Questions Handbook). When\nstudents know the question(s) a lesson will answer, they comprehend the focus and where the\nlesson is going. Essential questions also encourage more meaningful discussion as students\ntry to work out answers to essential questions (Faculty Focus, 2017).\nAs students think about the essential questions, they can be encouraged to draw on prior\nknowledge. Research shows that constructing learning based on previously-acquired\nknowledge improves the learning experience (Shelley, Bridwell, et al) because it enables\npeople to tap into their motivation to learn the subject matter and because they can attach\nnew concepts to prior “schemata,” resulting in better long-term retention. For example,\nresearchers have found that when students talk about what they already know, it encourages\nstruggling or disinterested students to engage in the learning process because they feel that\nthey have something to contribute.\nIn addition to activa", "created_at": "2026-01-03"}
{"id": "f1714957-92ca-465f-b9f9-2ffaa8cdb7ed", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 23, "text": "talk about what they already know, it encourages\nstruggling or disinterested students to engage in the learning process because they feel that\nthey have something to contribute.\nIn addition to activating prior knowledge and drawing on multiple learning styles, the\nwarm-up period can be strengthened even further through metacognitive questioning and\nreflection. By metacognition, educators mean the processes through which learners assess\ntheir own abilities and the strengths and weaknesses of particular strategies.\nMetacognition has two distinct benefits to the learner:\n1. It allows the learner to regulate his or her own learning (Piper 1992) and behavior.\nSelf-regulation encourages the learner to seek out knowledge and look for information\nthey are missing.\n2. It also allows the learn to compensate for any struggles in acquiring information (Piper\n1992). While the learner had decided what knowledge they need, they are better able\nto develop strategies to acquire knowledge. This is especially important for students\nwho struggle with material in any way.\nAccording to Piper (1992), the use of metacognition in a warm-up increases the learner’s\nunderstanding of his or her own existing skills and information and what they need to do to\nincrease their level of knowledge or understanding.\nEducational Methodologies of\nPersonal Finance\n19\n\nTips for Implementation\nEach lesson begins with a warm-up activity. These activities focus employ various strategies:\nasking essential questions, KW", "created_at": "2026-01-03"}
{"id": "bf9fb7a2-52db-4c67-93dc-690157a9f9e8", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 24, "text": ".\nEducational Methodologies of\nPersonal Finance\n19\n\nTips for Implementation\nEach lesson begins with a warm-up activity. These activities focus employ various strategies:\nasking essential questions, KWR, VIQQS, and metacognition. Extension lesson options are\nprovided to leverage tactile learning opportunities and to gain a better understanding of\nstudents.\nThe most important element of essential questions is that they center around the “big picture”\nof any lesson. For example:\n• How can I save money if I don’t make enough?\n• How much do I need to save for retirement, and how can I start?\n• Is it better to buy or rent a home?\n• How can I improve my credit rating, and how will that help me?\nAs you implement the essential questions in the warm-up, consider the following:\n• Focus on the fundamental concepts that extend to all elements of the lesson. What do\nyou want students to take away from the learning?\n• Focus on ideas that will stick with students and provide value to their lives.\n• Make sure the essential questions relate to the real world and are transferable to a\nvariety of situations\nEducational Methodologies of\nPersonal Finance\n20\n\nThe teacher can come up with the essential question of a lesson, or students can come up\nwith the questions based on one of the following activities.\nKWR Chart. The KWR strategy has been modified from a research-based methodology,\nthe KWL Chart, in which students list what they already know, what they want to know,\nand what they have learned.", "created_at": "2026-01-03"}
{"id": "06889161-9096-43ab-907b-3588f17810d5", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 25, "text": "ies.\nKWR Chart. The KWR strategy has been modified from a research-based methodology,\nthe KWL Chart, in which students list what they already know, what they want to know,\nand what they have learned. The NFEC substituted ‘how it relates to my life’ for ‘what I\nlearned’ because it’s important for learners to understand their personal relationships\nwith money early in the instruction. The lesson plans have the participants complete\nactivities and reflect on what they learned later in the training.\nVIQQS Activity. The NFEC developed the VIQQS activity to support students with various\nlearning styles and to provide freedom to activate existing knowledge in ways that work\nfor each student. The VIQQS acronym stands for Video, Image, Quote, Questions, Sounds.\nLearners are given these different cues and instructed to free-write, reflect, or participate\nin a variety of group activities to activate prior knowledge and lay the foundation to\nconnect with new information. The VIQQS method uses visual, auditory, reading, and\nkinesthetic learning styles to continue the activation of prior knowledge used in the\nKWR strategy.\nStudents also can activate their prior knowledge on a topic through metacognitive questions\nsuch as:\n• How well did I manage my money this month/year, and why?\n• When I made a budget, what helped me stay on track? What threw me off?\n• When I feel frustrated/down/depressed, how does it affect my spending? How does\nfeeling happy/excited affect my spending?\nImplementing war", "created_at": "2026-01-03"}
{"id": "cbf60aa7-a232-41b4-b957-b690a1a13099", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 26, "text": "a budget, what helped me stay on track? What threw me off?\n• When I feel frustrated/down/depressed, how does it affect my spending? How does\nfeeling happy/excited affect my spending?\nImplementing warm-up activities requires preparation. When designing your warm-up\nactivities, you will need to gather materials, pre-assess student knowledge (where possible),\nand identify what you want students to learn in the lesson.\nEducational Methodologies of\nPersonal Finance\n21\n\nSources:\nGardner, H. (1983). Frames of mind: The Theory of Multiple Intelligences. New York: Basic\nBooks.\nMcConnell, Carolyn (2011). The essential questions handbook. New York: Scholastic\nTeacher Resources.\nSchrock, J., & Benko, S. (2015). “Using fundamental concepts and essential questions to\npromote critical thinking.” Faculty Focus. www.facultyfocus.com/articles/course-designideas/using-fundamental-concepts-essential-questions-promote-critical-thinking/\n[Accessed 6 Aug 2019].\nTecweb.org (n.d.). “Gardner’s Multiple Intelligences.” History of Telecourses. www.tecweb.\norg/styles/gardner.html [Accessed 6 Aug 2019].\nTileston, D.W. (2011). 10 best teaching practices: How brain research and learning styles\ndefine teaching competencies. New York: Sage.\nWilhelm, J.D. (n.d.) “Essential questions.” Scholastic Publishers. www.scholastic.com/\nteachers/articles/teaching-content/essential-questions/ [Accessed 6 Aug 2019].\nWillingham, D.T. (n.d.) “Ask the cognitive scientist.” American Federation of Teachers. www.\naft.org/ae/su", "created_at": "2026-01-03"}
{"id": "620b2cb1-d566-4d27-9e08-2cb964638080", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 27, "text": "cholastic.com/\nteachers/articles/teaching-content/essential-questions/ [Accessed 6 Aug 2019].\nWillingham, D.T. (n.d.) “Ask the cognitive scientist.” American Federation of Teachers. www.\naft.org/ae/summer2005/willingham [Accessed 11 Mar 2015].\nEducational Methodologies of\nPersonal Finance\n22\n\nReasons for Learning\nIn addition to students understanding what they will learn in a lesson, they must understand\nwhy it’s important to learn it. Identifying the purpose of each lesson provides both teacher\nand student with many benefits. Reasons for learning, often called learning objectives,\n“establish a direction to guide learning” (Dean et al., 2012). Establishing reasons for learning\nprior to designing an instructional strategy creates a roadmap for all content that you will\npresent in a lesson. According to the University of Aberdeen, stating the reasons to learn a\nlesson helps the instructor design all aspects of the course in a way that supports those\nreasons – from the content itself to how the content is delivered. Any interactive activities\nstem from those reasons for learning. The reasons for learning also determine the resources\nneeded and guide the creation of assessment activities because when you, as an instructor,\nknow what you want students to take away from a lesson, those takeaways determine what\nyou should assess.\nBesides guiding the teacher, reasons for learning also help guide and motivate the students.\nStating reasons for each lesson clarifies to learners what the", "created_at": "2026-01-03"}
{"id": "dfb95360-022d-478c-a791-10ed0550c537", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 28, "text": "takeaways determine what\nyou should assess.\nBesides guiding the teacher, reasons for learning also help guide and motivate the students.\nStating reasons for each lesson clarifies to learners what they should expect to learn, and\nhow the learning may help them in their personal, academic, or financial lives.\nIn the same way, encouraging students to determine their own reasons for learning can also\nhelp them develop their own direction and guide their own learning. Researchers have found\nthat when students participate in developing their own reasons for learning, they develop\na better sense of control over their learning process (Dean et al., 2012). They also develop\nself-regulatory skills that determine how well they grasp new concepts.\nWhen students develop reasons for wanting to learn each objective, their personal motivation\nand engagement in the lesson increase. In turn, engagement and motivation is particularly\nimportant for effecting real behavior change. After all, learners must have strong reasons and\nmotivation in order to resist giving in to old habits when temptations arise.\nEducational Methodologies of\nPersonal Finance\n23\n\nDefining reasons for learning is an important element of the experiential learning model\ncreated by David Kolb (Kolb, 1984). Kolb’s theory largely relies on the idea that meaning must\nbe made from all learning experiences in order for students to assimilate new information\ninto their existing knowledge. Consider the following stages of experient", "created_at": "2026-01-03"}
{"id": "e2e5cfdb-f9ac-49c0-8dd2-5571f95b9209", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 29, "text": "relies on the idea that meaning must\nbe made from all learning experiences in order for students to assimilate new information\ninto their existing knowledge. Consider the following stages of experiential learning as\ndefined by Kolb:\n1. The learner must be a willing participant in the learning\n2. The learner must reflect on his or her learning experience\n3. The learner must be able to conceptualize the experience\n4. The learner must have problem-solving skills to apply the new information to life\n(McLeod, 1970)\nWhen students develop reasons for learning, they actively participate in their own learning\nprocess. In order to write or discuss their reasons for learning about a particular topic, students\nmust reflect on what knowledge they need, how they want to acquire that knowledge, and\nwhy it could be important in their lives. As a result, students are more likely to retain the\ninformation over the long run. Moreover, hearing or reading about students’ reasons for\nlearning also helps instructors more fully understand the students, enabling them to further\nadapt and customize the learning to students’ needs and desires.\nEducational Methodologies of\nPersonal Finance\n24\n\nTips for Implementation\nStart with your own reasons. When developing your own reasons for teaching a particular\nlesson, consider the following questions:\n• What is the focus of the lesson you are about to deliver?\n• What is the final outcome of the lesson? That is, what do you want your students to take\naway from", "created_at": "2026-01-03"}
{"id": "63a76f68-82fd-4f36-a360-e8116747c0f1", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 30, "text": "son, consider the following questions:\n• What is the focus of the lesson you are about to deliver?\n• What is the final outcome of the lesson? That is, what do you want your students to take\naway from the instruction?\n• What are the components of the lesson?\n• How do you use content from the lesson in your own life?\n• What elements in the lesson do you think will benefit your audience the most?\nCommunicate your reasons to students. When you explain the reasons to learners, think about\nthe following:\n• Be sufficiently precise. You don’t want reasons that are too broad (i.e. this will help you\nfinancially) or too narrow (i.e. this will help you save for the birth of your first child if you\nhave the child before you turn 30) (Dean et al., 2012).\n• Communicate the reasons clearly. Make sure students understand the reasons before\nthe lesson begins. This step will allow them to take ownership of the learning and\nunderstand how all elements of the lesson relate back to the stated reasons (Dean et\nal., 2012).\n• Provide Opportunity to Reason. Provide students with opportunities and structures to\ncome up with their own reasons. To engage students in actively exploring their reasons\nfor learning, NFEC recommends the following two activities:\n• Learner-developed Reasons. The goal of this activity is to get students to connect\nthe lesson to personal reasons for why they want to learn. Ask students to reflect –\neither in writing or discussion – about how the subject matter will affect their", "created_at": "2026-01-03"}
{"id": "35502e0f-78fc-4d83-817f-1dfe4e771536", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 31, "text": "vity is to get students to connect\nthe lesson to personal reasons for why they want to learn. Ask students to reflect –\neither in writing or discussion – about how the subject matter will affect their lives.\nInvite students to explore a range of goals, including: Lifestyle goals (life experiences),\nrelationships (family, friends, significant other), primal needs (security, shelter, survival),\nstatus (comparison with peers, fun, splurges), and emotional state (confidence, hope,\nstress). Lesson expansions allow students to explore high-contrast examples of\nsuccessful outcomes versus consequences (pain vs. pleasure) and how the subject can\naffect their lives.\n• Imagery Activities. To deepen the reasons for learning the subject matter, imagery activities\nand guided visualizations help students create a mental picture of the potential results of\ntheir learning and actions. For example, students who are planning a budget can be invited\nto imagine the particular consequences of sticking to that budget – or not sticking to it. This\ntype of image-driven activity enables students to break through their reptilian brain filters –\nas described by neuroscientist Paul MacLean (MacLean, 1990) – because they get participants\nto feel the pain and pleasure of potential outcomes on a visceral, emotional level.\nEducational Methodologies of\nPersonal Finance\n25\n\nTo successfully implement the activities, the educator should:\n• Provide students with a framework for writing or saying their reasons for", "created_at": "2026-01-03"}
{"id": "bde5a654-9f84-4313-a3eb-84fb67083333", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 32, "text": "onal level.\nEducational Methodologies of\nPersonal Finance\n25\n\nTo successfully implement the activities, the educator should:\n• Provide students with a framework for writing or saying their reasons for wanting to learn\nabout a certain topic. This framework can be presented in the form of a sentence stem\nor as keywords. You can also use the KWR strategy to ensure that students understand\nwhat they already know and what information they lack about a topic. While identifying\nthe W (what they want to know), they will discover their reasons for wanting to learn\nabout the topic.\n• Give students freedom. Allow them to develop their own reasons and connections to how\nthe topic you are teaching affects their lives on a personal level.\n• Use vivid imagery. To impart the most benefit, use descriptive language that helps\nstudents imagine the situation.\n• Align imagery with audience. Ensure that you deliver guided visualizations to which the\nlearners can relate. For example, young people may relate to wanting to buy things like\nsneakers or a new phone, or even saving for college; whereas adults might be more\nmotivated by paying mortgage/rent and saving for retirement.\n• Utilize props. Bring in visuals or other props to deepen the imagery and add entertainment\nvalue to the activity.\n• Have learners consider different goals. Have students consider all the areas where the\ntopic you are teaching affects their lives: lifestyle, relationships, emotional state, etc.\n• Invite learners to share the", "created_at": "2026-01-03"}
{"id": "0dc9ac98-6f38-4a32-a003-8bc55f4416b2", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 33, "text": "ners consider different goals. Have students consider all the areas where the\ntopic you are teaching affects their lives: lifestyle, relationships, emotional state, etc.\n• Invite learners to share their reasons with the group. Provide opportunity for learners\nto become inspired by new reasons to engage with the material, and for you as an\ninstructor to make sure the reasons are realistic and fall in line with the lesson content\n(Dean et al., 2012).\n• Respect learners’ privacy. These discussions may touch on personal issues, particularly\nif the reasons reveal an aspect of learners’ finances about which they feel ashamed.\nTherefore it’s important to respect students’ privacy: encourage sharing, but do not call\non anyone who does not volunteer.\nThe NFEC’s lesson plans integrate all these activities and extensions into the curriculum.\nThere are a variety of imagery activities, so be sure to select the ones that best fit your\naudience’s situation and modify them as your understanding of their reasoning increases\nEducational Methodologies of\nPersonal Finance\n26\n\nSources:\nDean, C.B., Hubbell, E.R., Pitler, H., & Stone, B.J. (2012). Classroom instruction that works:\nResearch-based strategies for increasing student achievement. Alexandria, VA: ASCD.\nEverette, M. (2017). The hidden power of learning objectives. Scholastic.com. https://\nwww.scholastic.com/teachers/blog-posts/meghan-everette/17-18/The-Hidden-Powerof-Learning-Objectives/ [Accessed 7 Aug 2019].\nKolb, D.A. (1984). Experient", "created_at": "2026-01-03"}
{"id": "0c5647bb-507a-42a0-a225-eab80fec11ee", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 34, "text": "f learning objectives. Scholastic.com. https://\nwww.scholastic.com/teachers/blog-posts/meghan-everette/17-18/The-Hidden-Powerof-Learning-Objectives/ [Accessed 7 Aug 2019].\nKolb, D.A. (1984). Experiential learning: Experience as the source of learning and\ndevelopment. Upper Saddle River, NJ: Prentice Hall.\nMacLean, P.D. (1990). The triune brain: Role in paleocerebral functions. New York: Springer.\nMcLeod, Saul (2017). Kolb’s learning styles and experiential learning cycle. Simply\nPsychology. www.simplypsychology.org/learning-kolb.html [Accessed 7 Aug 2019].\nUniversity of Aberdeen, “Guidance on aims and objectives for teaching and learning.”\nwww.abdn.ac.uk/admin/aimsobs.shtml [Accessed 7 Aug 2019].\nEducational Methodologies of\nPersonal Finance\n27\n\nVisual Education\nWhether you’re previewing a lesson or getting into the details, visualization is one of the best\ntools for learning and long-term retention. Human brains are wired to rapidly process and\nremember visual input (Ebner & Bruff, 2010). Providing a variety of visual learning resources\ncan help an instructor incorporate key topics and themes to engage students in the lesson\nand help them grasp key concepts quickly.\nThe power of visual learning has been well-documented. First, incorporating visuals supports\nspeed, accuracy, and retention. Researchers at MIT have found that the human brain can\nprocess entire images in as little as 13 milliseconds (Trafton, 2014).\nDr. Haig Kouyoumdjian’s work states that the brain is largely a", "created_at": "2026-01-03"}
{"id": "53db9dc2-18be-4d2c-9672-ed854ba258eb", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 35, "text": "retention. Researchers at MIT have found that the human brain can\nprocess entire images in as little as 13 milliseconds (Trafton, 2014).\nDr. Haig Kouyoumdjian’s work states that the brain is largely a visual processor; only a\nsmall portion of the brain processes words. As a result, the brain remembers visual images\nbetter than it remembers words. If you use images to introduce lessons and topics, students\nare more likely to remember the images throughout the lesson and across the long-term\n(Kouyoumdjian, 2012).\nUsing images while presenting the “big picture” of a lesson also incorporates Richard Mayer’s\nCognitive Theory of Multimedia Layering (Learning Theories.com, 2016). The crux of Mayer’s\ntheory is that humans learn better when both images and words are present. Mayer notes\nthat our brains do not receive input via images and text separately. Instead, both types\nof information are processed by the brain as a single entity. Together they are coded in a\ndifferent place in the brain than either images or words would be separately, supporting\nlong-term retention.\nVisualizations such as diagrams, charts, and infographics can also help students break down\nand understand complex information. That’s why well-designed visual images can yield\na much more powerful and memorable learning experience than mere verbal or textual\ndescriptions (Ebner & Bruff, 2010).\nMoreover, Shabiralyani et al. have found that the use of visual resources not only helped\nstudents retain information, but al", "created_at": "2026-01-03"}
{"id": "137f6f52-d2a0-4c02-bde6-14e56614c111", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 36, "text": "experience than mere verbal or textual\ndescriptions (Ebner & Bruff, 2010).\nMoreover, Shabiralyani et al. have found that the use of visual resources not only helped\nstudents retain information, but also increased motivation and attentiveness to information\nand lessons (Shabiralyani et al., 2015). According to a study published in the American Journal\nof Pharmaceutical Education, integrating images into the classroom can appeal to a wider\nrange of learning styles. That is, while any group of students may have a variety of learning\nstyles, imagery appeals to different types of learners. Visual aids also create a positive\nlearning environment for students, one significantly more interesting than environments\nthat rely upon teacher instruction alone (Shabiralyani et al., 2015). That is why the NFEC\nparticularly recommends that instructors use visuals in their warm-up activities, to engage\nlearners visually and emotionally and to set the stage for learning.\nEducational Methodologies of\nPersonal Finance\n28\n\nTips for Implementation\nThe NFEC’s curriculum utilizes visual education as a means of instruction. With over 200\nvisual education components, the lesson plans are designed to provide a robust visual\nlearning experience with two unique purposes: 1) to provide visual cues to deeply engage\nthe learner; 2) to provide visual cues and organization to help students better understand\nthe information.\n• Big picture discussion visuals. Using visuals during the “big picture” discussion hel", "created_at": "2026-01-03"}
{"id": "5652546b-76ac-4388-bfdb-ab7444bd7639", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 37, "text": "gage\nthe learner; 2) to provide visual cues and organization to help students better understand\nthe information.\n• Big picture discussion visuals. Using visuals during the “big picture” discussion helps\nlearners relate various personal finance topics and their overall financial health to\nmultiple areas of their own lives. For example, a cartoon of a person buying a candy bar\nin the checkout aisle of a grocery store can spark a discussion about impulse spending\nin a way that a dry verbal introduction would not. Visual education works in much the\nsame fashion as previewing by helping students develop neuropathways in advance of\nmore detailed skill-building activities.\n• Topic-based visuals. These visual components are presented early in the lesson plans to\nillustrate key points and help simplify the lesson for learners. Visuals such as graphic\norganizers or infographics about investments or debt can help learners absorb critical\nmoney management lessons more easily.\nIntegrating visuals requires preparation. Instructors should have an idea of the lesson theme\nand intended outcomes prior to the lesson. When using visual education elements, consider\nthe following:\n• When should you use visual elements? Images are nice, but avoid using them if they are\nnot the best way to explain information (Willingham, n.d.). Instead, use visual elements\nwhen they boost engagement, to explain abstract concepts that would ordinarily be\ndifficult for students to understand without scaffolding (Tile", "created_at": "2026-01-03"}
{"id": "dc5074a8-3488-4aad-9f87-9dd476b31c27", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 38, "text": "mation (Willingham, n.d.). Instead, use visual elements\nwhen they boost engagement, to explain abstract concepts that would ordinarily be\ndifficult for students to understand without scaffolding (Tileston, 2011, p. 22), or to\ndemonstrate relationships between concepts within the lesson.\n• Which visuals should you choose? Remember to choose images that are age-appropriate\nand relevant to your audience. Try to avoid allusions to popular culture or other dated\ninformation that might not make sense to your learners. Thinking about your audience\ncan also help you choose visual elements that connect to prior knowledge. Triggering\nprior knowledge helps students create a foundation for learning new lessons (Tileston,\n2011, p. 22).\n• How much time do you have? Consider your time constraints when choosing visual\npresentations. For example, if you are planning to show a video, make sure it fits within\none learning session\nEducational Methodologies of\nPersonal Finance\n29\n\nSources:\nDavis, S. (2014). Using Bloom’s Taxonomy to write learning outcomes. Pearson Blog. www.\npearsoned.com/using-blooms-taxonomy-to-write-learning-outcomes/ [Accessed 7 Aug\n2019].\nEbner, M., & Bruff, D. (2010). “Visual thinking.” Center for Teaching and Learning, Vanderbilt\nUniversity. https://cft.vanderbilt.edu/guides-sub-pages/visual-thinking/ [Accessed 7 Aug\n2019].\nKouyoumdjian, H. (2012). “Learning through visuals: Visual imagery in the classroom.”\nPsychology Today. https://www.psychologytoday.com/us/blog/get-ps", "created_at": "2026-01-03"}
{"id": "87e6aeea-01e5-4a4d-b5dc-16616167fa85", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 39, "text": "sub-pages/visual-thinking/ [Accessed 7 Aug\n2019].\nKouyoumdjian, H. (2012). “Learning through visuals: Visual imagery in the classroom.”\nPsychology Today. https://www.psychologytoday.com/us/blog/get-psyched/201207/\nlearning-through-visuals [Accessed 7 Aug 2019].\nLearningTheories.com (2016). “Cognitive Theory of Multimedia Learning (Mayer).” Learning\nTheories. www.learning-theories.com/cognitive-theory-of-multimedia-learning-mayer.\nhtml [Accessed 10 Oct 2016].\nPoorvu Center for Teaching and Learning (n.d.). “Preparing for class.” Yale University. ctl.\nyale.edu/teaching/teaching-how/chapter-2-teaching-successful-section/preparing-class\n[Accessed 7 Aug 2019].\nShabiralyani, G., Hasan, K.S., Hamad, N., & Iqbal, N. (2015). Impact of visual aids in\nenhancing the learning process case research: District Dera Ghazi Khan. Journal of\nEducation and Practice, 6(19). https://files.eric.ed.gov/fulltext/EJ1079541.pdf [Accessed\n7 Aug 2019].\nTileston, D.W. (2011). 10 best teaching practices: How brain research and learning styles\ndefine teaching competencies. New York: Sage.\nTrafton, A. (2014). “In the blink of an eye.” MIT News. http://news.mit.edu/2014/in-theblink-of-an-eye-0116 [Accessed 7 Aug 2019].\nWillingham, D.T. (n.d.) “Ask the cognitive scientist.” American Federation of Teachers. www.\naft.org/ae/summer2005/willingham [Accessed 11 Mar 2015].\nEducational Methodologies of\nPersonal Finance\n30\n\nPreviewing\nBoth warm-up activities and reasons for learning help instructors preview the lesson", "created_at": "2026-01-03"}
{"id": "ae30c857-5313-4ebe-b730-59215caab12a", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 40, "text": ".org/ae/summer2005/willingham [Accessed 11 Mar 2015].\nEducational Methodologies of\nPersonal Finance\n30\n\nPreviewing\nBoth warm-up activities and reasons for learning help instructors preview the lesson that’s\ncoming. A preview of a lesson works just like a movie trailer: by offering a glimpse into the\nbig ideas without going into detail, it builds anticipation and interest in what’s to come\n(Grellet, 2010, p. 18). Giving learners a preview of the topic content increases anticipation for\nthe lesson and helps them understand what will be covered in advance of the education. It\nhelps them identify the most important parts of the lesson and those areas that pique their\ninterest.\nAccording to Françoise Grellet in Developing Reading Skills, previewing learning also helps\nlearners determine what they already know about a topic, which helps them connect what\nwill be taught with previous activities – increasing both motivation and comprehension.\nPreviewing may, in fact, create a more authentic learning experience because students are\nnot going into the learning phase of instruction completely blind (Grellet, 2010). Consider\norganic learning situations in which learners research topics of their own choosing. They\ngenerally have a foundation of interest and some preexisting knowledge of the topic before\nthey begin to study and learn more.\nPreviewing is beneficial both in the larger scheme of presenting a lesson, and also when asking\nstudents to read and understand a text. In a 2007 study", "created_at": "2026-01-03"}
{"id": "8b663d33-a484-44d4-824a-eb6aecb1c4f5", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 41, "text": "opic before\nthey begin to study and learn more.\nPreviewing is beneficial both in the larger scheme of presenting a lesson, and also when asking\nstudents to read and understand a text. In a 2007 study by Erten and Karakas, previewing was\nfound to be beneficial both before and during reading. Along with scanning and skimming,\npreviewing was found to increase literal comprehension (Erten & Karakas, 2007). Previewing\ntechniques like THIEVES helps students tap into prior knowledge, determine what they will\nlearn from the lesson, and create a learning plan. Through previewing, students create a\nroadmap for learning because they know what to look for throughout the lesson. Erten and\nKarakas also found that previewing strategies were instrumental during the lesson itself,\nallowing students to focus in on the key information identified prior to the start of the lesson,\nask questions, and make any corrections to the information they intended to learn.\nEducational Methodologies of\nPersonal Finance\n31\n\nTips for Implementation\nPreviewing helps students understand the lesson and builds excitement about what they\nwill be learning. To maximize the impact of the preview, consider these tips.\n• Post the agenda with the titles of topics and activities to be covered during the lesson.\n• Build interest through mystery and brevity. You can have students guess the topic or\nactivity by posting a single word or hint, and ask students to guess what they will be\nstudying.\n• Engage through reasons: once", "created_at": "2026-01-03"}
{"id": "0b479623-3f79-41e3-aaff-8c645684fe4e", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 42, "text": "st through mystery and brevity. You can have students guess the topic or\nactivity by posting a single word or hint, and ask students to guess what they will be\nstudying.\n• Engage through reasons: once students know what to expect, communicate why they\nwill be learning about these topics and give them opportunity to construct and share\ntheir own reasons for learning. Ask students which areas are important to them, and\nfocus on those areas.\n• Tap into prior knowledge. Help students identify prior knowledge by asking them what\nthey already know about the topic.\nTips for Implementation When Having Students Read a Text\nAlthough previewing adds an additional step to the teaching and learning process, it can be\nvaluable to both learners and teachers by increasing anticipation for the lesson and enabling\nstudents to attach new learning to preexisting knowledge. This is particularly true if you ask\nstudents to read a demanding text.\nWhen asking students to read difficult texts, the NFEC encourages instructors to use the\nTHIEVES previewing method. Scanning key elements of the lessons enables students to\ndetermine the key topics of the entire lesson. Thus they can begin to organize and categorize\nthe information they will be taught. The THIEVES method also relies on elements of active\nlearning, which requires students to acknowledge existing schemas (prior knowledge) and\nadd to those schemas on their own. According to the THIEVES model, students preview:\n• Title\n• Headings\n• Introductio", "created_at": "2026-01-03"}
{"id": "d6550b02-ee90-4a63-9e05-4340c40746d8", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 43, "text": "ing, which requires students to acknowledge existing schemas (prior knowledge) and\nadd to those schemas on their own. According to the THIEVES model, students preview:\n• Title\n• Headings\n• Introduction\n• Every first sentence\n• Visuals and vocabulary\n• End-of-chapter questions\n• Summary\nEducational Methodologies of\nPersonal Finance\n32\n\nAccording to Forget (2004), previewing strategies must be modeled, taught, and practiced in\norder to be effective. Forget suggests using the strategy repeatedly until students become\nused to the steps and the reasons for the steps (Forget, 2004, p. 109). Forget suggests the\nfollowing tips for introducing previewing strategies, particularly THIEVES:\n• Explain to students that previewing texts is a strategy for reading informational material.\n• Explain all the elements of the previewing strategy and make sure students understand\nthem before you begin.\n• Read the title and first paragraph to the students.\n• Identify the main idea at this point as a group.\n• As you lead discussion about main ideas and topics of the lesson, include all students,\nbut try to come to a consensus.\n• Assure students that since they are previewing, they don’t have to have everything\ncorrect yet.\n• After the lesson is complete, ask students to reflect on the previewing strategy and\ndetermine what they might change or do differently when using it for another lesson.\nEducational Methodologies of\nPersonal Finance\n33\n\nManz (2002) also provides tips for using the THIEVES strateg", "created_at": "2026-01-03"}
{"id": "e869194c-2d25-4b15-8251-2a5d12ba2ffd", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 44, "text": "and\ndetermine what they might change or do differently when using it for another lesson.\nEducational Methodologies of\nPersonal Finance\n33\n\nManz (2002) also provides tips for using the THIEVES strategy:\n• Title – Ask students what the proper nouns are in the title. Ask them about prior\nknowledge of those keywords. Ask them if they have any questions about the topics.\n• Headings – Have students analyze headings and subheadings just as they analyzed the\ntitle. Then ask them to look at all subheadings and try to develop an overall summary\nof what the lesson is about.\n• Introduction – Ask students to determine the thesis or main idea based on the introduction.\nAsk them to consider the title and subheadings in relationship to the introduction.\n• Every First Sentence – Remind students that the first sentences of each paragraph are\ntopic sentences that give them a clue to the content of each paragraph. Ask them to\nconsider the topics of each paragraph in relation to the subheadings.\n• Visuals and Vocabulary – Ask students to look for all pictures and graphs. Again, remind\nthem to look at these images in relationship to the overall themes and ideas they\ndetermined from the first four steps. As they identify vocabulary, remind them again of\noverall themes and main ideas.\n• End-of-chapter Questions – Remind students that the end-of-chapter questions are\ndesigned to check their understanding of main ideas. They should be able to review all\nmain ideas by looking at the questions.\n• Summa", "created_at": "2026-01-03"}
{"id": "a142a08a-9fe8-4eee-b40e-eda2ac3558c8", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 45, "text": "Questions – Remind students that the end-of-chapter questions are\ndesigned to check their understanding of main ideas. They should be able to review all\nmain ideas by looking at the questions.\n• Summary – Remind students that the summary should provide an overview of all the\nkey items learned in the lesson.\nGuiding students through THIEVES will increase the likelihood that they complete all aspects\nof the exercise. The process also will remind them that they need to look for commonalities\nbetween all stages of the exercise, which will help them identify key points to look for during\nEducational Methodologies of\nPersonal Finance\n34\n\nSources:\nErten, I.H., & Karakas, M. (2007). Understanding the divergent influences of reading\nactivities on the comprehension of short stories. The Reading Matrix, 7(3), p. 113.\nForget, M.A. (2004). MAX teaching with reading and writing: Classroom activities to help\nstudents (4th ed.). Victoria, BC, Canada: Trafford Publishing.\nGrellet, F. (2010). Developing reading skills: A practical guide to reading comprehension\nexercises. Cambridge, UK: Cambridge University Press.\nKelly, M. (2019). “Teach students to preview reading assignments.” ThoughtCo. www.\nthoughtco.com/teach-students-preview-reading-assignments-7787 [Accessed 7 Aug\n2019].\nMachi, L.A.., & McEvoy, B.T. (2016). The literature review: Six steps to success. Thousand\nOaks, CA: Corwin.\nManz, S.L. (2002). A strategy for previewing textbooks: Teaching readers to become\nTHIEVES. The Reading Teach", "created_at": "2026-01-03"}
{"id": "305855bf-0510-47e5-b5f5-9712a79600a8", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 46, "text": "Evoy, B.T. (2016). The literature review: Six steps to success. Thousand\nOaks, CA: Corwin.\nManz, S.L. (2002). A strategy for previewing textbooks: Teaching readers to become\nTHIEVES. The Reading Teacher, 55(5), pp. 434–435.\nUniversity of New South Wales (n.d.) “Reading strategies to save time.” student.unsw.edu.\nau/reading-strategies [Accessed 7 Aug 2019].\nEducational Methodologies of\nPersonal Finance\n35\n\nCase Method\nAs instructors move into the main activities of the lesson, they may want to use the case\nmethod to help learners engage in content more actively. The case method of teaching\ninvolves immersing students in a simulated learning situation that requires them to work\nthrough a problem to develop better understanding of a concept or topic. Generally, the\ncase method strategy involves real-world situations that are both engaging and thoughtprovoking. Students are placed in the role of decision-maker and their decisions ultimately\ninfluence the resolution of the problem. Whether the problem is solved or new questions are\ncreated, students learn through the activity how to construct their own meaning of a concept.\nProcedures in the case method strategy include analyzing the information presented in the\ncase study, researching additional information on pertinent topics, and designing a solution\nto the problem. Students are usually required to work in groups, participate in discussions,\nand evaluate potential strategies together.\nWhile the case method of teaching develops", "created_at": "2026-01-03"}
{"id": "94b6dd32-3a7d-4380-9981-1fa96472eb7d", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 47, "text": "esigning a solution\nto the problem. Students are usually required to work in groups, participate in discussions,\nand evaluate potential strategies together.\nWhile the case method of teaching develops many soft skills in students (discussion and\ncollaboration), studies show that the method has positive effects on all aspects of learning.\nHistorically used in business and medical courses, the case method has been shown to be\neffective in many subjects. In his 2015 study, researcher Kevin M. Bonney found that the case\nmethod affects students in two primary ways:\n1. Students who learned using the case method scored, on average, 18% higher on\nassessments than did those who learned by traditional lecture methods. It’s important\nto note that the exams were based directly on the situations in the case method\n(Bonney, 2015).\n2. Students’ perceptions of their own learning was heightened in classes that used the\ncase method. In Bonney’s study, 82% of students who participated in the case method\nlessons reported that they had a “good” or “great” understanding of the material; 70%\nof students engaged in classroom discussion; and 58% of students who only read the\ntextbook reported the same level of understanding.\nA further study published in the Journal of Education and Learning identifies additional\nbenefits to the case study method of teaching. Primarily, applying the case method in any\nclassroom ensures that students are active participants in the acquisition of knowledge,\nrather than s", "created_at": "2026-01-03"}
{"id": "dc486605-7318-4c98-b110-a1109e37ce7a", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 48, "text": "itional\nbenefits to the case study method of teaching. Primarily, applying the case method in any\nclassroom ensures that students are active participants in the acquisition of knowledge,\nrather than simply passive recipients (Cakmak & Akgun, 2017). The case method also\nrequires students to draw upon their previous knowledge and, in doing so, requires students\nto determine which knowledge is applicable to the current situation. This process allows\nstudents both to understand the importance of prior knowledge and learn to identify gaps in\ntheir own learning (Cakmak & Akgun, 2017).\nEducational Methodologies of\nPersonal Finance\n36\n\nThe case method also appeals to active learning strategies and affective domain, according\nto the Science Education Resource Center at Carleton College (Pedagogy in Action, 2018).\nActive learning is any type of instructional strategy that makes students active participants\nin the development of schemas and the addition of new information to existing schemas.\nActive learning strategies increase student engagement, allowing students both to retain more\ninformation and to transfer information to new situations (University of Minnesota, n.d.).\nThe affective domain of learning was identified in Bloom’s Taxonomy as one of the three general\ndomains of learning. In the affective domain, students learn based on elements of emotion\nincluding feelings, values, attitude, and motivation. Activities that correspond to the affective\ndomain require students to respond", "created_at": "2026-01-03"}
{"id": "9780a1f9-0491-404c-a1f4-7966ce93fa13", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 49, "text": "n the affective domain, students learn based on elements of emotion\nincluding feelings, values, attitude, and motivation. Activities that correspond to the affective\ndomain require students to respond to and place value on new information. By assigning it a\nvalue, students prioritize the information within their learning (Bloom, 1984, p. 7).\nThe case method increases student comprehension, targets both cognitive and affective\ndomains of learning, and builds greater engagement and motivation to learn the material.\nEducational Methodologies of\nPersonal Finance\n37\n\nTips for Implementation\nWith over 90 case study problems in the NFEC’s curriculum, the educator can present students\nwith real-world problems to resolve. This learner-centered approach deepens learning and\nhelps participants develop practical skill sets. When planning your lessons, choose from\namong three different types of case study activities:\nWarm-up Activities: Basic case method lessons. These activities take place before formal\neducation begins. Participants analyze the case studies and draw on prior knowledge\nto help resolve each challenge. Peer case examples and celebrities are also used in\nthis section to engage students in learning. These methods serve as a warm-up to get\nstudents interested, activate prior knowledge, and raise questions that will further\nmotivate students to learn the topics in the lesson.\nAdvanced Case Method Lessons: Taking place after lecture and/or skill building activities,\nlearners pa", "created_at": "2026-01-03"}
{"id": "e2dc0a34-74b6-4438-bd5a-1667cc0c9f4c", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 50, "text": "ledge, and raise questions that will further\nmotivate students to learn the topics in the lesson.\nAdvanced Case Method Lessons: Taking place after lecture and/or skill building activities,\nlearners participate in detailed evaluation and create solutions for the characters in the\ncase studies. These activities are focused on Webb’s extended thinking level and are\ndesigned to require the learner to provide specific solutions to the problems presented.\nPersonal Case Method Creation: Learners create case studies based on their personal\nfinancial situations and apply the case method problem-solving technique to their own\npersonal issues. This activity is most appropriate for adult learners, who will be most\nengaged in thinking through their own finances; but can also be used with younger\nlearners.\nImplementing the case method in the classroom requires planning and clear direction. To\nbegin, develop a clear goal and objective for applying the case method approach to teaching.\nDecide what your students know, what you would like them to learn, and how you will\ndetermine if they have met these goals.\nOnce you have determined your learning objectives, begin to look for a case that fits your\ngoals. Some considerations for picking a case for your students:\n• Cases should have a rich set of data. There should be a variety of situations, questions,\nand statistics for students to consider, discuss, and question (University of Illinois, n.d.).\n• Cases should be finished – try to avoid using", "created_at": "2026-01-03"}
{"id": "68026568-9615-4e2f-bd43-9eda2ec62c02", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 51, "text": "ata. There should be a variety of situations, questions,\nand statistics for students to consider, discuss, and question (University of Illinois, n.d.).\n• Cases should be finished – try to avoid using a case that does not have an answer,\nespecially if you cannot be sure that the answer will come while your students are\ninvestigating (University of Illinois, n.d.).\nTo successfully implement case method learning in the classroom, we suggest educators\nconsider the following (Schwartz, 2018; Stanford University, n.d.; University of Illinois, n.d.):\n• Prepare your students to think about problem-solving in advance.\n• Set ground rules for discussion and collaboration.\n• If your students will receive a grade, make sure they are clear about how they will be\ngraded – whether individually or as a group.\nEducational Methodologies of\nPersonal Finance\n38\n\n• Give students time to become familiar with the case. Make sure they fully understand\nboth the problem and the information they have found in their research before asking\nthem to engage in discussion.\n• Circulate around the room during group discussions to make sure everyone is\nparticipating; provide guidance to groups that appear off-course.\n• To begin the larger group discussion, ask questions. Use questions that begin with how\nand why to engage students in thinking about the problem. Encourage students to back\nup their answers with research.\n• Use a whiteboard or projector to compile information and responses so the whole class\ncan se", "created_at": "2026-01-03"}
{"id": "7cc05492-ca09-4394-b864-6d2464072987", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 52, "text": "engage students in thinking about the problem. Encourage students to back\nup their answers with research.\n• Use a whiteboard or projector to compile information and responses so the whole class\ncan see all of the information.\nIn addition to research and discussion, you can also integrate other activities into a case\nmethod lesson. Consider the following options to help engage your students:\n• Vote on elements of the case and the direction to take. You can use live voting apps\nlike Socratic, Poll Everywhere, or Micropoli and broadcast the results on an overhead\nprojector.\n• Case presentations. Have students present findings related to a certain element of the\ncase. You can use as much or as little technology as you wish.\n• Debate. Integrate debate into the classroom, particularly if there is an aspect or direction\nin the case upon which students cannot agree.\nFinally, decide how you will evaluate the conclusions. Consider the idea that some case\nstudies have no correct or incorrect answer. So focus on the skills you want students to learn:\nresearch, communication, debate, presentation, argument.\nEducational Methodologies of\nPersonal Finance\n39\n\nSources:\nBloom, B.S. (1984). Taxonomy of educational objectives: The classification of educational\ngoals. New York: Longmans Green.\nBonney, K.M. (2015). Case study teaching method improves student performance and\nperceptions of learning gains. Journal of Microbiology & Biology Education, 16(1), pp.\n21–28. doi:10.1128/jmbe.v16i1.846\nCakm", "created_at": "2026-01-03"}
{"id": "a22af50d-3bb6-4c8e-b768-cf172eb22d87", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 53, "text": ", K.M. (2015). Case study teaching method improves student performance and\nperceptions of learning gains. Journal of Microbiology & Biology Education, 16(1), pp.\n21–28. doi:10.1128/jmbe.v16i1.846\nCakmak, Z., and Akgün, I.H. (2017). A theoretical perspective on the case study method.\nJournal of Education and Learning, 7(1), pp. 96-102. doi:10.5539/jel.v7n1p96.\nClark, D. (2015). “Bloom’s Taxonomy: The affective domain.” Leadership Self-Assessment\nQuestionnaire. www.nwlink.com/~donclark/hrd/Bloom/affective_domain.html [Accessed\n8 Aug 2019].\nHsu, W. (2016). Harvard Business School (HBS) case method to teaching English for\nBusiness Communication. Education and Linguistics Research, 2(2), p. 95. doi:10.5296/\nelr.v2i2.10192\nPedagogy in Action (2018). “Why teach with the case method?” Using Media to Enhance\nTeaching and Learning, Science Education Research Center at Carleton College. serc.\ncarleton.edu/sp/library/cases/why.html [Accessed 8 Aug 2019].\nSchwartz, M. (2018). “Active learning.” Learning & Teaching Office, Ryerson University.\nhttps://www.ryerson.ca/content/dam/lt/resources/handouts/activelearning.pdf\n[Accessed 8 Aug 2019].\nStanford University (n.d.) “Case method teaching.” Undergraduate Main Site.\nteachingcommons.stanford.edu/resources/learning/learning-activities/case-methodteaching [Accessed 8 Aug 2019].\nUniversity of Illinois (n.d.) “The case method.” Center for Innovation in Teaching and\nLearning. citl.illinois.edu/citl-101/teaching-learning/resources/teaching-strategi", "created_at": "2026-01-03"}
{"id": "ccaaffa7-22ab-42e5-9c6a-74888168f700", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 54, "text": "eaching [Accessed 8 Aug 2019].\nUniversity of Illinois (n.d.) “The case method.” Center for Innovation in Teaching and\nLearning. citl.illinois.edu/citl-101/teaching-learning/resources/teaching-strategies/thecase-method [Accessed 8 Aug 2019].\nUniversity of Minnesota (n.d.) “Active learning.” Center for Educational Innovation. cei.\numn.edu/active-learning [Accessed 8 Aug 2019].\nEducational Methodologies of\nPersonal Finance\n40\n\nLecture\nWhile the bulk of teaching should support students’ active participation, the use of lecture\nin classrooms has been used for centuries and remains a common teaching method. Lectures\nare largely considered a “traditional” means of instruction, but there are still many instances\nin which mini-lectures can still be an effective means of conveying information.\nUsing lecture to deliver material ensures that the most up-to-date information is shared with\nlearners. It also allows the instructor to build anticipation and excitement for the upcoming\nlesson, which can increase student motivation for the topic and overall success in learning.\nAt NFEC, we integrate the latest research on effective pedagogy into all of our curricular\nunits. The delivery of key information during lecture sessions is used in every main subtopic\nand during the closing and recap of each lesson. During lecture sections, we consider the\nfollowing:\n• Engagement. Best practices in lecture delivery includes engaging students in the lecture\nprocess to increase motivation.\n• Learning Styl", "created_at": "2026-01-03"}
{"id": "de316ed5-a9e5-4f16-bf91-ed5b27f3b8b1", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 55, "text": "h lesson. During lecture sections, we consider the\nfollowing:\n• Engagement. Best practices in lecture delivery includes engaging students in the lecture\nprocess to increase motivation.\n• Learning Styles. We consider learning styles and break up lectures with visual, auditory,\nand kinesthetic components to allow multiple inputs of information.\n• Motivation Theory. We consider ways to ensure that students are engaged in the materials\nand motivated to learn.\n• Rapport. Educators take the opportunity to connect with students and build rapport.\n• Reinforcement of Reasons. The benefits of learning about personal finance are directly\nconnected with student’s lifestyle goals, so the lecturer should leverage this connection\nto strengthen their personal reasons for learning.\nThe NFEC’s lesson plans provide lecturer engagement cues, instructional resources, and\noutlines to enhance the effectiveness of the lecture. Have questions ready and be prepared\nto drill down on students’ answers to understand their true motivations for learning about\nmoney.\nAlthough droning professors have given lectures a bad reputation, short and effective minilectures can give teachers the opportunity to explain complex concepts in simple terms\nand refer to multiple sources. The lecturer can also include content and sources most\nappropriate for their learners. Another benefit of lectures, according to the University of\nWisconsin-Madison, is that they can be written quickly, which means information can be\nupdate", "created_at": "2026-01-03"}
{"id": "8bb375b9-dd43-4dac-9e76-f4c95aff7da7", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 56, "text": "d sources most\nappropriate for their learners. Another benefit of lectures, according to the University of\nWisconsin-Madison, is that they can be written quickly, which means information can be\nupdated frequently.\nEducational Methodologies of\nPersonal Finance\n41\n\nThe use of lecture in delivering content can also be useful for summarizing large volumes\nof information (Indiana University, n.d.). At the same time, the lecture can focus on topics of\nmost interest to the learners.\nResearchers at Ryerson University also have found that lectures can be especially engaging\nand informative when they are used in conjunction with discussion and the case method of\nteaching. Developing the lecture as the central element of instruction can increase student\nengagement in other lesson elements.\nEngagement opportunities for lecture-based instruction beyond the case method and\ndiscussion include creating interactive components, integrating problem-solving, and\nincluding organizational prompts.\nMichelle Schwartz, Instructional Design and Research Strategist at the Learning and Teaching\nOffice at Ryerson University, suggests placing interactive elements like brainstorming\nsessions in the middle of the lecture. Asking students to brainstorm about topics as they are\nintroduced will increase engagement before they receive the official information from the\nteacher. Another way to engage students is to create a pattern for discussion. Examples of\npatterns could be stopping for student discussion ever", "created_at": "2026-01-03"}
{"id": "7dc58ad6-37ec-4b0a-8661-5895f9296786", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 57, "text": "before they receive the official information from the\nteacher. Another way to engage students is to create a pattern for discussion. Examples of\npatterns could be stopping for student discussion every 20 minutes or after each subtopic is\nintroduced (Schwartz, 2018). Finally, organizational prompts (like outlines or Venn diagrams)\ncan help students to develop their own schemas. Interaction with the material also appeals\nto students who learn best visually and verbally.\nEducational Methodologies of\nPersonal Finance\n42\n\nTips for Implementation\nThe key to maximizing the success of lecture-based teaching is to make it as engaging as\npossible. Some things to consider while planning lectures:\n• The human brain’s maximum attention span for lecture-based learning is 20 minutes.\n• Consider prior knowledge while planning and delivering lectures. If students already\nhave some knowledge of the topic or no knowledge of the topic, it will help to shape\nthe depth of the lecture content.\n• Understand that emotion plays a huge role in retention. Having students connect their\nown experiences, goals, or deeply-held opinions to the topic can activate emotions and\ndeepen attachment to the content.\n• Information is retained more readily by the human brain when its practical purpose\nis clear. That’s why previewing the lessons and having students reflect on their own\nreasons for learning the information help increase both engagement and long-term\nretention (adapted from Schwartz, 2018).\nWhen integra", "created_at": "2026-01-03"}
{"id": "6ea79dcd-3790-415f-8fe0-eafe73a226fe", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 58, "text": "y previewing the lessons and having students reflect on their own\nreasons for learning the information help increase both engagement and long-term\nretention (adapted from Schwartz, 2018).\nWhen integrating discussion into lectures, consider the following ways to encourage student\nparticipation in discussion:\n• Ask the students to consider alternate points of view – either theoretical or those of\ntheir classmates.\n• Consider pros and cons. Ask students to determine the pros and cons of a concept or\nidea.\n• Use follow-up questions to help students think more deeply about the topic.\n• Use polling techniques and ask learners to discuss the poll results.\n• Enlist volunteers to help encourage everyone to participate in the discussion.\n• Create incentives for active participation. (adapted from Schwartz, 2018)\nEducational Methodologies of\nPersonal Finance\n43\n\nFinally, students will understand and retain information better if you use accompanying\nvisuals or structured note-taking. During the lecture, consider the following organizational\nprompts to help guide students toward understanding lecture content:\n• T-charts: Create columns to make notes based on the information presented.\n• Venn Diagrams: Have students compare two different concepts presented in lecture\ninformation.\n• Outlines: Give students outlines with keywords pre-filled. Have students fill in the blanks\nas they listen to the lecture.\n• Webs: Provide students with blank webs or pre-filled webs for lectures that center on", "created_at": "2026-01-03"}
{"id": "855cdbf1-a8f2-4d45-b3e1-007c463d2a13", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 59, "text": "ive students outlines with keywords pre-filled. Have students fill in the blanks\nas they listen to the lecture.\n• Webs: Provide students with blank webs or pre-filled webs for lectures that center on a\nsingle theme and include multiple subtopics.\nOverall, remember that you should go into every lecture with a plan. Decide what you would\nlike students to know before you start drafting or delivering your lecture. Always keep your\nstudents in mind when designing a lecture – know their attention spans, their interests, and\ntheir background knowledge about the topic. As you deliver the lecture, make sure to keep\nan eye on students’ reactions and their level of engagement. If they seem to be unfocused,\nutilize engagement activities and strategies to bring them back to the learning.\nEducational Methodologies of\nPersonal Finance\n44\n\nSources:\nIndiana University (n.d.). “Making lectures more active.” IUPUI Center for Teaching and\nLearning. ctl.iupui.edu/Resources/Teaching-Strategies/Tips-for-Making-Lectures-MoreActive [Accessed 8 Aug 2019].\nSchwartz, M. (2018). “Making lectures more engaging.” Learning & Teaching Office, Ryerson\nUniversity. www.ryerson.ca/content/dam/lt/resources/handouts/EngagingLectures.pdf\n[Accessed 8 Aug 2019].\nEducational Methodologies of\nPersonal Finance\n45\n\nSkill-building Activities\nWhether or not you use lectures to deliver information, it’s crucial to integrate varied skillbuilding activities, which appeal to various learning styles and help learners put inform", "created_at": "2026-01-03"}
{"id": "6716b79f-4f0b-43af-8a11-1d16e7c0294c", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 60, "text": "lding Activities\nWhether or not you use lectures to deliver information, it’s crucial to integrate varied skillbuilding activities, which appeal to various learning styles and help learners put information\ninto practice.\nSkill development activities often serve as the “guided practice” of any lesson. They provide\nopportunities for students to practice the skills they learned in the lecture portion of the\nskill development section. These activities provide students with a way to use and reinforce\nskills before they apply those skills to real-life situations. These activities also enable both\nthe educator and learners to monitor their comprehension of the subject.\nTraditional skill-building activities include worksheets and drilling exercises. However, as\nideas about education have evolved, skill-building activities have become more complex,\nand there are many different options for integrating these activities into teaching. Some\nactivity options include:\n• Fill in the missing information. This activity, called clozentropy, eliminates some elements\nof information. This technique gets students engaged by activating their brains in the\nquest to find the missing information (Marzano et al., 2011).\n• Games. The use of games in the classroom has been shown to increase teamwork and\ncooperative learning skills (Stathakis, 2013). Games help develop critical thinking\nskills and creativity. Even more importantly, games increase both connection with the\ncontent itself and learning in the", "created_at": "2026-01-03"}
{"id": "079704ef-3614-4ac7-9a56-68ea4ec8851d", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 61, "text": "rative learning skills (Stathakis, 2013). Games help develop critical thinking\nskills and creativity. Even more importantly, games increase both connection with the\ncontent itself and learning in the affective domain (one of the three learning domains\nidentified by Bloom). Finally, games draw students in and hold their attention, increasing\nmotivation to learn.\n• Project-based learning (PBL). PBL has been shown to increase teamwork, attention to\ndetail, and use of presentation skills (Stanford University, n.d.). Researchers have found\nthat this particular activity increases both active learning and students’ thinking about\nhow course content has larger significance. Additionally, students who participate in\nPBL activities have better knowledge retention (Guido, 2018).\n• Skits. Skits as a skill-building activity can engage students in creative problem-solving\nand decision-making. For example, students might act out a scenario in which they are\ntempted to exceed their budgets. These activities also engage students both verbally\nand nonverbally, reaching learners of many types. Creation of skits increases student\nconcentration on the tasks at hand, which leads to greater comprehension (Romano et\nal., n.d.).\nEducational Methodologies of\nPersonal Finance\n46\n\nAt NFEC, we consider the following factors in our Skill-building Activities sections:\n• Learning Domains: We consider the affective domain in trying to help students make\nconnections with the content and increase their engagem", "created_at": "2026-01-03"}
{"id": "12251197-712a-4484-b4bb-1ef6cf2eef59", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 62, "text": "ollowing factors in our Skill-building Activities sections:\n• Learning Domains: We consider the affective domain in trying to help students make\nconnections with the content and increase their engagement and motivation.\n• Learning Styles: We integrate a variety of activities and techniques that appeal to oral,\nvisual, and kinesthetic learners.\n• Assessment: We make use of frequent oral feedback as a means of formative assessment,\nallowing students to modify their plans of action and learn from their mistakes.\nAll topics in the NFEC curriculum include activities and extensions to build further\nunderstanding of the lessons. These activities prepare students for the final project-based\nlearning lesson where they complete their personal financial plans. The activities help them\nnot only to develop skills, but also to complete pieces of their financial plans.\nTips for Implementation\n• Use the learning objectives to guide your planning. Keep the desired end result in mind\nas you plan. Think about what you want your students to learn and work backwards to\ncreate the prompt or activity.\n• Use activities to break up the lesson. For every ten minutes of instruction, take a break for a\nbrief activity (some researchers suggest two minutes) to maintain student engagement\n(Reading Horizons, 2013).\n• Offer choices. Choices – in which activity to do, or how to share the findings or results of\nthe activities – can help increase intrinsic motivation for learning (Marzano et al., 2011).\nHowever", "created_at": "2026-01-03"}
{"id": "76708da8-687f-457d-8c3f-a735b037520e", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 63, "text": "13).\n• Offer choices. Choices – in which activity to do, or how to share the findings or results of\nthe activities – can help increase intrinsic motivation for learning (Marzano et al., 2011).\nHowever, don’t overwhelm students with too many options for skill-building activities.\nAim to offer two to three choices. Limiting the choices offers autonomy, but doesn’t\ncreate confusion.\n• Appeal to kinesthetic and visual learners. Getting students moving, interacting, and\ndrawing or responding to visuals will help engage different kinds of learners.\n• Provide “just-right” support. Learn to step away from actively teaching. Your role in\nproject-based learning activities is to serve as facilitator and guide, rather than instructor.\nNevertheless, stay available to provide support and offer feedback throughout the\nactivity; you may need to provide hints or inspiration toward a solution. You can use\nyour knowledge of students’ interests and abilities to gauge how much your students\ncan do independently.\nIntegrating activities into each lesson can be daunting, so start small. Consider brief\nquestion-and-answer periods or traditional “think-pair-share” discussion techniques. Then,\nas you become more comfortable with your students and the content, you can develop more\ncomplex skill-building activities.\nEducational Methodologies of\nPersonal Finance\n47\n\nSources:\nBerkeley, M. (2017). “The role of the teacher in high-quality PBL.” Gettingsmart.com. www.\ngettingsmart.com/2017/04/role-teacher-stu", "created_at": "2026-01-03"}
{"id": "7a2f0673-f382-4854-ab04-9dc54bec6381", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 64, "text": "ivities.\nEducational Methodologies of\nPersonal Finance\n47\n\nSources:\nBerkeley, M. (2017). “The role of the teacher in high-quality PBL.” Gettingsmart.com. www.\ngettingsmart.com/2017/04/role-teacher-student-centered-learning/ [Accessed 8 Aug\n2019].\nGuido, M. (2018). “The definitive project-based learning (PBL) guide.” Prodigy Blog. www.\nprodigygame.com/blog/project-based-learning/ [Accessed 8 Aug 2019].\nMarzano, R.J., & Pickering, D.J., with Heflebower, T. (2011). The highly engaged classroom.\nBloomington, IN: Marzano Research.\nPractical PBLA (n.d.). “Skill-building activities.” Practical PBLA, Weebly.com. practicalpbla.\nweebly.com/skill-building-activities.html [Accessed 8 Aug 2019].\nProvenzano, N. (2016). “4 practices for increasing student engagement.” Edutopia, George\nLucas Educational Foundation. www.edutopia.org/blog/practices-for-increasing-studentengagement-nicholas-provenzano [Accessed 8 Aug 2019].\nReading Horizons (2013). “Seven ways to increase student engagement in the classroom.”\nReadingHorizons.com. www.readinghorizons.com/blog/seven-ways-to-increase-studentengagement-in-the-classroom [Accessed 8 Aug 2019].\nRomano, L., Papa, L., & Saulle, E. (n.d.). “12 fascinating ways to use drama in the curriculum.”\nTeachHUB.com. www.teachhub.com/12-fascinating-ways-use-drama-curriculum\n[Accessed 8 Aug 2019].\nStanford University (n.d.). “Project-based learning.” Undergraduate Main Site.\nteachingcommons.stanford.edu/resources/learning/learning-activities/project-basedlearning [A", "created_at": "2026-01-03"}
{"id": "e66e0652-004f-4465-899b-4eff85d5e694", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 65, "text": "culum\n[Accessed 8 Aug 2019].\nStanford University (n.d.). “Project-based learning.” Undergraduate Main Site.\nteachingcommons.stanford.edu/resources/learning/learning-activities/project-basedlearning [Accessed 8 Aug 2019].\nStathakis, R. (2013). “Five reasons to use games in the classroom.” Education World. www.\neducationworld.com/a_curr/reasons-to-play-games-in-the-classroom.shtml [Accessed 8\nAug 2019].\nTeachThought Staff (2017). “4 things all project-based learning teachers should do.”\nTeachThought. www.teachthought.com/project-based-learning/4-things-project-basedlearning-teachers/ [Accessed 8 Aug 2019].\nEducational Methodologies of\nPersonal Finance\n48\n\nProject-Based Learning\nIn project-based learning, students investigate a problem or question and create an\nauthentic product based on their investigation. This method allows students to actively\nengage in the learning process and apply their knowledge and skills to something\ntangible. It mimics the real world like few other instructional techniques, and students can\nimmediately see the payoff from their hard work in the form of a product that everyone can\nsee.\nThe research surrounding project-based learning is substantial. According to the Buck\nInstitute for Education, 40 years of research has shown PBL to be “more effective than\ntraditional instruction for long-term retention, skill development and satisfaction of\nstudents and teachers” (Buck Institute for Education, n.d.). Students retain information\nbetter than in tradition", "created_at": "2026-01-03"}
{"id": "9031773d-a80a-409d-a0b3-b0a0c045a86a", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 66, "text": "traditional instruction for long-term retention, skill development and satisfaction of\nstudents and teachers” (Buck Institute for Education, n.d.). Students retain information\nbetter than in traditional learning settings because they are able to unite knowledge with\naction, honing their skills through that action. According to a 2010 Buck Institute study,\n“students demonstrate better problem-solving skills in PBL than in more traditional classes\nand are able to apply what they learn to real-life situations” (Buck Institute for Education,\n2010). There is nothing like working through a problem with your own hands, tinkering\nand wrestling with it until everything comes together. Students are also more motivated to\nlearn and more willing to take initiative in their education. Project-based learning can be\nincredibly exciting and intriguing for many students, which spurs them to persevere even\nwhen times get tough.\nIn 2000, John W. Thomas, PhD authored a review of all the scholarly research officially\nconducted on the subject of PBL, going back to the early 1990s (Thomas, 2000). This\ndocument showed that project-based learning produces gains in student achievement,\nproblem-solving capacity, comprehension (both of the broader subject and of specific\nskills), and work habits.\nCollege professor John Spencer, at a recent Nova Now conference at Kent Innovation High\nSchool, witnessed students working on a project on aquaponics and was struck by how\nreal the project was (Spencer, 2015).", "created_at": "2026-01-03"}
{"id": "0ae1fbf1-5ea6-4bcb-b641-b536a9b4d927", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 67, "text": "ofessor John Spencer, at a recent Nova Now conference at Kent Innovation High\nSchool, witnessed students working on a project on aquaponics and was struck by how\nreal the project was (Spencer, 2015). Students were engaging in authentic collaboration\nthat wasn’t forced. Their roles reflected those that you might see in business or scientific\nresearch in the real world. Students are able to work together sometimes, and other times\nin solitude. They had a chance to fail and learn from their failures.\nEducational Methodologies of\nPersonal Finance\n49\n\nTwo levels of project-based learning activities can be offered when teaching personal\nfinance courses. These levels are based upon the learner’s current financial situation and\nposition.\n• Self-sufficiency PBL. This basic PBL activity is for those students who do not manage\ntheir finances or have limited financial needs. The goal is to have them explore what\nself-sufficiency looks like through real-world planning. They explore financial needs\nsuch as rent, transportation, and education, as well as accounts, budgeting and expense\nplanning, saving money, and basic investment strategies to encourage long-term vision.\nThey develop plans to manage their finances on their own, in a safe environment where\nthey can explore the outcomes of various decisions.\n• Personal Planning PBL. For those who do manage their finances, this advanced PBL\nactivity has participants build personal financial plans across five areas: Understanding,\nDiagnosis, Pl", "created_at": "2026-01-03"}
{"id": "b8edbfba-9224-404f-b645-70e973dcfb07", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 68, "text": "s decisions.\n• Personal Planning PBL. For those who do manage their finances, this advanced PBL\nactivity has participants build personal financial plans across five areas: Understanding,\nDiagnosis, Planning, Prioritization, and Systemization. Participants start by gaining\na deeper understanding of their current financial situations through a variety of\nassessments that measure their overall financial health. They diagnose the root causes\nof any problems and explore what’s working for them. Then they create a plan and\nprioritize action steps to improve their finances. The final step is setting up systems and\nreminders that help them apply and instill the skills and behaviors to achieve positive\noutcomes.\nThe NFEC’s curriculum contains both levels of PBL instruction to accommodate people at\ndifferent financial life stages.\nEducational Methodologies of\nPersonal Finance\n50\n\nTips for Implementation\nThe implementation of a project-based learning program can seem daunting, especially\nbecause most of us grew up learning in traditional classroom settings. Here are some key\nelements of a project-based learning environment:\n• Driving Question or Problem: Similar to a hypothesis, this simple statement drives the\nentire process of student inquiry. Teachers should write the question or problem down\nand display it where everyone can see. It will act as a sort of mission statement for the\nwhole project.\n• Foster Critical Thinking, Collaboration, and Communication: Students cannot simply abso", "created_at": "2026-01-03"}
{"id": "76ca9353-5c6a-4ebb-b5b0-aaad6fc046ce", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 69, "text": "down\nand display it where everyone can see. It will act as a sort of mission statement for the\nwhole project.\n• Foster Critical Thinking, Collaboration, and Communication: Students cannot simply absorb\ninformation. They must ask high-level questions. They must learn to work as a team.\nThey must listen to the ideas and opinions of other students and be able to clearly\nexpress their own.\n• Meaningful Content: Objectives for learning are derived from financial education\nstandards and important ideas at the core of the financial discipline. Objectives give\nstudents a clear pathway toward learning goals and help them place value on those\ngoals.\n• Inquiry: Students should constantly be asking questions, seeking answers, and making\nconclusions. This process will lead them to produce something entirely new and entirely\ntheir own.\n• Student Voice and Choice: Giving students choices in how they learn increases their\nmotivation. Choice also allows students to see the value of learning in their own lives.\n• Reevaluation: Sometimes students can get into a project and realize things aren’t\nturning out quite the way they planned. At this point, it’s time to reassess and decide\nthe best next course of action. This situation also presents an opportunity to receive\nvaluable feedback from other students and the teacher, which they may use to make\nmodifications.\n• Public Exhibition: Students demonstrate their work to people outside the classroom.\nPublic exhibition motivates students to do their", "created_at": "2026-01-03"}
{"id": "54dcb198-4054-450b-9e25-f404640ae267", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 70, "text": "udents and the teacher, which they may use to make\nmodifications.\n• Public Exhibition: Students demonstrate their work to people outside the classroom.\nPublic exhibition motivates students to do their best work and put their best selves\nforward, producing an extremely high-quality, authentic result.\nEducational Methodologies of\nPersonal Finance\n51\n\nSources:\nBaghi, U. (2017). “12 reasons why project-based learning is better than traditional\nclassroom learning. eLearning Industry. https://elearningindustry.com/project-basedlearning-better-traditional-classroom [Accessed 8 Aug 2019].\nBuck Institute for Education (n.d.). “Does PBL work?” PBLWorks. https://www.bie.org/\nobject/document/does_pbl_work [Accessed 8 Aug 2019].\nBuck Institute for Education (2010). “Research summary on the benefits of PBL.” PBLWorks.\nhttp://www.bie.org/object/document/research_summary_on_the_benefits_of_pbl\n[Accessed 8 Aug 2019].\nImaginative Minds Group (n.d.). “Project-based learning.” Teaching Times. https://www.\nteachingtimes.com/kb/60/project-based-learning.htm [Accessed 8 Aug 2019].\nSpencer, J. (2015). “What makes project-based learning work?” John Spencer Blog. http://\nwww.spencerauthor.com/what-makes-project-based-learning-work/ [Accessed 8 Aug\n2019].\nThomas, J.W. (2000). “A review of research on project-based learning.” The\nAutodesk Foundation. https://documents.sd61.bc.ca/ANED/educationalResources/\nStudentSuccess/A_Review_of_Research_on_Project_Based_Learning.pdf [Accessed 8 Aug\n2019].\nEducationa", "created_at": "2026-01-03"}
{"id": "e105cf46-6377-4a6d-a31d-e12054d38213", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 71, "text": "ct-based learning.” The\nAutodesk Foundation. https://documents.sd61.bc.ca/ANED/educationalResources/\nStudentSuccess/A_Review_of_Research_on_Project_Based_Learning.pdf [Accessed 8 Aug\n2019].\nEducational Methodologies of\nPersonal Finance\n52\n\nAssessment\nNo learning activity can be considered complete without a way to measure what students\nhave learned. Before enacting a lesson, therefore, it is important to understand how you\nwill assess learner acquisition. With effective measurements in place, you can use the data\nyou acquire to promote learner success, encourage positive behaviors and long-term skill\ndevelopment, as well as determine how you – as an educator – can more effectively spend\nyour time when giving instruction.\nThe primary impact measures you should consider are content knowledge, sentiment, and\nbehavior change. When you consider these measures appropriately, you can effectively\nrecognize participants’ achievements to encourage continued learning and application of\nthe instruction.\n• Measuring Content Knowledge. When measuring content knowledge, it is important\nto provide multiple opportunities and styles with which to test learners’ knowledge,\nbecause no single assessment can tell an educator everything he or she needs to know\n(Lewis et al., n.d.). Traditional tests, independent or small-group assignments, and\nprojects all provide important insights into learner acquisition. The ultimate goal when\nmeasuring content knowledge is to check for learning transfer: that", "created_at": "2026-01-03"}
{"id": "99e45c97-ca85-49c6-84f3-9934bfd995ea", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 72, "text": "ndependent or small-group assignments, and\nprojects all provide important insights into learner acquisition. The ultimate goal when\nmeasuring content knowledge is to check for learning transfer: that is, allowing students\nto demonstrate ability to apply what they were taught in new situations (Bransford et\nal., 2001). For instance, if students are learning about economic psychology, you might\nassess their learning by asking them to apply economic psychology principles to new\nsituations – or to come up with new example situations of their own.\nLow-stakes assignments, where learners do work with room for error without a high cost,\nallow learners to develop a positive outlook on the process of learning. Projects are excellent\nmodes of measuring knowledge, because they allow work on real-world problems and can\nimprove problem-solving and attitudes toward the learning itself (Walker & Leary, 2009).\nWhen implemented effectively and regularly, testing can provide data to guide instructional\ndecisions and meet learners’ needs, which in turn can raise learner achievement (Bongiorno,\n2011).\nEducational Methodologies of\nPersonal Finance\n53\n\n• Behavior & Sentiment Survey. Sentiment is the expression of how a person feels about a\nsituation, event, or person. You can ask learners to describe – in writing or verbally – how they\nfeel about their behaviors, habits, and knowledge. Sentiment analysis in written form allows\nthe educator to collect and analyze data for learners. By doing so, the", "created_at": "2026-01-03"}
{"id": "e505a6f7-944a-4d9a-a567-47d819e3f6f7", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 73, "text": "in writing or verbally – how they\nfeel about their behaviors, habits, and knowledge. Sentiment analysis in written form allows\nthe educator to collect and analyze data for learners. By doing so, the educator can be much\nmore successful in determining and increasing learner motivation.\n• Participant Recognition. Recognition of learner achievement has a demonstrable effect on\nlearner success, both on behavior and on achievement. This effect occurs largely because\nrecognizing a new insight or behavior is its own reward, making the behavior more likely to\nbe repeated (Peters, 2010). Teachers can notice students’ achievements, but the most powerful\nform of recognition comes from students’ authentic recognition of their own progress. As a\nresult, asking students to reflect periodically – through surveys, journal entries, or pair shares\n– about their progress and learning helps students monitor their needs as well as developing\nintrinsic motivation. Researchers Fuchs and Fuchs determined that allowing learners to\ntrack their growth through demonstrable data in graphs or other means of tracking had a\nnoteworthy 26% gain in achievement (Fuchs & Fuchs, 1986).\nEducational Methodologies of\nPersonal Finance\n54\n\nTips for Implementation\nThe above means of measuring impact can make your teaching experience much more\nefficient and effective. Using data to drive instruction and recognize learner achievement\npromotes a healthier attitude and continued achievement.\n• Design assessments with lea", "created_at": "2026-01-03"}
{"id": "dbffdf29-6c9f-46e0-8bbe-925e84146f77", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 74, "text": "g experience much more\nefficient and effective. Using data to drive instruction and recognize learner achievement\npromotes a healthier attitude and continued achievement.\n• Design assessments with learning objectives established in advance, provide multiple\ntypes of assessments to gather a wider range of learner data, and document the data\nyou gather in an accessible way (Council on Alberta Teaching Standards).\n• Ensure that you respond to the data that you collect. You may modify your instructional\npace or focus to target areas of weakness (Council on Alberta Teaching Standards).\n• Assessments should be tangible and relevant to the desired skill acquisition (Council\non Alberta Teaching Standards). When possible, create questions that demonstrate realworld application to create higher levels of knowledge transfer.\n• Create a system to visually demonstrate learner growth that both you and the learners\ncan use to demonstrate their strengths and weaknesses and improve growth (Fuchs &\nFuchs, 1986). For example, you may track learners’ real-world (or imagined) savings or\ninvestments using visual tools.\nConducting Sentiment Analysis:\n• Pay attention to written communication from learners, or implement periodic surveys or\nother modes of feedback to pinpoint learners’ feelings about the instruction or subject\nmatter (Grossmann, n.d.).\n• Be aware that an individual learner may not be fully honest on a survey or may\nmiscommunicate a feeling. Focus instead on the information as a whole,", "created_at": "2026-01-03"}
{"id": "25deb4ea-aebc-4422-8d50-c05ac14af6d9", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 75, "text": "instruction or subject\nmatter (Grossmann, n.d.).\n• Be aware that an individual learner may not be fully honest on a survey or may\nmiscommunicate a feeling. Focus instead on the information as a whole, looking for\ntrends and patterns among all learners (Grossmann, n.d.).\n• Use the information you gather to intentionally target and resolve learners’ concerns\nand struggles. However, be wary of singling out an individual learner (Grossmann, n.d.).\nParticipant Recognition\n• Make sure that you recognize learners for growth relevant to their own stages, not just\nthe general top performers (Alstad-Davies, 2014).\n• Recognize learners in ways that are meaningful and tangible; for example, both verbal\nrecognition in class and written comments on work reinforce positive behavior and\nlearning.\n• If you recognize students publicly, ensure that recognition is given to many learners. Do\nnot leave anyone feeling left out or unappreciated.\nEducational Methodologies of\nPersonal Finance\n55\n\nSources:\nAlstad-Davies, Candace. (2014). “As a teacher, how do you recognize students’ achievements?”\nA+ Teachers’ Career Edge. https://resumes-for-teachers.com/blog/interview-questions/as-ateacher-how-do-you-recognize-students-achievements/ [Accessed 8 Aug 2019].\nBongiorno, D. (2011). Using student achievement data to support instructional decision making.\nAlexandria, VA: NAESP. http://www.naesp.org/sites/default/files/Student%20Achievement_\nblue.pdf [Accessed 8 Aug 2019].\nBransford, J.D. Brown, A.L., & Cock", "created_at": "2026-01-03"}
{"id": "1dd2b9c7-ba8b-4fe0-8e58-7af5a220231f", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 76, "text": "ata to support instructional decision making.\nAlexandria, VA: NAESP. http://www.naesp.org/sites/default/files/Student%20Achievement_\nblue.pdf [Accessed 8 Aug 2019].\nBransford, J.D. Brown, A.L., & Cocking, R.R. [Eds.] (2000). How people learn: Brain, mind,\nexperience, and school. Expanded Edition. Washington, DC: National Academies Press.\nCutler, David. (2015). “Making learning meaningful and lasting.” Edutopia. https://www.edutopia.\norg/blog/making-learning-meaningful-and-lasting-david-cutler [Accessed 8 Aug 2019].\nFuchs, L. S., & Fuchs, D. (1986). Effects of systematic formative evaluation: A meta-analysis.\nExceptional Children, 53(3), 199–208.\nGrossman, C. (n.d.). “Sentiment analysis to help your internal communications.” Beekeeper Blog.\nhttps://blog.beekeeper.io/how-sentiment-analysis-can-help-your-internal-communicationstrategy/ [Accessed 8 Aug 2019].\nLewis, D., Madison-Harris, R., Muoneke, A., & Times, C. (2010). Using data to guide instruction\nand improve student learning. SEDL Letter, American Institutes for Research, 22(2). http://www.\nsedl.org/pubs/sedl-letter/v22n02/using-data.html [Accessed 8 Aug 2019].\nPeters, L. (2010). “Reinforcement in the classroom improves student motivation and\nperformance.” Innovations & Perspectives, VCU. http://www.ttacnews.vcu.edu/2010/01/\nreinforcement-in-the-classroom-improves-student-motivation-and-performance/ [Accessed\n8 Aug 2019].\nRedmore, S. (2017). “Using sentiment analysis to dig deeper into written communication.”\nQuirk’s Media", "created_at": "2026-01-03"}
{"id": "003e0499-1d09-45e4-b9dc-b99365a914f2", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 77, "text": "einforcement-in-the-classroom-improves-student-motivation-and-performance/ [Accessed\n8 Aug 2019].\nRedmore, S. (2017). “Using sentiment analysis to dig deeper into written communication.”\nQuirk’s Media. https://www.quirks.com/articles/using-sentiment-analysis-to-dig-deeper-intowritten-communication [Accessed 6 Aug 2019].\nVega, V. (2015). “Project-based learning research review.” Edutopia. https://www.edutopia.org/\npbl-research-learning-outcomes [Accessed 8 Aug 2019].\nWalker, A., & Leary, H. (2009). A problem-based learning meta analysis: Differences across\nproblem types, implementation types, disciplines, and assessment levels. Interdisciplinary\nJournal of Problem-based learning, 3(1), pp. 12-43.\nWiggins, G. (2010). “What is transfer?” Authentic Education. http://www.authenticeducation.\norg/ae_bigideas/article.lasso?artid=60#_edn3 [Accessed 8 Aug 2019].\nEducational Methodologies of\nPersonal Finance\n56\n\nOngoing Education\nWhile all types of education are concerned with content and skills acquisition, financial\neducation demands a particular emphasis on long-term change, which requires both\nfollow-up education and systemization.\nFollow-up education simply involves reinforcing previous lessons, and can be adjusted to\nmeet the person’s needs at different stages in life. Repetition not only improves retention,\nbut also helps students stay motivated. Without consistent follow-up education, people are\nat greater risk of losing their enthusiasm and desire for financial knowledge.\nResea", "created_at": "2026-01-03"}
{"id": "73a3cf99-753d-4abc-ae8e-2d3274972094", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 78, "text": "only improves retention,\nbut also helps students stay motivated. Without consistent follow-up education, people are\nat greater risk of losing their enthusiasm and desire for financial knowledge.\nResearch has consistently shown that ongoing education is essential to financial literacy. A\n2017 study on evaluating the impact of financial education (Lusardi et al., 2017) concluded\nthat:\n1. Programs that included follow-up education were significantly more effective than\nthose that did not. In this instance, financial knowledge was sustained, and employees’\nsavings were raised by almost 10% at the time of retirement.\n2. Programs that did not incorporate follow-up education experienced short-term gains,\nbut no long-term effects. Participants were excited to implement the practices at first,\nbut this interest was not sustainable.\nThe evidence concerning systemization is also considerable. According to Leslie Allan,\nManaging Director of Business Performance Pty Ltd., “most mistakes and errors in business\nare the end result of not having clearly defined procedures for common tasks” (Allan, 2017).\nResearch has shown that only 20% of business problems can be attributed to fixed factors\nsuch as dishonest employees or defective raw materials. The other 80% are simply due to\ninefficiencies in processes. Author David Finkel relates the story of Tammy, who “was smart,\nsuccessful, and totally overwhelmed by her business” (Finkel, 2016; Hoffman & Finkel,\n2014). But, Finkel goes on to say, with", "created_at": "2026-01-03"}
{"id": "7aeed487-1b2b-4e17-b347-326c7fb9b353", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 79, "text": "processes. Author David Finkel relates the story of Tammy, who “was smart,\nsuccessful, and totally overwhelmed by her business” (Finkel, 2016; Hoffman & Finkel,\n2014). But, Finkel goes on to say, with effective and efficient systems in place this needn’t\nbe the case.\nSystemization involves the creation of routine processes for regularly occurring tasks.\nBecause of the complexity of financial literacy programs, implementing the skills learned\ncan seem overwhelming to many participants. However, if students reflect on their own\nexperiences of success and failure, they can establish a standardized way to approach their\ngoals. Using an efficient follow-up system, students can set up reminders for themselves,\nwhich also aids retention. With much practice, the application of these systems will become\nsecond nature.\nThe NFEC includes comprehensive follow-up education training materials to give students\ncontinued guidance, reminders, and ongoing education to encourage them to apply what\nthey have learned.\nEducational Methodologies of\nPersonal Finance\n57\n\nTips for Implementation\nThe implementation of follow-up education consists of four key parts:\n• Collaborative Learning: Give students opportunities to connect with each other and share\nwhat they have learned. Discussion and the exchange of ideas help solidify concepts,\nand motivate participants to try new things when they see the impact they have had on\nthe lives of others.\n• Regular Release: Consistently generate new information and", "created_at": "2026-01-03"}
{"id": "1c233956-82c2-4bbd-b9f4-1e1433af2d82", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 80, "text": "of ideas help solidify concepts,\nand motivate participants to try new things when they see the impact they have had on\nthe lives of others.\n• Regular Release: Consistently generate new information and lessons on a regular basis,\nand not just on basic beginner concepts. Gradually release more in-depth instruction\nso students always have opportunity to learn something new, but at a reasonable pace.\n• Let the Students be the Teachers: Many people insist that the best way to learn is to\nteach others. Students who teach other students experience greater comprehension\nand remember the information longer than those who only passively absorb it.\n• Combine eLearning with Real-world Experience: The digital world is a powerful tool in\nfinancial education and produces good results when united with real-life experiences.\nStudents might watch a video on creating a budget and then be asked to go home, have\na look at their monthly spending, and create budgets for themselves.\nEducators should consider the following steps in order to help participants systemize their\nfinancial literacy:\n• Consolidate Relevant Information: Make sure everything is in one easily accessible place,\nand get rid of any fluff that is not essential to the process.\n• Prioritize: Make a list of the core components of the student’s financial plan, in order of\nimportance. Focus in on the most important one, and have the student implement that\naction before moving on to the next priority.\n• Establish Best Practices: For eac", "created_at": "2026-01-03"}
{"id": "9beabdc0-397e-43b7-9b17-0b3e0598f360", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 81, "text": "dent’s financial plan, in order of\nimportance. Focus in on the most important one, and have the student implement that\naction before moving on to the next priority.\n• Establish Best Practices: For each component, determine the best way to approach the\ntask. What has research proven? What has worked for others in similar situations?\n• Never Stop Learning: Stay up-to-date with current information and ideas. Regularly\nreevaluate the system; look at what’s working and what isn’t. Have the attitude of a\nlifelong learner, and be willing to adapt to new situations and circumstances.\nEducational Methodologies of\nPersonal Finance\n58\n\nSources:\nAllan, L. (2017). “10 steps to creating effective systems for your business.” Business knowhow. https://www.businessknowhow.com/manage/systematize.htm [Accessed 8 Aug\n2019].\nFinkel, D. (2016). “A secret 4-step process to systematize your business starting in as little\nas 90 days.” Inc. This Morning. https://www.inc.com/david-finkel/a-secret-4-step-processto-systematize-your-business-starting-in-as-little-as-90.html [Accessed 8 Aug 2019].\nHoffman, J., & Finkel, D. (2014). Scale: Seven proven principles to grow your business and\nget your life back. New York: Portfolio/Penguin.\nJarrett, C. (2018). Learning by teaching others is extremely effective – a new study tested\na key reason why. The British Psychology Society Research Digest. https://digest.bps.\norg.uk/2018/05/04/learning-by-teaching-others-is-extremely-effective-a-new-studytested-a-key-reaso", "created_at": "2026-01-03"}
{"id": "947a5699-1194-447a-9b38-32b90cb6fd10", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 82, "text": "ew study tested\na key reason why. The British Psychology Society Research Digest. https://digest.bps.\norg.uk/2018/05/04/learning-by-teaching-others-is-extremely-effective-a-new-studytested-a-key-reason-why/ [Accessed 8 Aug 2019].\nKaufman, J. (2012). The personal MBA: Master the art of business. New York: Portfolio/\nPenguin. https://personalmba.com/systemization/\nLusardi, A., Michaud, P-C., & Mitchell, O.S. (2017). Assessing the impact of financial\neducation programs: A quantitative model. TIAA-CREF. https://www.aeaweb.org/\nconference/2018/preliminary/paper/TSKYYFn6 [Accessed 8 Aug 2019].\nResnick, N. (2017). “4 achievable steps to systemize your business.” Business.com. https://\nwww.business.com/articles/nathan-resnick-business-growth-systemization/ [Accessed 8\nAug 2019].\nWatkins, A. (2018). “The importance of ongoing training and follow-up”. eLeap. https://\nwww.eleapsoftware.com/importance-ongoing-training-follow/ [Accessed 8 Aug 2019].\nWharton, University of Pennsylvania (2015). “Why financial literacy programs require\nlong-term follow-up.” Knowledge@Wharton. http://knowledge.wharton.upenn.edu/\narticle/why-financial-literacy-programs-require-long-term-follow-up/ [Accessed 8 Aug\n2019].\nEducational Methodologies of\nPersonal Finance\n59\n\nConclusion\nFinancial literacy education is a relative newcomer to the field of pedagogy, and requires its\nown unique approaches with particular attention to deeply ingrained emotions and habits.\nBy drawing on academic research in education and p", "created_at": "2026-01-03"}
{"id": "46e6e3dd-dec1-4085-9f08-db48d8d95e3f", "doc_id": "4ec2d7dd-3fd2-42b8-86d6-91f594f8d620", "title": "Educational-Methodologies-Of-Personal-Finance", "source_file": "pdfs\\Educational-Methodologies-of-Personal-Finance.pdf", "chunk_index": 83, "text": "relative newcomer to the field of pedagogy, and requires its\nown unique approaches with particular attention to deeply ingrained emotions and habits.\nBy drawing on academic research in education and psychology, the financial educators at\nthe NFEC have laid the groundwork for creating well-structured, engaging programs that\ncan be adapted to the needs of diverse learners. We look forward to working with you – and\nyour learners – to develop and sustain healthy financial habits for the long-term.\nEducational Methodologies of\nPersonal Finance\n60", "created_at": "2026-01-03"}
