{"id": "9bf814be-50db-43aa-91db-17505e966b56", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 0, "text": "Framework for Teaching\nPersonal Finance\nThe Framework for Teaching personal Finance is a researched-based set of components\ngrounded in a constructivist view of learning and teaching.\n\nTeachers are the single most important influence on student success. The qualifications of\nfinancial educators have direct impact both on short-term student outcomes and on their\nlong-term financial well-being.\nDistinguished financial education instructors are not merely dispensers of knowledge; they\nare learning facilitators who can mold and modify participants’ behavior to guide them toward\nfinancial wellness. They understand that the subject of personal finance is unique in that it\nelicits emotional reactions from participants. These instructors have come to realize that a\n“one-size-fits-all” pedagogy does not work for delivering high-quality financial education.\nThe Framework for Teaching Personal Finance was developed to establish key benchmarks to\nhelp financial literacy educators become more effective, set clear performance measures, and\nprovide guidance for professional development. We hope this Framework will help educators\nincrease their instructional impact as they move participants toward financial wellness.\nOver the past several years the NFEC conducted surveys, research, and think tanks and\nformed collaborative relationships to develop this Framework. Because we value your\nthoughts, we also employ a crowdsourcing model where interested people can submit ideas\nfor consideration in", "created_at": "2026-01-03"}
{"id": "51735f45-63a7-4518-b8fb-95ff1b12a709", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 1, "text": "ks and\nformed collaborative relationships to develop this Framework. Because we value your\nthoughts, we also employ a crowdsourcing model where interested people can submit ideas\nfor consideration in future iterations of the Framework.\nI would like to personally thank everyone who contributed to the Framework and commend\nall those who have become involved in the financial education movement. Together we can\neducate the world’s citizens to make qualified financial decisions that improve their lives, the\nlives of their loved ones, and the lives of people they reach around the globe.\nVince Shorb, CEO\nNational Financial\nEducators Council\n“ An understanding heart is everything in a teacher, and\ncannot be esteemed highly enough. One looks back with\nappreciation to the brilliant teachers, but with gratitude to\nthose who touched our human feeling. The curriculum is\nso much necessary raw material, but warmth is the vital\nelement for the growing plant and for the soul of the child. “\nCarl Jung\n\nTable of Contents\nIntroduction 4\n› Educator Qualifications Affect Student Achievement 4\n› Financial Literacy Instruction Requires Unique Skill Sets 5\n› Risk of Unqualified Financial Education Instructors 6\n› Why Develop a Framework for Financial Education Instructors? 8\n› Why Model the ‘Framework for Teaching’? 9\nFramework for Teaching Personal Finance Overview 10\n› Domain 1: Planning and Preparation 11\n› Domain 2: Classroom Environment 12\n› Domain 3: Instruction 13\n› Domain 4: Professional Resp", "created_at": "2026-01-03"}
{"id": "7fbb5f3c-5612-415a-b18d-b034f1e40a71", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 2, "text": "r Teaching’? 9\nFramework for Teaching Personal Finance Overview 10\n› Domain 1: Planning and Preparation 11\n› Domain 2: Classroom Environment 12\n› Domain 3: Instruction 13\n› Domain 4: Professional Responsibilities 14\nProficiency Levels for Financial Education Instructors 15\nDomain 1: Planning and Preparation 17\n› Framework Overview: Planning and Preparation 18\nDomain 2: Classroom Environment 36\n› Framework Overview: Environment 37\nDomain 3: Instruction 51\n› Framework Overview: Delivery of Services 52\nDomain 4: Professional Responsibilities 72\n› Framework Overview: Professional Responsibilities 73\nAbout the National Financial Educators Council 91\n› Crowdsourcing Model 91\n› Development Team 92\nGlossary 95\nReferences 97\nFramework for Teaching\nPersonal Finance\n\nIntroduction\nEducator Qualifications Affect\nStudent Achievement\nEffective educators help learners achieve better outcomes.\nNumerous studies have shown that students of highly-qualified\neducators accomplish more positive outcomes than those\ntaught by less-qualified instructors. For example, students of\nqualified educators may expect higher lifetime earnings and\ngreater security at retirement [1] as well as improved mental\nand physical health and well-being. [2]\nThe effects of educator qualifications on student achievements\nare realized in various ways. Although few studies have examined\nthe specific effectiveness of financial educators, much parallel\nevidence can be found in research in the general education\nsector indicatin", "created_at": "2026-01-03"}
{"id": "fb050f85-d451-4e53-9a87-5d81c6b77894", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 3, "text": "ealized in various ways. Although few studies have examined\nthe specific effectiveness of financial educators, much parallel\nevidence can be found in research in the general education\nsector indicating that better-qualified teachers produce betterqualified graduates across a wide range of academic disciplines.\n[3] [4] Extending those results to include financial literacy\neducation seems a logical conclusion.\nThe Dallas Public Schools’ Accountability System reviews\n[5] found that, the more effective the teacher, the greater\nthe student gains. Studies conducted by researchers at the\nUniversity of Tennessee demonstrate that teacher effectiveness\nhas a cumulative, financially measurable effect on student\nachievement; those effects are long-lasting and sustainable.\nResearchers also found that teachers are the single most\nimportant variable contributing to student success, regardless\nof student age.[6]\nIn recent years, researchers have begun to apply science to\nthe art of teaching to quantify the effects of specific teaching\nstrategies on student outcomes. Studies have identified the basic\ncharacteristics of good teachers and shown that better teachers\nhelp students achieve measurably higher test scores regarding\na wide variety of academic subjects.[7] It is logical to infer that\ndedicated, highly-effective financial education instructors are\nthe key to moving participants toward financial wellness.\nFramework for Teaching\nPersonal Finance\n4\n\nFinancial Literacy Instruction Requires", "created_at": "2026-01-03"}
{"id": "a85b5393-fa71-4300-a236-58fb82ae5b15", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 4, "text": "ated, highly-effective financial education instructors are\nthe key to moving participants toward financial wellness.\nFramework for Teaching\nPersonal Finance\n4\n\nFinancial Literacy Instruction Requires Unique Skill Sets\nFinancial education is a unique subject that requires specialized expertise to teach effectively.\nThe quality of financial education instructors directly influences both short-term student\noutcomes and long-term impact on their financial well-being.\nUnlike other core subject matter typically taught in schools, the topic of money elicits\nemotional reactions in people – ranging from excitement to anxiety to shame. Each participant\nin a financial literacy course brings his or her own experience, emotions, and relationship\nwith money into the classroom. Educators must understand and respect these emotional\nreactions to succeed in establishing financial literacy among participants.\nEmotional attachment and pre-existing relationships with money also put participants at\ngreater risk. The NFEC uses the Transtheoretical Model of Behavior Change to measure a\nperson’s willingness to change his or her financial behaviors. When participants are taught\nby an untrained educator, their risk of regressing to lower stages in the model is greatly\nincreased. Thus they are likely to become more resistant to changing their financial acumen\nand habits.\nTo facilitate lasting behavior modification, educators must help students achieve a deeper\nlevel of understanding about financial lite", "created_at": "2026-01-03"}
{"id": "54f97365-168d-49ae-a06d-3582e3c4285c", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 5, "text": "ome more resistant to changing their financial acumen\nand habits.\nTo facilitate lasting behavior modification, educators must help students achieve a deeper\nlevel of understanding about financial literacy lessons compared to other core subject\nrequirements. The NFEC advocates that instructors use Bloom’s Taxonomy of Higher-order\nThinking Skills or the Depth of Knowledge Levels as a framework for teaching personal\nfinance. Given adequate instruction time, a highly-qualified financial education instructor\ndrives participants to synthesize the lessons and make decisions in alignment with their\nindividual financial situations. Few other topics taught in schools demand such depth of\nunderstanding; for most subjects students simply need to recall information to pass testing\nrequirements.\n“ Tell me and I forget. Teach me and I remember.\nInvolve me and I learn. “\nBenjamin Franklin\nFramework for Teaching\nPersonal Finance\n5\n\nRisk of Unqualified Financial Education Instructors\nUnder-qualified or poorly-performing financial educators may bring future economic\ndisaster. The effects of poor teaching can continue to affect students’ lives for many years\nafter instruction ends.[8] Worse, failure seemingly breeds more failure. According to the\nDallas studies cited above,[5] not only do under-qualified teachers reduce overall student\nachievement levels, but sub-par teachers also tend to be paired with already under-performing\nor at-risk students—thus exacerbating the risk of future economic pr", "created_at": "2026-01-03"}
{"id": "57fb9fb4-e630-4498-b497-86104aea2793", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 6, "text": "ified teachers reduce overall student\nachievement levels, but sub-par teachers also tend to be paired with already under-performing\nor at-risk students—thus exacerbating the risk of future economic problems resulting from\nfinancial illiteracy.\nQualified financial education instructors understand that “one-size-fits-all” pedagogy does\nnot work. The NFEC believes that financial education instructors are not simply dispensers of\nknowledge; they are learning facilitators who can mold or modify participants’ behavior to\nhelp them achieve financial wellness.\nUnfortunately, many financial literacy instructors today lack solid educator credentials\nand/or knowledge about personal finance topics. Beyond academic qualifications, studies\nalso show that an educator’s passion, enthusiasm, and commitment play critical roles in\nsuccessful student development, and a correlation certainly exists between an educator’s\nlevel of personal commitment and students’ financial futures.[9] [10] [11]\nFramework for Teaching\nPersonal Finance\n6\n\nThere are a variety of organizations and individuals from various background that teach\npersonal finance. Following we describe some of the common people who attempt to teach\npersonal finance:\n• Traditional, general educators report lacking the confidence to teach financial literacy.[12]\nWhen attempting to teach financial literacy as a stand-alone subject, traditional educators\nreport lacking the subject knowledge and skill sets they need to deliver the coursework", "created_at": "2026-01-03"}
{"id": "f658a343-178f-40a8-acbc-d92742a147d3", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 7, "text": "ncial literacy.[12]\nWhen attempting to teach financial literacy as a stand-alone subject, traditional educators\nreport lacking the subject knowledge and skill sets they need to deliver the coursework\neffectively. Many teachers deliver personal finance topics using the same methods they\nuse to teach core subjects and neglect the subject’s unique traits. For example, they often\nfocus on financial literacy rather than on improving participants’ financial capabilities. On\nthe positive side, as professional educators they do understand how to present and teach\nin general.\n• Financial professionals often understand financial topics quite well, yet lack training on\ngeneral teaching and presentation methods. Becoming licensed as a financial professional\ndoes not ensure competence at delivering financial literacy education. Studies have found\nthat general teaching effectiveness results from a complex set of inherent qualities as well\nas planning, instructional, and organizational skills that many financial professionals have\nnot developed at levels adequate to make them effective financial education instructors.\n[13]\n• Employees or volunteer staff of non-profit organizations, community groups, and government\nentities often lack traditional teaching skill sets and do not possess necessary knowledge on\npersonal financial matters. Many volunteers have the passion to help people. However, the\nresults of their efforts would be greatly magnified if they obtained the skill sets identified\nby", "created_at": "2026-01-03"}
{"id": "6548e836-7baa-4286-8640-14e7d80be459", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 8, "text": "knowledge on\npersonal financial matters. Many volunteers have the passion to help people. However, the\nresults of their efforts would be greatly magnified if they obtained the skill sets identified\nby the Framework for Teaching Personal Finance.\nAlthough very little research has focused on the risks of learning from unqualified financial\neducators, parallels from the general education literature seem obvious. Just as a poorlytrained, under-committed financial advisor may lead clients to financial loss and economic\nhardship, a similarly weak financial educator has potential to create long-term problems for\nstudents who rely on his or her guidance.[14]\nIt seems intuitive that financial literacy learners will benefit most from blending the strengths\nof seasoned financial professionals, the basic skill sets of effective general educators, and\nspecialized training that meets benchmarks set forth in the Framework for Teaching Personal\nFinance. Accountability for measurable results forms an important common ingredient for\nsuccess, so the development and national adoption of clear, consistent standards for financial\neducators offers everyone the hope for a better economic future.\nFramework for Teaching\nPersonal Finance\n7\n\nWhy Develop a Framework for Financial Education\nInstructors?\nGiving instructors a framework for professional practice is common in many fields – education,\nfinancial services, accounting, law, and medicine, for example. Yet until now the financial\neducation industry", "created_at": "2026-01-03"}
{"id": "ada69ce6-32f8-41a4-80c7-7baf954debb3", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 9, "text": "g instructors a framework for professional practice is common in many fields – education,\nfinancial services, accounting, law, and medicine, for example. Yet until now the financial\neducation industry has developed standards for learners, but lacked guidelines for financial\neducation instructors.\nThe objective of the Framework for Teaching Personal Finance is to share benchmarks\nwith the financial education industry that will assist educators to become more effective\ninstructors and give them to tools to help individuals improve their financial capabilities. In\naddition, the Framework for Teaching Personal Finance offers the following benefits:\n• Framework to improve the quality and impact of financial education programming\n• Resource for hiring and recruiting financial education instructors\n• Clear performance evaluation criteria for financial education instructors\n• Framework for financial education instructors seeking professional development\n• Common language as a resource to improve communication\n• Tools for teacher preparation, performance measures, and self- assessment\n• Awareness tool to highlight the importance of highly-skilled educators\n• Public assurance that financial education instructors are held to the highest standards of\npractice\nFramework for Teaching\nPersonal Finance\n8\n\nWhy Model the\n‘Framework for Teaching’?\nThe NFEC chose to work with Danielson Group consultants to modify Charlotte Danielson’s\nFramework for Teaching to meet the specific needs of Financia", "created_at": "2026-01-03"}
{"id": "6392c24b-8801-4f15-b8f7-37ac309184b9", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 10, "text": "Finance\n8\n\nWhy Model the\n‘Framework for Teaching’?\nThe NFEC chose to work with Danielson Group consultants to modify Charlotte Danielson’s\nFramework for Teaching to meet the specific needs of Financial Education Instructors. The\nFramework for Teaching is the most widely-used teaching model in the United States, and\nhas been adopted as the single model, or one of several approved models, in more than 20\nstates.\nThe Framework identifies the educator responsibilities proven by empirical studies\nand theoretical research to produce the highest gains in participant test scores. This\ncomprehensive, coherent structure provides clear benchmarks to enhance educators’\nprofessional development.\nFirst published in 1996, Enhancing Professional Practice: A Framework for Teaching was\ndeveloped to improve teacher performance and participant learning. The Framework identifies\nskill sets educators should possess and performance levels that define instructor capabilities.\nThe Framework has been revised through four editions, with the latest published in 2013.\nDeveloper of the Framework for Teaching, Charlotte Danielson, is a recognized expert in the\narea of teacher effectiveness and teacher evaluation systems. She advises State Education\nDepartments, National Ministries, and Departments of Education. She founded the Danielson\nGroup to enhance professional practices of educators for maximum positive impact on\nstudent learning.\nThe Framework for Teaching is backed by evidence-based research and wi", "created_at": "2026-01-03"}
{"id": "d9985e61-b03c-44c7-b4f8-4a71567ba98f", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 11, "text": ". She founded the Danielson\nGroup to enhance professional practices of educators for maximum positive impact on\nstudent learning.\nThe Framework for Teaching is backed by evidence-based research and wide acceptance by\neducators, administrators, policymakers, and academics. These qualities are what led the\nNFEC to select the Framework for Teaching as its solution for developing benchmarks for\nfinancial education instructors.\nFramework for Teaching\nPersonal Finance\n9\n\nFramework for Teaching Personal\nFinance Overview\nDomain 1: Domain 2:\nPlanning and Preparation Classroom Environment\nDomain 3: Domain 4:\nInstruction Professional Responsibilities\nFramework for Teaching\nPersonal Finance\n10\n\nDomain 1: Planning and Preparation\nInstructional planning includes a deep understanding of content and pedagogy and an\nunderstanding and appreciation of the participants and what they bring to the educational\nencounter. But grasping the content is not sufficient; the content must be transformed through\ninstructional design into sequences of activities and exercises that make it accessible to\nparticipants.\nAll elements of the instructional design – learning activities, materials, and strategies – must\nbe appropriate to both the content and the participants, and aligned with larger instructional\ngoals. In their content and process, assessment techniques must also reflect the instructional\noutcomes and should serve to document participant progress during and at the end of a\nteaching episode.\nFurtherm", "created_at": "2026-01-03"}
{"id": "261239e6-b61b-4e59-8c84-25356626586f", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 12, "text": "In their content and process, assessment techniques must also reflect the instructional\noutcomes and should serve to document participant progress during and at the end of a\nteaching episode.\nFurthermore, in designing assessment strategies, Financial Education Instructors must\nconsider their use for formative purposes, and how assessments can provide diagnostic\nopportunities for participants to demonstrate their level of understanding during the\ninstructional sequence, while there is still time to make adjustments.\n1a: Demonstrating knowledge of the content and the pedagogy / andragogy of\nimproving financial capabilities, financial psychology, and supporting the\ndevelopment of positive financial habits.\n1b: Demonstrating knowledge of participants’ cognitive abilities, willingness to\nchange, motivating factors, and interests.\n1c: Setting instructional outcomes and financial behavior objectives.\n1d: Demonstrating knowledge of resources.\n1e: Designing coherent instruction.\n1f: Designing participants’ assessments.\nFramework for Teaching\nPersonal Finance\n11\n\nDomain 2: Classroom Environment\nFinancial Education Instructors create a learning environment through positive interpersonal\ninteractions, efficient routines and procedures, clear and consistent standards of conduct, and\na safe physical environment that supports the learning purposes. In addition, the environment\nencourages participants to take pride in their work and to assume responsibility for their\nlearning.\nParticipants r", "created_at": "2026-01-03"}
{"id": "d96bbfb5-e513-42cc-8e5f-b179d132e51a", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 13, "text": "ysical environment that supports the learning purposes. In addition, the environment\nencourages participants to take pride in their work and to assume responsibility for their\nlearning.\nParticipants respond to the warmth and caring of Financial Education Instructors, their high\nexpectations for achievement, and their commitment to participants. Participants feel safe\nwith these Financial Education Instructors and know that they can count on the Financial\nEducation Instructors to be fair and, when necessary, compassionate. Participants are also\nsensitive to the subtle messages they receive from Financial Education Instructors as to their\ncapabilities.\nThe components of Domain 2 are not associated with the learning of any particular content;\ninstead, they set the stage for all learning. The Financial Education Instructor establishes a\ncomfortable and respectful classroom environment, which cultivates a culture for learning\nand creates a safe place for risk-taking. The atmosphere is businesslike, with non-instructional\nroutines and procedures handled efficiently; participant behavior is cooperative and nondisruptive; and the physical environment is conducive to learning.\n2a: Creating an environment of respect and rapport.\n2b: Establishing a culture for learning and application of financial principles.\n2c: Managing classroom and/or technology-based procedures.\n2d: Managing participant conduct to support learning processes.\n2e: Organizing physical and/or virtual space.\nFramework f", "created_at": "2026-01-03"}
{"id": "559437dd-4d5d-4853-9263-a4b18057bc65", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 14, "text": "nancial principles.\n2c: Managing classroom and/or technology-based procedures.\n2d: Managing participant conduct to support learning processes.\n2e: Organizing physical and/or virtual space.\nFramework for Teaching\nPersonal Finance\n12\n\nDomain 3: Instruction\nDomain 3 contains the components that are at the essential heart of teaching – the actual\nengagement of participants in learning, through the vision of participants developing\ncomplex understanding and participating in a community of learners. Participants are\nengaged in meaningful work, which carries significance beyond the next test and is relevant\nto participants’ lives.\nFinancial Education Instructors who excel in Domain 3 have finely-honed instructional skills.\nTheir work in the classroom is fluid and flexible; they can shift easily from on approach to\nanother when the situation demands it. They seamlessly incorporate ideas and concepts\nfrom other parts of the curriculum into their explanations and activities. Their questions\nprobe participant thinking and serve to extend understanding. They are attentive to different\nparticipants in the class, and the degree to which they are thoughtfully engaged; they\ncarefully monitor participant understanding as they go (through well-designed questions or\nactivities) and make minor mid-course corrections as needed. And above all, they promote\nthe emergence of self-directed learners fully engaged in the work at hand.\n3a: Communicating with participants about acquiring or changing fina", "created_at": "2026-01-03"}
{"id": "c475610b-5953-4706-a650-523f536bfbcd", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 15, "text": "ourse corrections as needed. And above all, they promote\nthe emergence of self-directed learners fully engaged in the work at hand.\n3a: Communicating with participants about acquiring or changing financial\nbehaviors.\n3b: Using questioning and discussion techniques that promote positive financial\nbehaviors.\n3c: Engaging participants with relevant financial instruction.\n3d: Using assessment in instruction to measure behavioral change.\n3e: Demonstrating flexibility and responsiveness to participants’ learning needs.\nFramework for Teaching\nPersonal Finance\n13\n\nDomain 4: Professional Responsibilities\nThe components in Domain 4 are associated with being a true professional Financial\nEducation Instructor: they encompass the roles assumed outside of and in addition to those\nin the classroom with participants. Participants rarely observe these activities; parents and\nthe larger community observe them only intermittently. But the activities are critical to\npreserving and enhancing the profession. Financial Education Instructors exercise some of\nthem (for example, maintaining records and communicating with families) immediately upon\nentering the profession, since they are integral to their work with participants.\nDomain 4 consists of a wide range of professional responsibilities, from self-reflection and\nprofessional growth, to participation in a professional community, to contributions made\nto the profession as a whole. The components also include interactions with the families\nof part", "created_at": "2026-01-03"}
{"id": "99aec7ec-0b94-4530-9041-e558a24dee0b", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 16, "text": "reflection and\nprofessional growth, to participation in a professional community, to contributions made\nto the profession as a whole. The components also include interactions with the families\nof participants, contacts with the larger community, and advocacy for participants. Domain\n4 captures the essence of professionalism by Financial Education Instructors; Financial\nEducation Instructors are, as a result of their skills in this domain, full members of the\nteaching profession and committed to its enhancement.\n4a: Reflecting on teaching financial capability.\n4b: Maintaining accurate records of participants’ financial capabilities.\n4c: Communicating with participants’ networks to promote community financial\nwellness.\n4d: Participating in professional inquiry focused on financial wellness.\n4e: Growing and developing professionally.\n4f: Showing professionalism as a qualified Financial Education Instructor.\nFramework for Teaching\nPersonal Finance\n14\n\nProficiency Levels for Financial\nEducation Instructors\nUnsatisfactory Financial Education Instructors represent teaching that falls below the licensing\nstandard of “do no harm” or where the Financial Education Instructor does not yet fully\nunderstand the concepts underlying the component.\n• Evidence of little or no understanding and/or implementation of the Framework for\nTeaching Personal Finance.\n• Detrimental to participant learning. Inadequate and inappropriate instructional and/\nor unprofessional behaviors persist even after int", "created_at": "2026-01-03"}
{"id": "efc86507-4a52-4816-b78b-102d6049207f", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 17, "text": "implementation of the Framework for\nTeaching Personal Finance.\n• Detrimental to participant learning. Inadequate and inappropriate instructional and/\nor unprofessional behaviors persist even after intervention(s) and support(s) have been\nprovided.\n• A Financial Education Instructor at the Unsatisfactory level must successfully implement\nspecific steps to improve his/her professional practice to the Proficient or Distinguished\nlevel.\nBasic Financial Education Instructors represent teaching that is sporadic, intermittent, or\notherwise not entirely successful but where the Financial Education Instructor has some\nunderstanding of the concepts underlying the component.\n• Characterized by evidence of minimal understanding and/or implementation of the\nFramework for Teaching Personal Finance.\n• Practice at the Basic level is inconsistent. Understanding and implementation of instructional\nand/or professional behaviors demonstrate limited effectiveness with uneven results.\n• A Financial Education Instructor at the Basic level requires specific supports and interventions\nto improve individual professional practice to Proficient or Distinguished levels of practice.\nFramework for Teaching\nPersonal Finance\n15\n\nProficient Financial Education Instructors represent Financial Education Instructors\nwho have a deep knowledge of content, professional knowledge of participants and\ncurriculum, and a broad repertoire of strategies and activities to use with participants.\n• Consistently characterized", "created_at": "2026-01-03"}
{"id": "4671442f-583e-41ca-97f2-57ea9ac29518", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 18, "text": "who have a deep knowledge of content, professional knowledge of participants and\ncurriculum, and a broad repertoire of strategies and activities to use with participants.\n• Consistently characterized by evidence of a solid knowledge of effective instructional\npractices, purposeful teaching preparation, and use of a broad repertoire of strategies\nand activities supported by the Framework for Teaching Personal Finance.\n• Consistent and includes high expectations for participant learning. Accurate knowledge\nof instructional practices, content, participants, and resources is demonstrated.\n• A Financial Education Instructor at the Proficient level works independently and\ncollaboratively to improve his/her professional practice to support and promote high\nlevels of participant learning and demonstrate ethical and reflective professional\npractice.\nDistinguished Financial Education Instructors represent a master teaching level where\ninstructors make significant contributions in the classroom to encourage participants\nto take considerable responsibility for their own learning, as well as outside the\nclassroom as leaders among educational peers and the broader community.\n• Consistently characterized by evidence of extensive knowledge and expertise in\nunderstanding and implementing the components of the Framework for Teaching\nPersonal Finance.\n• Characterized by exceptional commitment to flexible, differentiated, and responsive\ninstructional practice as evidenced by effective instructo", "created_at": "2026-01-03"}
{"id": "f40a9f96-5009-46f9-8465-2c85e8892c06", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 19, "text": "ponents of the Framework for Teaching\nPersonal Finance.\n• Characterized by exceptional commitment to flexible, differentiated, and responsive\ninstructional practice as evidenced by effective instructor modeling, high levels of\nparticipant engagement, participant-directed learning, and participant growth. There\nis evidence of extensive and rigorous individualized instruction that is developmentally\nand culturally appropriate.\n• A Financial Education Instructor at the Distinguished level takes initiative, provides\nleadership in the financial education field, and is committed to ethical, reflective,\ncontinuous, professional practice that ensures high levels of participant learning and\nownership.\nFramework for Teaching\nPersonal Finance\n16\n\nDomain 1:\nPlanning and\nPreparation\nFramework for Teaching\nPersonal Finance\n17\n\nFramework Overview: Planning and Preparation\n1a: Demonstrating knowledge of content 1d: Demonstrating knowledge of resources.\nand pedagogy / andragogy of improving\nVariety of resources\nfinancial capabilities, financial psychology,\nand positive financial habits. Extend content knowledge\nFinancial capabilities Linkages with universities, colleges,\nprofessional organizations, and webFinancial psychology\nbased resources\nFormation of positive financial habits\n1e: Designing coherent instruction.\n1b: Demonstrating knowledge of\nLearning activities that engage and\nparticipants’ cognitive abilities, willingness\nmotivate\nto change, motivating factors, and interests.\nDiverse ins", "created_at": "2026-01-03"}
{"id": "024a2bd3-5c44-49c7-8bc0-3611b78184fc", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 20, "text": "herent instruction.\n1b: Demonstrating knowledge of\nLearning activities that engage and\nparticipants’ cognitive abilities, willingness\nmotivate\nto change, motivating factors, and interests.\nDiverse instructional materials and\nStudent skills, knowledge, and proficiency\nresources\nFinancial beliefs and values\nVaried instructional groups\nSpecial needs\nAppropriate lessons and units focused on\npositive financial behaviors\n1c: Setting instructional outcomes and\nfinancial behavior objectives.\n1f: Designing participants’ assessments.\nCognitively challenging\nMeasure short-term outcomes\nFocus on learning\nFormative assessments to understand\nDevelop financial capability participant learning\nSuitable for diverse learners Use long-term quantification of behavior\nchange\nFocus on positive financial behaviors\nFramework for Teaching\nPersonal Finance\n18\n\n1a: Demonstrating knowledge of the content and the pedagogy /\nandragogy of improving financial capabilities, financial psychology\nand supporting the development of positive financial habits.\nUnsatisfactory\nIn planning and practice, Financial Education Instructor makes content errors or\ndoes not correct errors made by participants. Financial Education Instructor displays\nlittle understanding of prerequisite knowledge important to participant learning of\nthe content. Financial Education Instructor displays little or no understanding of the\nrange of pedagogical/andragogical approaches suitable to participant learning of\nthe content.\nBasic\nFinancial", "created_at": "2026-01-03"}
{"id": "1a13dac5-fe32-4f68-8a19-a8d216a764e3", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 21, "text": "of\nthe content. Financial Education Instructor displays little or no understanding of the\nrange of pedagogical/andragogical approaches suitable to participant learning of\nthe content.\nBasic\nFinancial Education Instructor is familiar with the important concepts in the\ndiscipline but displays lack of awareness of how these concepts relate to one another.\nFinancial Education Instructor indicates some awareness of prerequisite learning,\nalthough such knowledge may be inaccurate or incomplete. Financial Education\nInstructor planning and practice reflect a limited range of pedagogical/andragogical\napproaches to the discipline or to the participants.\nProficient\nFinancial Education Instructor displays solid knowledge of the important concepts\nin the discipline and how these relate to one another. Financial Education Instructor\ndemonstrates accurate understanding of prerequisite relationships among topics.\nFinancial Education Instructor planning and practice reflect familiarity with a wide\nrange of effective pedagogical/andragogical approaches in the subject.\nDistinguished\nFinancial Education Instructor displays extensive knowledge of the important\nconcepts in the discipline and how these relate both to one another and to\nother disciplines. Financial Education Instructor demonstrates understanding of\nprerequisite relationships among topics and concepts and understands the link\nto necessary cognitive structures that ensure participant understanding. Financial\nEducation Instructor plann", "created_at": "2026-01-03"}
{"id": "b7e304dc-57da-467f-949a-ccda79745ddb", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 22, "text": "rstanding of\nprerequisite relationships among topics and concepts and understands the link\nto necessary cognitive structures that ensure participant understanding. Financial\nEducation Instructor planning and practice reflect familiarity with a wide range of\neffective pedagogical/andragogical approaches in the discipline and the ability to\nanticipate participants’ misconceptions.\nFramework for Teaching\nPersonal Finance\n19\n\nDistinguished\n• Financial Education Instructor plans with the end goal of lessons in mind.\n• The Financial Education Instructor ensures that participants know how the content relates\nto their personal lives.\n• Financial Education Instructor provides clear and exemplary explanations of behavioral\ndevelopment and change.\n• The Financial Education Instructor recognizes at which stage participants are operating\nand prepares activities designed to move them to the higher learning levels.\n• Financial Education Instructor cites intra- and inter-disciplinary content relationships.\n• Participants apply strategies in their everyday lives.\n• Financial Education Instructor demonstrates awareness of possible participant\nmisconceptions and how they can be addressed.\n• Instructional strategies in unit and lesson plans are diverse and extensive and demonstrate\nextended understanding of the key content.\n• Participants know how to compute the major personal finance calculations and connect\nhow they relate to personal financial decisions.\n• Uses Marzano six-step process for le", "created_at": "2026-01-03"}
{"id": "f51deff4-0636-44c1-b464-7cd9ceafc284", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 23, "text": "nding of the key content.\n• Participants know how to compute the major personal finance calculations and connect\nhow they relate to personal financial decisions.\n• Uses Marzano six-step process for learning vocabulary.\n• Selects activities that engage, reinforce, and assess participants’ grasp of personal finance\nvocabulary.\n• Participants are able to make suggestions to rectify money mistakes and explain criteria for\nfinding knowledgeable financial mentors/advisors.\n• Participants not only are able to identify economic trends and policies, they can explain\nand act upon the effects those trends may have on one’s own personal finances.\nFramework for Teaching\nPersonal Finance\n20\n\nProficient\n• The Financial Education Instructor develops lesson plans and units that reflect an\nunderstanding of the content of financial capability including the key financial touchpoints:\nfinancial psychology, savings, investing, income, career, entrepreneurship, credit, debt, loans,\nrisk management, and insurance.\n• The Financial Education Instructor develops lesson plans and units that reflect an\nunderstanding of the financial psychology of financial capability including: hierarchy of\nneeds, impact of emotions and behaviors, influencers, positive behaviors, and changes in\nbehavior.\n• The Financial Education Instructor uses the Transtheoretical Model of Behavior Change\nand participants can identify the six stages: precontemplation, contemplation, preparation,\naction, maintenance, and termination.\n•", "created_at": "2026-01-03"}
{"id": "6b121bd6-4a73-4483-ab29-f8372bdfa6cb", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 24, "text": "ation Instructor uses the Transtheoretical Model of Behavior Change\nand participants can identify the six stages: precontemplation, contemplation, preparation,\naction, maintenance, and termination.\n• Financial Education Instructor can identify important concepts of the discipline and their\nrelationships to one another.\n• Financial Education Instructor illustrates the concept of financial blinkers and describes\nstrategies to offset financial decision-making errors.\n• Financial Education Instructor provides clear explanations of the content.\n• Instructional strategies in unit and lesson plans are entirely suitable to the content.\n• Ensures that participants have thorough knowledge of the following finance-related\nmathematical concepts, which may include: calculating monthly interest, calculating lease\npayments, calculating return on investment, calculating net present value, and using the\nconcept of time value of money and finding interest for daily, monthly, quarterly, and annual\ncompounding terms.\n• Introduces practical, relevant personal finance terms, especially concepts of behavioral\nliteracy and conscious spending.\n• Participants are able to identify the common money mistakes that people make.\n• Participants are able to identify economic trends and policies and their impact on their\npersonal financial situations.\nFramework for Teaching\nPersonal Finance\n21\n\nBasic\n• Financial Education Instructor does not focus on a specific financial product but covers\nonly a few of the ke", "created_at": "2026-01-03"}
{"id": "aaa0f2e7-081e-49d2-bccb-929246eb43f6", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 25, "text": "n their\npersonal financial situations.\nFramework for Teaching\nPersonal Finance\n21\n\nBasic\n• Financial Education Instructor does not focus on a specific financial product but covers\nonly a few of the key financial touchpoints.\n• The Financial Education Instructor plans touch on financial psychology; however, the scope\ncovered is limited.\n• The Financial Education Instructor understanding of the discipline is rudimentary.\n• Financial Education Instructor knowledge of prerequisite relationships is inaccurate or\nincomplete.\n• Lesson and unit plans use limited instructional strategies, and some are not suitable to the\ncontent.\nUnsatisfactory\n• The Financial Education Instructor focuses on a specific financial product or a few of the\nkey financial touchpoints.\n• The Financial Education Instructor ignores or plays down the financial psychology aspects\nof Financial Capability.\n• Financial Education Instructor makes content errors.\n• Financial Education Instructor does not consider prerequisite relationships when planning.\n• Financial Education Instructor plans use inappropriate strategies for the discipline.\nFramework for Teaching\nPersonal Finance\n22\n\n1b: Demonstrating knowledge of participants’ cognitive abilities,\nwillingness to change, motivating factors, and interests.\nUnsatisfactory\nFinancial Education Instructor displays minimal understanding of how participants\nlearn and little knowledge of their varied approaches to learning, knowledge and\nskills, special needs, interests, and", "created_at": "2026-01-03"}
{"id": "4c2023e2-c6a5-4e26-a1ed-6bb44e59731c", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 26, "text": "Financial Education Instructor displays minimal understanding of how participants\nlearn and little knowledge of their varied approaches to learning, knowledge and\nskills, special needs, interests, and cultural heritage. Instructor does not grasp the\nvalue of such knowledge.\nBasic\nFinancial Education Instructor displays generally accurate knowledge of how\nparticipants learn and of their varied approaches to learning, knowledge and skills,\nspecial needs, interests, and cultural heritage; instructor may apply this knowledge\nnot just to individual participants but to the class as a whole.\nProficient\nFinancial Education Instructor understands the active nature of participant learning\nand attains information about levels of development for groups of participants.\nInstructor purposefully acquires knowledge from several sources about groups of\nparticipants’ varied approaches to learning, knowledge and skills, special needs,\ninterests, and cultural heritage.\nDistinguished\nThe classroom/web-based culture is a cognitively busy place, characterized by a shared\nbelief in the importance of learning. The Financial Education Instructor conveys high\nexpectations for learning by all participants and insists on hard work; participants\nassume responsibility for high- quality learning by initiating improvements, making\nrevisions, adding detail, and/or assisting peers in their precise use of language.\nFramework for Teaching\nPersonal Finance\n23\n\nDistinguished\n• Participants in financial education p", "created_at": "2026-01-03"}
{"id": "d4f8245d-6229-444f-9448-3d8cdd751859", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 27, "text": "mprovements, making\nrevisions, adding detail, and/or assisting peers in their precise use of language.\nFramework for Teaching\nPersonal Finance\n23\n\nDistinguished\n• Participants in financial education programs reflect on cultural and family heritage to\nidentify their financial influencers and the beliefs and values they learned about money.\n• Financial Education Instructor facilitates data collection and reflection.\n• The Financial Education Instructor incorporates multiple intelligence theories and various\nparticipant interests into lesson plans.\n• The Financial Education Instructor incorporates advanced and corrective material into\nlesson plans to accommodate different ability levels in the class.\n• Financial Education Instructor uses ongoing methods to assess participants’ skill levels\nand design instruction accordingly.\n• Financial Education Instructor maintains a system of updated participant records and\nincorporates medical and/or learning needs into lesson plans.\nProficient\n• The Financial Education Instructor gathers formal and informal information about\nparticipants’ cultural and family heritage to use in planning instruction.\n• Financial Education Instructor has a good idea of the range of participant interests in the\nclass and uses some multiple intelligence techniques.\n• Financial Education Instructor has identified groups of participants within the class based\non their learning needs.\n• The Financial Education Instructor understands differing levels of participant", "created_at": "2026-01-03"}
{"id": "27f0c3a3-d258-4b9c-b769-03c19d6c1a47", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 28, "text": "• Financial Education Instructor has identified groups of participants within the class based\non their learning needs.\n• The Financial Education Instructor understands differing levels of participant cognitive\ndevelopment.\n• Financial Education Instructor is aware of the special needs represented by participants in\nthe class.\n• Financial Education Instructor uses appropriate measurements for quantifying knowledge\nand cognitive abilities.\nFramework for Teaching\nPersonal Finance\n24\n\nBasic\n• Financial Education Instructor recognizes that children and adults have different cultural\nand family backgrounds but rarely draws on their contributions or differentiates materials\nto accommodate differences.\n• Financial Education Instructor is aware of different interests among the class but tends to\nteach to the whole group.\n• The Financial Education Instructor is aware of the different ability levels in the class but\ntends to teach to the whole group.\n• Financial Education Instructor cites developmental theory but does not seek to integrate\ntheory into lesson planning.\n• The Financial Education Instructor is aware of some participants’ medical issues and\nlearning disabilities, but does not seek to understand the implications of those disabilities.\nUnsatisfactory\n• Financial Education Instructor is unaware of participants’ cultural and family heritage and\nits effect on financial beliefs and values.\n• Financial Education Instructor does not try to ascertain varied participant interests.\n•", "created_at": "2026-01-03"}
{"id": "8a88e4d5-f24e-4782-9944-d77ba0a55295", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 29, "text": "tor is unaware of participants’ cultural and family heritage and\nits effect on financial beliefs and values.\n• Financial Education Instructor does not try to ascertain varied participant interests.\n• Financial Education Instructor does not try to ascertain varied ability levels among\nparticipants in the class.\n• Financial Education Instructor understands neither developmental theory nor pedagogy/\nandragogy.\n• Financial Education Instructor takes no responsibility to learn about participants’ medical\nor learning disabilities.\nFramework for Teaching\nPersonal Finance\n25\n\n1c: Setting instructional outcomes and financial behavior objectives.\nUnsatisfactory\nThe outcomes expected by the Financial Education Instructor represent low\nexpectations for participants and lack of rigor, and not all of the outcomes reflect\nimportant learning in the discipline. They are stated as participant activities, rather\nthan as outcomes for learning.\nOutcomes reflect only one type of learning and only one discipline or strand and are\nsuitable for only some of the participants.\nBasic\nOutcomes represent moderately high expectations and rigor.\nSome reflect important learning in the discipline and consist of a combination of\noutcomes and activities. Outcomes reflect several types of learning, but the Financial\nEducation Instructor has made no effort at coordination or integration.\nOutcomes, based on global assessments of participant learning, are suitable for most\nof the participants in the class.\nProficie", "created_at": "2026-01-03"}
{"id": "6c514447-2e5f-4d2e-9c3f-cb7350d8a533", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 30, "text": "Education Instructor has made no effort at coordination or integration.\nOutcomes, based on global assessments of participant learning, are suitable for most\nof the participants in the class.\nProficient\nMost outcomes represent rigorous and important learning in the discipline and are\nclear, written in the form of participant learning, and suggest viable methods of\nassessment.\nOutcomes reflect several different types of learning and opportunities for coordination,\nand they are differentiated as necessary to suit different participant groups.\nDistinguished\nAll outcomes represent high-level learning in the discipline. They are clear, written in\nthe form of participant learning, and permit viable assessment methods.\nOutcomes reflect several different types of learning and, where appropriate, represent\nboth coordination and integration. Outcomes are differentiated as necessary to suit\nindividual participants.\nFramework for Teaching\nPersonal Finance\n26\n\nDistinguished\n• The outcome of the financial education program must be financial capability with an\nage-appropriate knowledge of financial content and psychology and positive behavior\ndevelopment and/or modification.\n• The outcomes of the financial education program are written in terms of what participants\nwill learn and do both today and in the future and are scaffolded for different learning needs.\n• Outcomes represent a range of types of learning and are differentiated throughout the lesson\nto encourage individual participants t", "created_at": "2026-01-03"}
{"id": "69562181-3c4b-4fd5-a0bb-10279b20a76e", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 31, "text": "and in the future and are scaffolded for different learning needs.\n• Outcomes represent a range of types of learning and are differentiated throughout the lesson\nto encourage individual participants to take educational risks.\n• Participants in the class will continue with their financial education and advocate for personal\nfinancial education in their communities.\nProficient\n• Outcomes represent high expectations of financial capability.\n• The outcomes of the financial education program are written in terms of what participants\nwill learn and do both today and in the future, and are suitable for all participants in class.\n• Outcomes represent a range of types: factual knowledge, conceptual understanding, reasoning,\nsocial interaction, management, and communication.\n• Participants in the class express a desire to continue their financial education.\nBasic\n• An outcome represents some knowledge of financial content and psychology and some\nbehavior development and/or modification.\n• Outcomes are focused on learning that is suitable for most of the class.\n• Outcomes are suitable for most of the participants in the class.\n• Participants in the class may continue their financial education.\nUnsatisfactory\n• Outcomes represent a mixture of low expectations and rigor.\n• Outcomes are unclear or are stated solely as activities.\n• Outcomes are not suitable for many participants in the class.\n• Participants in the class are indifferent to continuing their financial education.\nFramework for", "created_at": "2026-01-03"}
{"id": "49fc5262-0337-427e-a369-8b53bee4256f", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 32, "text": "r or are stated solely as activities.\n• Outcomes are not suitable for many participants in the class.\n• Participants in the class are indifferent to continuing their financial education.\nFramework for Teaching\nPersonal Finance\n27\n\n1d: Demonstrating knowledge of resources.\nUnsatisfactory\nFinancial Education Instructor is unaware of resources to assist participant learning\nbeyond materials provided by the school, district or sponsoring organization; nor\nis Financial Education Instructor aware of resources for expanding one’s own\nprofessional skill.\nBasic\nFinancial Education Instructor displays some awareness of resources beyond those\nprovided by the school or district for use in classroom/technology-based forums or\nthose provided by the sponsoring organization. Instructor has some awareness of\nresources for extending one’s professional skill but does not seek to expand this\nknowledge.\nProficient\nFinancial Education Instructor displays awareness of resources beyond those\nprovided by the school, district, or sponsoring organization, including those on the\nInternet and those available for extending one’s professional skill; Instructor seeks\nout such resources.\nDistinguished\nFinancial Education Instructor exhibits extensive knowledge of resources for use\nin classroom/technology-based forums and for extending one’s professional skill,\nincluding those available through the school, district, or sponsoring organization,\nin the community, through professional organizations and universit", "created_at": "2026-01-03"}
{"id": "8b754366-d886-48d2-ab13-6f4d8169302a", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 33, "text": "orums and for extending one’s professional skill,\nincluding those available through the school, district, or sponsoring organization,\nin the community, through professional organizations and universities, and on the\nInternet.\nFramework for Teaching\nPersonal Finance\n28\n\nDistinguished\n• A distinguished Financial Education Instructor seeks out diverse materials available\nthrough a wide variety of academic and financial channels.\n• The Financial Education Instructor uses exemplary financial materials and curriculum from\nprofessional sources and maintains a log of resources for participant reference.\n• The Financial Education instructor facilitates participants’ contact with resources outside\nthe classroom/technology-based forum.\n• Financial Education Instructor brings highly qualified experts to the class.\n• Financial Education Instructor has ongoing relationships with academic and professional\norganizations to access various resources to support participant learning.\nProficient\n• Financial Education Instructor makes use of all available resources, including: formal\ntextbooks, more informal reading material, software, games, Internet-based games, guest\nspeakers, field experiences, lectures, etc.\n• The Financial Education Instructor is well-versed in age-appropriate literature and materials\nfor a variety of different types of learners and consults both print and multidisciplinary\nand technology-based resources addressing current trends in practice and information\ntechnology.\n• The", "created_at": "2026-01-03"}
{"id": "8e8b6a33-2d74-4d9a-8ea9-0ee91c181da3", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 34, "text": "erials\nfor a variety of different types of learners and consults both print and multidisciplinary\nand technology-based resources addressing current trends in practice and information\ntechnology.\n• The Financial Education Instructor supplements selected texts with guest speakers and\nfield experiences.\n• Financial Education Instructor expands knowledge through options offered by universities,\nprofessional learning groups, and organizations; and pursues apprenticeships to increase\nfinancial knowledge.\nFramework for Teaching\nPersonal Finance\n29\n\nBasic\n• Financial Education Instructor uses academic resources, rather than just relying on sales\nmaterial provided by purveyors of financial products or materials provided by the district\nor sponsoring organization.\n• The Financial Education Instructor consults some print and/or electronic resources\naddressing current trends in practice and information technology.\n• Financial Education Instructor participates in content-area workshops offered by the school\nor sponsoring organization, but does not pursue other professional development.\nUnsatisfactory\n• Financial Education Instructor uses only sales material provided by purveyors of financial\nproducts or materials provided by the district or sponsoring organization, even when more\nvariety would assist some participants.\n• Although aware of some participant needs, Financial Education Instructor does not inquire\nabout possible resources.\n• Financial Education Instructor does not seek out res", "created_at": "2026-01-03"}
{"id": "9bb27dd5-214d-44b7-b1f6-1ab82ce946aa", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 35, "text": "d assist some participants.\n• Although aware of some participant needs, Financial Education Instructor does not inquire\nabout possible resources.\n• Financial Education Instructor does not seek out resources available to expand his/her own\nskill.\nFramework for Teaching\nPersonal Finance\n30\n\n1e: Designing coherent instruction.\nUnsatisfactory\nLearning activities designed by Financial Education Instructor are poorly aligned\nwith the instructional outcomes, do not follow an organized progression, are not\ndesigned to engage participants in active intellectual activity, and have unrealistic\ntime allocations. Instructional groups are not suitable to the activities and offer no\nvariety.\nBasic\nSome of the learning activities and materials provided by Financial Education\nInstructor are aligned with the instructional outcomes and represent moderate\ncognitive challenge, but with no differentiation for different participants.\nInstructional groups partially support the activities, with some variety. The lesson or\nunit has a recognizable structure; but the progression of activities is uneven, with\nonly some reasonable time allocations.\nProficient\nMost of the learning activities provided by Financial Education Instructor are aligned\nwith the instructional outcomes and follow an organized progression suitable to\ngroups of participants. The learning activities have reasonable time allocations; they\nrepresent significant cognitive challenge, with some differentiation for different\ngroups of parti", "created_at": "2026-01-03"}
{"id": "4fa5f87d-1552-4945-8d06-026a01f254c9", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 36, "text": "on suitable to\ngroups of participants. The learning activities have reasonable time allocations; they\nrepresent significant cognitive challenge, with some differentiation for different\ngroups of participants and varied use of instructional groups.\nDistinguished\nThe sequence of learning activities follows a coherent sequence, is aligned with\ninstructional goals, and is designed to engage participants in high-level cognitive activity.\nThe activities are appropriately differentiated for individual learners. Instructional groups\nare varied appropriately, with some opportunity for participant choice.\nFramework for Teaching\nPersonal Finance\n31\n\nDistinguished\n• The financial education program provides opportunities for participant choices while\nensuring that all financial capability concepts are covered.\n• The Financial Education Instructor uses instructional maps, visual tools, planned learning\ngroups, multiple intelligence activities, and resources that are differentiated for participants’\nunique learning needs.\n• Learning experiences connect to other disciplines and are organized to maximize learning\nand build on participant strengths.\n• The Financial Education Instructor selects lessons/activities that move participants to the\nnext level of need.\nProficient\n• The Financial Education Instructor uses lessons that support the instructional outcomes\nand reflect the important concepts of financial capability.\n• Financial Education Instructor provides a variety of appropriately challe", "created_at": "2026-01-03"}
{"id": "f933a4aa-09f4-4403-b51f-80ce63426996", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 37, "text": "Instructor uses lessons that support the instructional outcomes\nand reflect the important concepts of financial capability.\n• Financial Education Instructor provides a variety of appropriately challenging materials\nand resources.\n• The plan for the lesson or unit is well-structured, with reasonable time allocations and\nactivities that provide opportunity for higher-level thinking.\n• The Financial Education Instructor recognizes the level of hierarchy at which participants\nare operating.\n• The Financial Education Instructor applies Maslow’s hierarchy of needs in designing\nlearning activities.\n• The Financial Education Instructor selects lessons/activities that address the current level\nof need.\nBasic\n• Some of the important concepts of financial capability are reflected in the lessons.\n• Learning activities are moderately challenging and suitable, but there is limited variety.\n• Lesson structure is uneven and/or may be unrealistic in terms of time expectations.\nUnsatisfactory\n• Lessons do not reflect the important concepts of financial capability.\n• Learning activities are boring and/or poorly aligned to the instructional goals. Instructional\ngroups do not support learning.\n• Lesson plans are not structured or sequenced and reflect unrealistic expectations.\nFramework for Teaching\nPersonal Finance\n32\n\n1f: Designing participants’ assessments.\nUnsatisfactory\nAssessment procedures are incongruent with instructional outcomes and contain no\ncriteria by which participant performance", "created_at": "2026-01-03"}
{"id": "0663d9bd-b46d-4614-a99c-632b0847cf8d", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 38, "text": "Personal Finance\n32\n\n1f: Designing participants’ assessments.\nUnsatisfactory\nAssessment procedures are incongruent with instructional outcomes and contain no\ncriteria by which participant performance will be assessed.\nFinancial Education Instructor has no plan to incorporate formative assessment into\nthe lesson or unit.\nBasic\nAssessment procedures are partially congruent with instructional outcomes.\nAssessment criteria and standards have been developed, but are unclear. Approach\nto the use of formative assessment is rudimentary, including only some of the\ninstructional outcomes.\nProficient\nAll the instructional outcomes may be assessed by the proposed assessment plan;\nassessment methodologies have been adapted for groups of participants. Assessment\ncriteria and standards are clear. Financial Education Instructor has a well- developed\nstrategy for using summative and formative assessment and has designed particular\napproaches to be used.\nDistinguished\nAll the instructional outcomes may be assessed by the proposed assessment plan, with\nclear criteria for assessing participant work. The plan exhibits evidence of participant\ncontribution to its development. Assessment methodologies have been adapted for\nindividual participants as need has arisen. The approach to using summative and\nformative assessment is well- designed and includes participant as well as Financial\nEducation Instructor use of the assessment information.\nFramework for Teaching\nPersonal Finance\n33\n\nDistinguished\n•", "created_at": "2026-01-03"}
{"id": "ab866722-4a94-4b6f-ae4d-1c75b36f169a", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 39, "text": "formative assessment is well- designed and includes participant as well as Financial\nEducation Instructor use of the assessment information.\nFramework for Teaching\nPersonal Finance\n33\n\nDistinguished\n• Financial Education Instructor assesses level of financial capability in terms of a priori\ncontent knowledge and post-course content knowledge; and a priori financial beliefs and\npost-course financial beliefs.\n• The post-test is designed to allow comparison of learning outcomes between pre- and\npost-test.\n• Financial Education Instructor-designed assessments are authentic, with real-world\napplication as appropriate.\n• Participants are actively involved in collecting information from summative and formative\nassessments and provide input to the Financial Education Instructor.\n• Lesson plans are immediately modified by the Financial Education Instructor as required\nby the formative assessments.\n• Participants’ results on the national assessment are used by the Financial Education\nInstructor to follow up with each participant and/or modify instruction plans.\n• Concrete follow-up by the Financial Education Instructor with the participants after the\nclass/lesson has ended based on assessment results.\nProficient\n• Financial Education Instructor assesses level of financial capability in terms of both content\nknowledge and financial beliefs.\n• All the learning outcomes have a method for assessment in the pre- and post-tests.\n• The types of assessment used by the Financial Education Instr", "created_at": "2026-01-03"}
{"id": "a7c864e9-074d-42b5-898d-6db465b2e144", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 40, "text": "ms of both content\nknowledge and financial beliefs.\n• All the learning outcomes have a method for assessment in the pre- and post-tests.\n• The types of assessment used by the Financial Education Instructor are suitable to the goal\nof achieving financial capability by each participant.\n• The Financial Education Instructor provides modified assessments for individual participants\nas needed.\n• The formative assessments are designed by the Financial Education Instructor to allow\nhim/her to make shifts in the instructional plan during the course if necessary.\n• The Financial Education Instructor will have participants take one of the many available\nnational assessments on financial capability.\n• The Financial Education Instructor will have a mechanism for assessing participants’\ncontent knowledge and financial behavior after the class/lesson has ended.\nFramework for Teaching\nPersonal Finance\n34\n\nBasic\n• Financial Education Instructor assesses level of financial capability in terms of content\nknowledge only.\n• Only some of the instructional outcomes are addressed in the pre- and post-tests.\n• Assessment criteria are vague.\n• Assessment results are used to design lesson plans for the whole class, not individual\nparticipants.\n• Very modest modification of instructional plans during course is undertaken based on\nassessment results.\n• No use of national assessments.\n• No use of follow-up assessment.\nUnsatisfactory\n• Financial Education Instructor does not assess financial capability.\n•", "created_at": "2026-01-03"}
{"id": "78457bb5-95aa-460b-af4a-ccd3cb6d04ff", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 41, "text": "e is undertaken based on\nassessment results.\n• No use of national assessments.\n• No use of follow-up assessment.\nUnsatisfactory\n• Financial Education Instructor does not assess financial capability.\n• No use of a pre-test to address instructional outcomes.\n• Assessments have no criteria.\n• Assessment results do not affect future plans.\n• No modification of instructional plans during course is undertaken based on assessment\nresults.\n• Disregard of national assessments.\n• Disregard of follow-up assessments.\nFramework for Teaching\nPersonal Finance\n35\n\nDomain 2:\nClassroom\nEnvironment\nFramework for Teaching\nPersonal Finance\n36\n\nFramework Overview: Environment\n2a: Creating an environment of respect and 2c: Managing classroom and/or technologyrapport. based procedures.\nPositive learning experience Effective routines and procedures\nPersonal relationship between instructor Varied groupings\nand participant(s)\nAppropriate materials and supplies\nPositive connections between participants\nInclusive environment of civility and\nsupport\n2d: Managing participant conduct to\nsupport learning process.\nClear conduct behaviors\n2b: Establishing a culture for learning and\nMonitoring of conduct\napplication of financial principles.\nResponse to misbehavior\nImportance of financial literacy concepts\nPsychological and emotional elements of\nfinances\nSound financial aptitude 2e: Organizing physical and/or virtual\nspace.\nLearning and achievement of participants\nAccessibility to learning resources\nAlignment be", "created_at": "2026-01-03"}
{"id": "068952b1-f24e-4c4f-80f2-28678d23bee6", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 42, "text": "ical and emotional elements of\nfinances\nSound financial aptitude 2e: Organizing physical and/or virtual\nspace.\nLearning and achievement of participants\nAccessibility to learning resources\nAlignment between learning activities\nand furniture/resources\nFramework for Teaching\nPersonal Finance\n37\n\n2a: Creating an environment of respect and rapport.\nUnsatisfactory\nPatterns of interactions, both between Financial Education Instructor and participants\nand among participants, are mostly negative, inappropriate, or insensitive to\nparticipants’ ages, cultural backgrounds, and developmental levels. Participant\ninteractions are characterized by sarcasm, put-downs, or conflict. Financial Education\nInstructor does not deal with disrespectful behavior.\nBasic\nPatterns of interactions, both between Financial Education Instructor and\nparticipants and among participants, are generally appropriate but may reflect\noccasional inconsistencies, favoritism, and disregard for participants’ ages, cultures,\nand developmental levels.\nParticipants rarely demonstrate disrespect for one another.\nFinancial Education Instructor attempts to respond to disrespectful behavior, with\nuneven results. The net result of the interactions is neutral, conveying neither warmth\nnor conflict.\nProficient\nInteractions between Financial Education Instructor and participants are friendly\nand demonstrate general caring and respect. Such interactions are appropriate to\nthe ages, cultures, and developmental levels of the participa", "created_at": "2026-01-03"}
{"id": "471f1000-fb8e-4388-ab26-921ad1eedcc8", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 43, "text": "ancial Education Instructor and participants are friendly\nand demonstrate general caring and respect. Such interactions are appropriate to\nthe ages, cultures, and developmental levels of the participants. Interactions among\nparticipants are generally polite and respectful, and participants exhibit respect for\nFinancial Education Instructor. Financial Education Instructor responds successfully\nto disrespectful behavior among participants. The net result of the interactions is\npolite, respectful, and businesslike, although participants may at times be somewhat\ncautious about taking intellectual risks.\nDistinguished\nClassroom interactions between Financial Education Instructor and participants and\namong participants are highly respectful, reflecting genuine warmth and caring and\nsensitivity to participants as individuals. Participants exhibit respect for Financial\nEducation Instructor and contribute to high levels of civility among all members of\nthe class. The net result is an environment where all participants feel valued and are\ncomfortable taking intellectual risks.\nFramework for Teaching\nPersonal Finance\n38\n\nDistinguished\n• Financial Education Instructor demonstrates knowledge and caring about individual\nparticipants’ lives beyond the class and school.\n• There is no disrespectful behavior toward Financial Education Instructor or among\nparticipants.\n• When necessary, participants respectfully correct one another in their conduct towards\nother participants.\n• Participants eng", "created_at": "2026-01-03"}
{"id": "873f9047-f553-4e9c-ba06-8b85b9ba9586", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 44, "text": "ul behavior toward Financial Education Instructor or among\nparticipants.\n• When necessary, participants respectfully correct one another in their conduct towards\nother participants.\n• Participants engage without fear of put-downs or ridicule either from the Financial\nEducation Instructor or from other participants.\n• Financial Education Instructor respects and encourages participants’ efforts and supports\nthe development of clear financial plans.\n• Financial Education Instructor shows empathy for participants’ experience and builds\npositive emotions in participants.\nProficient\n• Talk between Financial Education Instructor and participants and among participants is\nuniformly respectful.\n• Financial Education Instructor successfully responds to disrespectful behavior among\nparticipants.\n• Participants engage willingly, but may at times be hesitant to offer their ideas in front of\nclassmates.\n• Financial Education Instructor builds rapport and connection with individual participants\nby sharing personal stories and experiences (as appropriate), using positive language and\ntone, and communicating in a benefit-oriented manner.\n• Participants and the Financial Education Instructor exhibit respect for one another.\nFinancial Education Instructor addresses stressful financial topics tactfully.\nFramework for Teaching\nPersonal Finance\n39\n\nBasic\n• The quality of interactions between Financial Education Instructor and participants, or\namong participants, is uneven, with occasional disrespe", "created_at": "2026-01-03"}
{"id": "916a45ec-de0b-4f49-8ab0-5d915f9ac9b1", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 45, "text": "lly.\nFramework for Teaching\nPersonal Finance\n39\n\nBasic\n• The quality of interactions between Financial Education Instructor and participants, or\namong participants, is uneven, with occasional disrespect or insensitivity.\n• Financial Education Instructor attempts to respond to disrespectful behavior among\nparticipants, with uneven results.\n• Financial Education Instructor attempts to make connections with individual participants,\nbut participant reactions indicate that these attempts are not entirely successful.\nUnsatisfactory\n• Financial Education Instructor is disrespectful towards participants or insensitive to\nparticipants’ ages, cultural backgrounds, and developmental levels.\n• Participants’ body language indicates feelings of hurt, discomfort, or insecurity.\n• Financial Education Instructor displays no familiarity with, or caring about, individual\nparticipants.\n• Financial Education Instructor disregards disrespectful interactions among participants.\nFramework for Teaching\nPersonal Finance\n40\n\n2b: Establishing a culture for learning and application of financial\nprinciples.\nUnsatisfactory\nThe classroom/web-based learning culture is characterized by a lack of Financial\nEducation Instructor or participant commitment to learning, and/or little or no\ninvestment of participant energy in the task at hand. Hard work is not expected or\nvalued. Medium to low expectations for participant achievement are the norm, with\nhigh expectations for learning reserved for only one or two part", "created_at": "2026-01-03"}
{"id": "045ed37d-4ec9-4bff-9870-0e3f04a01afe", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 46, "text": "rgy in the task at hand. Hard work is not expected or\nvalued. Medium to low expectations for participant achievement are the norm, with\nhigh expectations for learning reserved for only one or two participants.\nBasic\nThe classroom/web-based learning culture is characterized by only moderate\ncommitment to learning by Financial Education Instructor or participants. The\nFinancial Education Instructor appears to be only “going through the motions,” and\nparticipants indicate that they are interested in the completion of a task rather than\nthe quality of the work. Financial Education Instructor conveys that participant success\nis the result of natural ability rather than hard work and refers only in passing to the\nprecise use of language and financial concepts. High expectations for learning are\nreserved for those participants believed to have a natural aptitude for the subject.\nProficient\nThe culture of the learning environment is one where learning is valued by all, and\nhigh expectations for both learning and hard work are the norm for most participants.\nParticipants understand their role as learners and consistently expend effort to learn.\nClassroom/web-based learning technology interactions support learning and hard\nwork and the precise use of relevant language.\nDistinguished\nThe classroom/web-based learning culture is a cognitively busy place, characterized\nby a shared belief in the importance of learning. The Financial Education Instructor\nconveys high expectations for learnin", "created_at": "2026-01-03"}
{"id": "b50af7d5-0634-4b83-a6f2-bd7c414b64dd", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 47, "text": "assroom/web-based learning culture is a cognitively busy place, characterized\nby a shared belief in the importance of learning. The Financial Education Instructor\nconveys high expectations for learning by all participants and insists on hard work;\nparticipants assume responsibility for high quality by initiating improvements,\nmaking revisions, adding detail, and/or assisting peers in precise use of language.\nFramework for Teaching\nPersonal Finance\n41\n\nDistinguished\n• Financial Education Instructor communicates passion for the subject and confidence in\nparticipants’ ability to master the content.\n• Financial Education Instructor conveys the satisfaction that accompanies a deep\nunderstanding of complex content.\n• Participants indicate through their questions and comments a desire to understand the\ncontent.\n• Participants assist their classmates to understand the content.\n• Participants take initiative to improve the quality of their work.\n• Participants actively seek new, positive influencers to guide their financial decisions.\n• Participants respectfully correct one another in their use of financial concepts and language.\n• Participants willingly take primary responsibility for their own financial capability.\nParticipants establish ongoing relationships with trusted financial coaches/mentors.\nProficient\n• Financial Education Instructor communicates the impact and benefits of mastering financial\ncapability skills.\n• Financial Education Instructor demonstrates a high regard for", "created_at": "2026-01-03"}
{"id": "b9fb10bf-5d5a-4b5a-bedb-39c82d81aa14", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 48, "text": "hes/mentors.\nProficient\n• Financial Education Instructor communicates the impact and benefits of mastering financial\ncapability skills.\n• Financial Education Instructor demonstrates a high regard for participants’ abilities and\nuses the Transtheoretical Model of Behavior Change to support their progress.\n• Financial Education Instructor conveys an expectation of high levels of participant ability\nto change and grow in financial skills.\n• Participants expend good effort to complete work of high quality.\n• Financial Education Instructor insists on precise use of language by participants.\n• Qualified Financial Education Instructor demonstrates the effect of influencers (family,\neducation, role models, environment, and advertising) in financial decision-making.\n• Financial Education Instructor elicits concrete values/goals/dreams participants can use to\ncounteract negative influencers.\n• Financial Education Instructor conveys what it means for participants to take primary\nresponsibility for their own financial capability.\n• Financial Education Instructor demonstrates the value of finding a trustworthy, qualified\ncoach/mentor for ongoing financial advice.\nFramework for Teaching\nPersonal Finance\n42\n\nBasic\n• Financial Education Instructor energy for the work is neutral, neither indicating a high level\nof commitment nor ascribing the need to do the work to external forces.\n• Financial Education Instructor conveys high expectations for only some participants.\n• Participants exhibit a", "created_at": "2026-01-03"}
{"id": "cda69037-582f-43da-946c-47540d4209f4", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 49, "text": "ng a high level\nof commitment nor ascribing the need to do the work to external forces.\n• Financial Education Instructor conveys high expectations for only some participants.\n• Participants exhibit a limited commitment to complete the work on their own; many\nparticipants indicate that they are looking for an easy path.\n• Financial Education Instructor primary concern appears to be to complete the task at hand.\n• Financial Education Instructor urges, but does not insist, that participants use precise\nlanguage.\nUnsatisfactory\n• Financial Education Instructor conveys that there is little or no purpose for the work, or\nthat the reasons for doing it are driven by external factors.\n• Financial Education Instructor conveys to at least some participants that the work is too\nchallenging for them.\n• Participants exhibit little or no pride in their work.\n• Participants use language incorrectly; Financial Education Instructor does not correct them.\nFramework for Teaching\nPersonal Finance\n43\n\n2c: Managing classroom and/or technology-based procedures.\nUnsatisfactory\nMuch instructional time is lost due to inefficient classroom routines and procedures.\nThere is little or no evidence of Financial Education Instructor managing instructional\ngroups and transitions and/or effective handling of materials and supplies. There is\nlittle evidence that participants know or follow established routines.\nBasic\nSome instructional time is lost due to only partially effective classroom/web-based\ntechnology", "created_at": "2026-01-03"}
{"id": "105e50ce-1870-4a39-a262-87d48ad4d205", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 50, "text": "ials and supplies. There is\nlittle evidence that participants know or follow established routines.\nBasic\nSome instructional time is lost due to only partially effective classroom/web-based\ntechnology routines and procedures.\nFinancial Education Instructor management of instructional groups and transitions\nand/or handling of materials and supplies is inconsistent, leading to some disruption\nof learning. With regular guidance and prompting, participants follow established\nroutines.\nProficient\nThere is little loss of instructional time because learning environment routines and\nprocedures are effective.\nFinancial Education Instructor management of instructional groups and transitions\nand/or handling of materials and supplies is consistently successful. With minimal\nguidance and prompting, participants follow established learning routines.\nDistinguished\nInstructional time is maximized due to efficient and seamless classroom routines and\nprocedures. Participants take initiative in the management of instructional groups\nand transitions and/or the handling of materials and supplies.\nRoutines are well-understood and may be initiated by participants.\nFramework for Teaching\nPersonal Finance\n44\n\nDistinguished\n• With minimal prompting by Financial Education Instructor, participants ensure that their\ntime is used productively.\n• Participants take initiative in distributing and collecting materials efficiently.\n• Participants themselves ensure that transitions and other routines are accompl", "created_at": "2026-01-03"}
{"id": "b764731d-047c-439d-bb2b-74f3c21e3936", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 51, "text": "t their\ntime is used productively.\n• Participants take initiative in distributing and collecting materials efficiently.\n• Participants themselves ensure that transitions and other routines are accomplished\nsmoothly.\n• Classroom routines function seamlessly; Financial Education Instructor demonstrates\nability to shift smoothly between individual, paired, cooperative, and whole-class methods.\n• Financial Education Instructor stays current with most prevalent psychological, sociological,\nand economic theories underpinning behavior change models, and how those models apply\nto teaching financial behavior.\n• Financial Education Instructor involves participants in developing procedures for accessing\ntext-on-screen, audio/video lectures, and game-based learning.\nProficient\nParticipants are productively engaged during small-group or independent work.\n• Transitions between large- and small-group activities are smooth.\n• Routines for distribution and collection of materials and supplies work efficiently.\n• Classroom routines function smoothly; Financial Education Instructor adjusts course\nformat/length to meet participant needs.\n• Financial Education Instructor uses consistent education model as a framework for\ninstruction.\n• Transitions between in-class and web-based instruction are smooth.\n• Financial Education Instructor implements procedures for accessing text-on-screen, audio/\nvideo lectures, and game-based learning.\nFramework for Teaching\nPersonal Finance\n45\n\nBasic\n• Participants", "created_at": "2026-01-03"}
{"id": "94da9de9-a9e6-4327-9c14-7f987e0a9456", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 52, "text": ".\n• Financial Education Instructor implements procedures for accessing text-on-screen, audio/\nvideo lectures, and game-based learning.\nFramework for Teaching\nPersonal Finance\n45\n\nBasic\n• Participants who are not working directly with Financial Education Instructor are only\npartially engaged.\n• Procedures for transitions seem to have been established, but their operation is not smooth.\n• There appear to be established routines for distribution and collection of materials, but\nparticipants are confused about how to carry them out.\n• Classroom routines function unevenly.\nUnsatisfactory\n• Participants who are not working with Financial Education Instructor are not productively\nengaged.\n• Transitions are disorganized, with much loss of instructional time.\n• There appear to be no established procedures for distributing and collecting materials.\n• A considerable amount of time is spent off-task because procedures are unclear.\nFramework for Teaching\nPersonal Finance\n46\n\n2d: Managing participant conduct to support learning process.\nUnsatisfactory\nThere appear to be no established standards of conduct, or participants challenge\nthe standards. There is little or no participant behavior monitoring by Financial\nEducation Instructor, and response to participants’ misbehavior is repressive or\ndisrespectful of participant dignity.\nBasic\nStandards of conduct appear to have been established, but their implementation\nis inconsistent. Financial Education Instructor tries, with uneven results, to", "created_at": "2026-01-03"}
{"id": "30c82a27-bf1c-42a4-9129-957eddb3ba90", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 53, "text": "isrespectful of participant dignity.\nBasic\nStandards of conduct appear to have been established, but their implementation\nis inconsistent. Financial Education Instructor tries, with uneven results, to monitor\nparticipant behavior and respond to participant misbehavior.\nProficient\nParticipant behavior is generally appropriate. Financial Education Instructor monitors\nparticipant behavior against established standards of conduct. Financial Education\nInstructor response to participant misbehavior is consistent, proportionate, respectful\nto participants, and effective.\nDistinguished\nParticipant behavior is entirely appropriate. Participants take an active role in\nmonitoring their own and other participants’ behavior against standards of conduct.\nFinancial Education Instructor monitoring of participant behavior is subtle and\npreventive. Financial Education Instructor response to participant misbehavior is\nsensitive to individual needs and respects participants’ dignity.\nFramework for Teaching\nPersonal Finance\n47\n\nDistinguished\n• Participant behavior is entirely appropriate; any participant misbehavior is minor and swiftly\nhandled.\n• Financial Education Instructor silently and subtly monitors participant behavior.\n• Participants respectfully intervene with other participants at appropriate moments to ensure\ncompliance with standards of conduct.\n• Financial Education Instructor weaves participants’ experiences (goals, dreams, challenges,\nand motivators) into lessons.\nProficient\n• Sta", "created_at": "2026-01-03"}
{"id": "9bb370b3-a2cb-4e3c-87fd-f25c0b3e6cb4", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 54, "text": "ate moments to ensure\ncompliance with standards of conduct.\n• Financial Education Instructor weaves participants’ experiences (goals, dreams, challenges,\nand motivators) into lessons.\nProficient\n• Standards of conduct appear to have been established and implemented successfully.\n• Overall, participant behavior is generally appropriate.\n• Financial Education Instructor frequently monitors participant behavior and level of\nengagement through real-time feedback (hands raised, body language, and questions asked).\n• Financial Education Instructor response to participant misbehavior is effective.\n• Financial Education Instructor often demonstrates understanding of participants’ experience\n(goals, dreams, challenges, and motivators).\nBasic\n• Financial Education Instructor attempts to maintain order in the classroom/web-based\nenvironment, referring to rules, but with uneven success.\n• Financial Education Instructor attempts to keep track of participant behavior, but with no\napparent system.\n• Financial Education Instructor response to participant misbehavior is inconsistent: sometimes\nharsh, other times lenient.\nUnsatisfactory\n• The classroom/web-based environment is chaotic, with no standards of conduct evident.\n• Financial Education Instructor does not monitor participant behavior.\n• Some participants disrupt the classroom, without apparent Financial Education Instructor\nawareness or with an ineffective response.\nFramework for Teaching\nPersonal Finance\n48\n\n2e: Organizing physical a", "created_at": "2026-01-03"}
{"id": "02264b57-d565-4226-bbc7-ee4aff03874d", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 55, "text": "ome participants disrupt the classroom, without apparent Financial Education Instructor\nawareness or with an ineffective response.\nFramework for Teaching\nPersonal Finance\n48\n\n2e: Organizing physical and/or virtual space.\nUnsatisfactory\nThe classroom/web-based learning environment is unsafe, or learning is inaccessible\nto many participants. There is poor alignment between the arrangement of furniture\nand resources, including computer technology, and the lesson activities.\nBasic\nThe classroom/web-based learning environment is mostly safe and essential learning\nis accessible to most participants. Financial Education Instructor makes modest use\nof physical resources, including computer technology. Financial Education Instructor\nattempts to adjust the classroom furniture for a lesson, adjust the lesson to the\nfurniture, or utilize required computer technology if necessary, but with limited\neffectiveness.\nProficient\nThe classroom/web-based learning environment is safe for all, and participants have\nequal access to learning activities.\nFinancial Education Instructor ensures that the furniture arrangement is appropriate\nto the learning activities and uses physical resources, including computer technology,\neffectively.\nDistinguished\nThe classroom/web-based learning environment is safe, and learning is accessible\nto all participants, including those with special needs. Financial Education Instructor\nmakes effective use of physical resources, including computer technology. Financial\nEdu", "created_at": "2026-01-03"}
{"id": "d0fcb9b6-eb70-43fc-8314-7338cf531793", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 56, "text": "d learning is accessible\nto all participants, including those with special needs. Financial Education Instructor\nmakes effective use of physical resources, including computer technology. Financial\nEducation Instructor ensures that the physical arrangement, as well as computer\ntechnology, is appropriate to the learning activities. Participants contribute to the\nuse or adaptation of the physical/web-based environment to advance learning.\nFramework for Teaching\nPersonal Finance\n49\n\nDistinguished\n• Modifications are made to the physical or web-based learning environment to accommodate\nparticipants with special needs.\n• There is total alignment between the learning activities and the classroom or web-based\nenvironment.\n• Participants take the initiative to adjust the physical environment or web-based learning\nenvironment to better suit their learning.\n• Financial Education Instructor and participants make extensive and imaginative use of\navailable technology.\nProficient\n• The classroom is safe and/or web-based learning environment is accessible, and all\nparticipants are able to see and hear.\n• The classroom or web-based environment is arranged to support the instructional goals and\nlearning activities.\n• Financial Education Instructor makes appropriate use of available technology to enhance\nlearning.\n• Financial Education Instructor utilizes non-lecture-based teaching methods, and selects\nactivities that engage participants beyond worksheets.\nBasic\n• The physical environment is sa", "created_at": "2026-01-03"}
{"id": "d669bfc1-d642-4735-899b-b60f36e975aa", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 57, "text": "nhance\nlearning.\n• Financial Education Instructor utilizes non-lecture-based teaching methods, and selects\nactivities that engage participants beyond worksheets.\nBasic\n• The physical environment is safe or web-based learning environment is accessible, and most\nparticipants can see and hear.\n• The classroom or web-based environment is not an impediment to learning but does not\nenhance it.\n• Financial Education Instructor makes limited use of available technology and other resources.\nUnsatisfactory\n• There are physical hazards in the classroom, endangering participant safety or access to webbased learning access.\n• Many participants can’t see or hear Financial Education Instructor or board/screen.\n• Appropriate technology is not being used, even if it is available and its use would enhance\nthe lesson.\nFramework for Teaching\nPersonal Finance\n50\n\nDomain 3:\nInstruction\nFramework for Teaching\nPersonal Finance\n51\n\nFramework Overview: Delivery of Services\n3a: Communicating with participants about 3d: Using assessment in instruction to\nacquiring or changing financial behaviors. measure behavioral change.\nPurpose for learning Assessment criteria\nExplanation of content and key Monitoring of participant learning\nvocabulary\nQuality feedback to participants\nDirections and procedures\nParticipant self- or peer assessment\nUse of oral and written language\n3e: Demonstrating flexibility and\n3b: Using questioning and discussion responsiveness to participants’ learning\ntechniques that promote posi", "created_at": "2026-01-03"}
{"id": "818f9b64-54ed-4af3-9294-717a415d61cd", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 58, "text": "t self- or peer assessment\nUse of oral and written language\n3e: Demonstrating flexibility and\n3b: Using questioning and discussion responsiveness to participants’ learning\ntechniques that promote positive financial needs.\nbehaviors.\nLesson or activity adjustment\nQuality of questions\nResponse to participants\nDiscussion techniques\nPersistence\nParticipant involvement and commitment\n3c: Engaging participants with relevant\nfinancial instruction.\nLearning tasks\nGrouping of participants\nFinancial instructional materials and\nresources\nStructure and pacing\nFramework for Teaching\nPersonal Finance\n52\n\n3a: Communicating with participants about acquiring or changing\nfinancial behaviors.\nUnsatisfactory\nThe instructional purpose of the lesson is unclear to participants, and the directions\nand procedures are confusing. Financial Education Instructor explanation of the\ncontent contains major errors and includes no explanation of strategies participants\nmight use. Financial Education Instructor’s spoken or written language contains\nerrors of grammar or syntax. Financial Education Instructor’s academic vocabulary\nis inappropriate, vague, or used incorrectly, leaving participants confused. The\ninstructor teaches lessons that do not align with participant interests, delivers a\nboring presentation, and lacks communication that elicits behavior acquisition or\nchange.\nBasic\nFinancial Education Instructor’s attempt to explain the instructional purpose has\nonly limited success, and/or directions and p", "created_at": "2026-01-03"}
{"id": "a2ea9c17-fe55-413c-a3de-bb1a1a95aff5", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 59, "text": "d lacks communication that elicits behavior acquisition or\nchange.\nBasic\nFinancial Education Instructor’s attempt to explain the instructional purpose has\nonly limited success, and/or directions and procedures must be clarified after initial\nparticipant confusion. Financial Education Instructor’s explanation of the content\nmay contain minor errors; some portions are clear, others difficult to follow. Financial\nEducation Instructor’s explanation does not invite participants to engage intellectually\nor to understand strategies they might use when working independently.\nFinancial Education Instructor’s spoken language is correct but uses vocabulary that\nis either limited or not fully appropriate to the participants’ ages or backgrounds.\nFinancial Education Instructor rarely takes opportunities to explain academic\nvocabulary. Instructor lacks engagement that elicits behavior acquisition or change.\nProficient\nThe instructional purpose of the lesson is clearly communicated to participants,\nincluding where it is situated within broader learning; directions and procedures are\nexplained clearly and may be modeled. Financial Education Instructor’s explanation\nof content is scaffolded, clear, and accurate and connects with participants’\nknowledge and experience. During the explanation of content, Financial Education\nInstructor focuses, as appropriate, on strategies participants can use when working\nindependently and invites participant intellectual engagement. Financial Education\nInstru", "created_at": "2026-01-03"}
{"id": "239bcc31-e7fa-4f1f-9160-3652174e3845", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 60, "text": "ntent, Financial Education\nInstructor focuses, as appropriate, on strategies participants can use when working\nindependently and invites participant intellectual engagement. Financial Education\nInstructor’s spoken and written language is clear and correct, suitable to participants’\nages and interests, and moves them to take positive action toward financial wellness.\nFinancial Education Instructor’s use of academic vocabulary is precise and serves to\nextend participant understanding while being persuasive in nature and strategically\npromoting the implementation of the lessons into their lives.\nFramework for Teaching\nPersonal Finance\n53\n\n3a: Communicating with participants about acquiring or changing\nfinancial behaviors. (cont.)\nDistinguished\nFinancial Education Instructor links the instructional purpose of the lesson to the\nlarger curriculum; the directions and procedures are clear and anticipate possible\nparticipant misunderstanding. Financial Education Instructor’s explanation of\ncontent is thorough and clear, developing conceptual understanding through\nscaffolding and connecting with participants’ interests. Participants contribute to\nextending the content by explaining concepts to their classmates and suggesting\nstrategies that might be used. Financial Education Instructor’s spoken and written\nlanguage is expressive, and Financial Education Instructor finds opportunities to\nextend participants’ vocabularies both within the discipline and for more general use.\nParticipants", "created_at": "2026-01-03"}
{"id": "c1e25bbf-57aa-4c6d-be5a-b5d10588a110", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 61, "text": "poken and written\nlanguage is expressive, and Financial Education Instructor finds opportunities to\nextend participants’ vocabularies both within the discipline and for more general use.\nParticipants contribute to the correct use of academic vocabulary and are actively\ninvolved in working toward the goal of moving toward financial wellness.\nFinancial Education Instructor has successfully enlisted participants in promoting\nthe implementation of the lessons into their lives.\nFramework for Teaching\nPersonal Finance\n54\n\nDistinguished\n• If asked, participants are able to explain what they are learning and where it fits into the\nlarger curriculum context.\n• Financial Education Instructor explains content clearly and imaginatively, using metaphors\nand analogies to bring content to life.\n• Financial Education Instructor points out possible areas for misunderstanding.\n• Financial Education Instructor invites participants to explain the content to their classmates.\n• Participants suggest other strategies they might use when approaching a challenge or\nanalysis.\n• Financial Education Instructor uses rich language, offering brief vocabulary lessons where\nappropriate, both for general vocabulary and for the discipline.\n• Participants use academic language correctly.\n• Participants are able to effectively utilize and/or implement vocabulary terms provided by\nthe Financial Education Instructor.\n• Participants are able to clearly communicate benefits of acquiring or changing financial\nbehavio", "created_at": "2026-01-03"}
{"id": "c462d33b-eae7-47aa-a922-9437694e4979", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 62, "text": "effectively utilize and/or implement vocabulary terms provided by\nthe Financial Education Instructor.\n• Participants are able to clearly communicate benefits of acquiring or changing financial\nbehaviors with their peers in the classroom and loved ones outside the classroom.\n• The participants are empowered to support their peers because the Financial Education\nInstructor has established a clear instructional framework.\n• The Financial Education Instructor helps develop a culture of peer learning where\nparticipants feel comfortable sharing personal stories.\n• Participants understand the reasons why they want to take action on the financial education\nlessons and begin applying what they learned into their lives.\nFramework for Teaching\nPersonal Finance\n55\n\nProficient\n• Financial Education Instructor states clearly, at some point during the lesson, what the\nparticipants will be learning.\n• If appropriate, Financial Education Instructor models the process to be followed in the task.\n• Participants engage with the learning task, indicating that they understand what they are\nto do.\n• Financial Education Instructor makes no content errors.\n• Financial Education Instructor explanation of content is clear and invites participation and\nthinking.\n• Financial Education Instructor describes specific strategies participants might use, inviting\nparticipants to interpret them in the context of what they’re learning.\n• Financial Education Instructor vocabulary and usage are correct and entirel", "created_at": "2026-01-03"}
{"id": "ed5ca978-64d0-454c-89ce-3f27dd044043", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 63, "text": "ecific strategies participants might use, inviting\nparticipants to interpret them in the context of what they’re learning.\n• Financial Education Instructor vocabulary and usage are correct and entirely suited to the\nlesson, including, where appropriate, explanations of academic vocabulary.\n• Financial Education Instructor vocabulary is appropriate to participants’ ages and\ndevelopmental levels.\n• Financial Education Instructor introduces practical, relevant personal finance terms (can\nemploy Marzano’s six-step process).\n• Financial Education Instructor employs a clear framework for instruction (can employ\nNFEC’s model: motivate, engage, educate, and move to action).\n• Financial Education Instructor builds rapport with participants through active listening\nand sharing personal stories that can help build trust with the audience.\n• Financial Education Instructor addresses multiple intelligences (can employ Gardner’s\nMultiple Intelligences Theory).\n• Financial Education Instructor incorporates persuasion elements and action-driven\nlanguage into lessons (can employ NFEC’s Sales / Persuasion technique: uncover needs\nand goals, build relationship, offer benefit-oriented solution, motivate to action).\n• The Financial Education Instructor helps participants understand the impact of their\nfinances on other areas of their lives: health, happiness, productivity, relationships, security,\nand lifestyle.\nFramework for Teaching\nPersonal Finance\n56\n\nBasic\n• Financial Education Instructor pro", "created_at": "2026-01-03"}
{"id": "1be931f2-037f-43ed-af26-ab791c88a02b", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 64, "text": "finances on other areas of their lives: health, happiness, productivity, relationships, security,\nand lifestyle.\nFramework for Teaching\nPersonal Finance\n56\n\nBasic\n• Financial Education Instructor provides little elaboration or explanation about what the\nparticipants will be learning.\n• Financial Education Instructor must clarify the learning task so participants can complete\nit.\n• Financial Education Instructor makes no serious content errors but may make minor ones.\n• Financial Education Instructor explanation of the content consists of a monologue, with\nminimal participation or intellectual engagement by participants.\n• Financial Education Instructor explanations of content are purely procedural, with no\nindication of how participants can think strategically.\n• Financial Education Instructor vocabulary and usage are correct but unimaginative.\n• When Financial Education Instructor attempts to explain academic vocabulary, the effort is\nonly partially successful.\n• Financial Education Instructor vocabulary is too advanced, or too juvenile, for participants.\nUnsatisfactory\n• At no time during the lesson does Financial Education Instructor convey to participants\nwhat they will be learning.\n• Participants indicate through their questions that they are confused about the learning\ntask.\n• Financial Education Instructor makes a serious content error that will affect participants’\nunderstanding of the lesson.\n• Participants indicate through body language or questions that they don’t", "created_at": "2026-01-03"}
{"id": "8ef63bd6-aba6-4a48-abd4-96c2683b31e8", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 65, "text": "k.\n• Financial Education Instructor makes a serious content error that will affect participants’\nunderstanding of the lesson.\n• Participants indicate through body language or questions that they don’t understand the\ncontent being presented.\n• Financial Education Instructor communications include errors of vocabulary or imprecise\nuse of academic language.\n• Financial Education Instructor vocabulary is inappropriate to participants’ ages or cultures.\nFramework for Teaching\nPersonal Finance\n57\n\n3b: Using questioning and discussion techniques that promote\npositive financial behaviors.\nUnsatisfactory\nFinancial Education Instructor’s questions are of low cognitive challenge, with single\ncorrect responses, and are asked in rapid succession. Instructor does not build rapport\nwith participants or gain a better understanding of whom he/she is teaching.\nInteraction between Financial Education Instructor and participants is predominantly\nrecitation-style, with Financial Education Instructor mediating all questions and answers;\nFinancial Education Instructor accepts all contributions without asking participants to\njustify their reasoning. Only a few participants participate in the discussion.\nBasic\nFinancial Education Instructor’s questions lead participants through a single path of\ninquiry, with answers seemingly determined in advance.\nInstructor does not use questioning for motivational purposes or get to know the\nparticipants on a deeper level. Alternatively, Financial Education Instru", "created_at": "2026-01-03"}
{"id": "69c41605-9c3b-43cb-9363-6063ebb984c7", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 66, "text": "with answers seemingly determined in advance.\nInstructor does not use questioning for motivational purposes or get to know the\nparticipants on a deeper level. Alternatively, Financial Education Instructor attempts to ask\nsome questions designed to engage participants in thinking, but only a few participants\nare involved. Financial Education Instructor attempts to engage all participants in the\ndiscussion, to encourage them to respond to one another, and to explain their thinking,\nwith uneven results.\nProficient\nWhile Financial Education Instructor may use some low- level questions, he or she\nposes questions designed to promote participant thinking and understanding. Instructor\nuses strategic questioning to understand the participants, what motivates them, and\ntheir deeper values. Financial Education Instructor creates genuine discussion among\nparticipants, providing adequate time for participants to respond and stepping aside\nwhen appropriate. Financial Education Instructor challenges participants to justify their\nthinking and successfully engages most participants in the discussion, employing a range\nof strategies to ensure that most participants are heard. Financial Education Instructor’s\nquestions take participants through processes that promote positive financial behaviors.\nDistinguished\nFinancial Education Instructor uses a variety or series of questions or prompts to\nchallenge participants cognitively, advance high-level thinking and discourse, and\npromote metacognition", "created_at": "2026-01-03"}
{"id": "20ccd861-d439-4bda-8c94-f98ac3e77fc8", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 67, "text": "istinguished\nFinancial Education Instructor uses a variety or series of questions or prompts to\nchallenge participants cognitively, advance high-level thinking and discourse, and\npromote metacognition. Through strategic questioning the participants reflect on their\nvalues, lifestyle goals, and dreams that provide reasons for them to take action on the\npersonal finance lesson plans. Participants formulate many questions, initiate topics,\nchallenge one another’s thinking, and make unsolicited contributions. Participants\nthemselves ensure that all voices are heard in the discussion.\nFramework for Teaching\nPersonal Finance\n58\n\nDistinguished\n• Participants initiate higher-order questions.\n• Financial Education Instructor builds on and uses participant responses to questions in\norder to deepen participant understanding.\n• Participants extend the discussion, enriching it.\n• Participants invite comments from their classmates during a discussion and challenge one\nanother’s thinking.\n• Virtually all participants are engaged in the discussion.\n• Participants reflect on Financial Education Instructor questions to gain deeper insight into\nthe emotions, experiences, and personal beliefs they currently have and the changes they\nmust make to reach their financial goals.\n• Participants take the questions posed by the Financial Education Instructor to gain insight\ninto their personal finance goals and behaviors needed to attain those objectives.\n• Participants ask questions that help them beco", "created_at": "2026-01-03"}
{"id": "b81c6eba-ae25-40c4-93e8-311dd0e01c98", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 68, "text": "uestions posed by the Financial Education Instructor to gain insight\ninto their personal finance goals and behaviors needed to attain those objectives.\n• Participants ask questions that help them become aware of the personal finance areas they\nneed to address.\n• Participants are able to ask clear questions on project based-learning assignments and\nother participant-led projects.\n• Based on Maslow’s Hierarchy of Needs, the Financial Education Instructor recognizes at\nwhich level participants are operating and chooses lessons appropriately.\nProficient\n• Financial Education Instructor uses open-ended questions, inviting participants to think\nand/or offer multiple possible answers.\n• Financial Education Instructor makes effective use of wait time.\n• Discussions enable participants to talk to one another without ongoing mediation by\nFinancial Education Instructor.\n• Financial Education Instructor calls on most participants, even those who don’t initially\nvolunteer.\n• Many participants actively engage in the discussion.\n• Financial Education Instructor asks participants to explain their reasoning, and most\nattempt to do so.\n• Financial Education Instructor asks clear questions that help identify the participants’\nfinancial goals, dreams, and motivators and then incorporates these into the instruction.\nFramework for Teaching\nPersonal Finance\n59\n\n• Financial Education Instructor gains deeper understanding of the participants’ financial\nchallenges.\n• Financial Education Instructor ask", "created_at": "2026-01-03"}
{"id": "6b42aedb-94af-4420-9e4a-765199eb1436", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 69, "text": "the instruction.\nFramework for Teaching\nPersonal Finance\n59\n\n• Financial Education Instructor gains deeper understanding of the participants’ financial\nchallenges.\n• Financial Education Instructor asks questions that help participants identify their current\nrelationships with money, and the emotions surrounding their personal finances and\nrelationships with money.\n• Financial Education Instructor asks questions that help participants understand the\ninfluence of emotions, experiences, and personal beliefs placed on the coursework and\nparticipants’ strategic questions to lead them toward financial wellness.\n• The Financial Education Instructor asks questions that help identify participant needs\nand teaches lessons that progress participants to higher level needs (can utilize Maslow’s\nHierarchy of Needs – psychological, safety and security, love and belonging, self-esteem,\nself-actualization).\n• The Financial Education Instructor discovers at which stage of change participants\ncurrently are and delivers coursework that helps them move to higher levels (may utilize\nthe Transtheoretical Model of Behavior Change – precontemplation, contemplation,\npreparation, action, maintenance, and termination).\n• The Financial Education Instructor asks questions to understand the topics that may cause\nstress with participants and strategically delivers lessons that move participants past any\nemotional blocks.\n• Financial Education Instructor facilitates answering some profound questions that hel", "created_at": "2026-01-03"}
{"id": "1df5dd30-ddec-4387-8cde-ff76294e1a83", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 70, "text": "se\nstress with participants and strategically delivers lessons that move participants past any\nemotional blocks.\n• Financial Education Instructor facilitates answering some profound questions that help\nparticipants understand their personal relationships with money and their future goals.\n• The Financial Education Instructor asks questions that clarify participants’ cognitive levels\nand delivers activities that take participants to higher levels (can employ Bloom’s Taxonomy\nof Cognitive Levels or Webb’s Depth of Knowledge).\n• Financial Education Instructor does not ask personal questions that may embarrass\nparticipants in class.\nFramework for Teaching\nPersonal Finance\n60\n\nBasic\n• Financial Education Instructor frames some questions designed to promote participant\nthinking, but many have a single correct answer.\n• Financial Education Instructor calls on participants quickly.\n• Financial Education Instructor invites participants to respond directly to one another’s\nideas, but few participants respond.\n• Financial Education Instructor calls on many participants, but only a small number actually\nparticipate in the discussion.\n• Financial Education Instructor asks participants to justify their reasoning, but only some\nparticipants attempt to do so.\nUnsatisfactory\n• Questions are rapid-fire and convergent, with a single correct answer.\n• Questions do not invite participant thinking.\n• All discussion is between Financial Education Instructor and participants; participants are\nnot in", "created_at": "2026-01-03"}
{"id": "d201654e-82b1-41ea-8c37-93e3f6650508", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 71, "text": "-fire and convergent, with a single correct answer.\n• Questions do not invite participant thinking.\n• All discussion is between Financial Education Instructor and participants; participants are\nnot invited to speak directly to one another.\n• Financial Education Instructor does not ask participants to explain their thinking.\n• A very few participants dominate the discussion.\nFramework for Teaching\nPersonal Finance\n61\n\n3c: Engaging participants with relevant financial instruction.\nUnsatisfactory\nThe learning tasks/ activities, materials, and resources are poorly aligned with the\ninstructional outcomes, or require only rote responses with only one approach possible.\nParticipant groupings are unsuitable to the activities and the material is neither relevant\nnor delivered in a timely fashion. The lesson has no clearly-defined structure, or the pace\nof the lesson is too slow or rushed.\nBasic\nThe learning tasks and activities require only minimal thinking by participants and little\nopportunity for them to explain their thinking or reflect on how it affects their lives,\nallowing most participants to be passive or merely compliant.\nThe lessons are not practical in nature and focus more on material that is not relevant to\ntheir lives. Participant groupings are moderately suitable to the activities. The lesson has\na recognizable structure; however, the pacing of the lesson may not provide participants\nthe time needed to be intellectually engaged or may be so slow that many participants", "created_at": "2026-01-03"}
{"id": "b66e830d-806b-43f9-a39d-1755e46e30de", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 72, "text": "tivities. The lesson has\na recognizable structure; however, the pacing of the lesson may not provide participants\nthe time needed to be intellectually engaged or may be so slow that many participants\nhave a considerable amount of “down time.”\nProficient\nThe learning tasks and activities are fully aligned with the instructional outcomes,\nrelevant to participants’ lives, and delivered at an appropriate time. Lessons are designed\nto challenge participant thinking, inviting participants to make their thinking visible. This\ntechnique results in active intellectual engagement by most participants with important\nand challenging content and with Financial Education Instructor scaffolding to support\nthat engagement.\nThe groupings of participants are suitable to the activities. The lesson has a clearlydefined structure and the pacing of the lesson is appropriate, providing most participants\nthe time they need to be intellectually engaged.\nDistinguished\nVirtually all participants are intellectually engaged in challenging content through welldesigned learning tasks and activities that require complex thinking on their part. They\nparticipate in learning activities that are practical in nature, completing lessons they\nneed in the real world.\nFinancial Education Instructor provides suitable scaffolding and challenges participants\nto explain their thinking. There is evidence of some participant initiation of inquiry and\nparticipant contributions to the exploration of important content; parti", "created_at": "2026-01-03"}
{"id": "653b4871-8f06-4bf1-9a65-7ee277f54e92", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 73, "text": "ffolding and challenges participants\nto explain their thinking. There is evidence of some participant initiation of inquiry and\nparticipant contributions to the exploration of important content; participants may serve\nas resources for one another. The lesson has a clearly-defined structure, and the pacing\nof the lesson provides participants the time they need, not only to intellectually engage\nand reflect upon their learning but also to consolidate their understanding. The lessons\ninspire participants to take the initial steps toward forming positive financial behaviors.\nFramework for Teaching\nPersonal Finance\n62\n\nDistinguished\n• Virtually all participants are intellectually engaged in the lesson.\n• Lesson activities require high-level participant thinking and explanations of their thinking.\n• Participants take initiative to improve the lesson by (1) modifying a learning task to make it\nmore meaningful or relevant to their needs,\n• (2) suggesting modifications to the grouping patterns used, and/or (3) suggesting modifications\nor additions to the materials being used.\n• Participants have an opportunity for reflection and closure on the lesson to consolidate their\nunderstanding.\n• Participants understand that personal finance lessons are relevant to them and have impact on\nmany areas of their lives.\n• Participants understand the relationship between the key financial touchpoints.\n• Participants reflect upon the different financial trends when planning for their financial future", "created_at": "2026-01-03"}
{"id": "e3b752f9-0170-4107-b367-aa0afef7a897", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 74, "text": "as of their lives.\n• Participants understand the relationship between the key financial touchpoints.\n• Participants reflect upon the different financial trends when planning for their financial futures.\n• Participants take lessons and activities they complete in class and use them in their lives.\n• Participants connect the financial decisions they make with emotions involved in the decisionmaking process.\nProficient\n• Most participants are intellectually engaged in the lesson.\n• Most learning tasks have multiple correct responses or approaches and/or encourage higherorder thinking.\n• Participants are invited to explain their thinking as part of completing tasks.\n• Financial Education Instructor uses groupings that are suitable to the lesson activities.\n• Materials and resources require intellectual engagement, as appropriate.\n• The pacing of the lesson provides participants the time they need to be intellectually engaged.\n• Financial Education Instructor leverages Internet and web-based resources to get timely\nfinancial information.\n• Financial Education Instructor uses evidence-based resources that include practical, timely, and\nrelevant financial education lessons.\n• The Financial Education Instructor covers the key financial touchpoints – assets, income, debt,\ncredit, insurance – and how they affect participants’ financial wellness.\nFramework for Teaching\nPersonal Finance\n63\n\n• The Financial Education Instructor shares common financial challenges that may affect\nparticipan", "created_at": "2026-01-03"}
{"id": "8461fba6-df7a-413d-b4a7-89a8daf8d791", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 75, "text": "e – and how they affect participants’ financial wellness.\nFramework for Teaching\nPersonal Finance\n63\n\n• The Financial Education Instructor shares common financial challenges that may affect\nparticipants so they can mold or modify their behaviors to help them avoid or recover from\nfinancially challenging situations.\n• The Financial Education Instructor helps participants understand the financial trends that\nmay affect them.\n• The Financial Education Instructor delivers material that is educational and does not\npromote financial products or services.\n• The Financial Education Instructor has participants engage in practical activities that will\nbenefit them in the real world.\n• The Financial Education Instructor helps participants develop personal criteria for finding\nknowledgeable financial mentors, advisors, and educators.\n• The Financial Education Instructor helps participants understand the impact of their\nfinances on other areas of their lives: health, happiness, productivity, relationships, security,\nlifestyle.\n• Financial Education Instructor delivers timely lessons on financial topics relevant to\nparticipants’ lives.\n• The Financial Education Instructor provides tools for effective financial decision-making.\n• The Financial Education Instructor selects activities that demonstrate the impact of\nemotions on decision-making.\n• The Financial Education Instructor demonstrates the relationship between values and\nfinancial goals.\nFramework for Teaching\nPersonal Finance\n64\n\nBasi", "created_at": "2026-01-03"}
{"id": "8f3095ff-ef5a-4d00-bd54-614098b3d9ae", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 76, "text": "trate the impact of\nemotions on decision-making.\n• The Financial Education Instructor demonstrates the relationship between values and\nfinancial goals.\nFramework for Teaching\nPersonal Finance\n64\n\nBasic\n• Some participants are intellectually engaged in the lesson.\n• Learning tasks are a mix of those requiring thinking and those requiring recall.\n• Participant engagement with the content is largely passive, and the learning consists\nprimarily of facts or procedures.\n• The instructional groupings used are moderately appropriate to the activities.\n• Few of the materials and resources require participant thinking or ask participants to\nexplain their thinking.\n• The pacing of the lesson is uneven – suitable in parts but rushed or dragging in others.\nUnsatisfactory\n• Few participants are intellectually engaged in the lesson.\n• Learning tasks/activities and materials require only recall or have a single correct response\nor method.\n• Only one type of instructional group is used (whole group, small groups) when variety\nwould promote more participant engagement.\n• Instructional materials used are unsuitable to the lesson and/or the participants.\n• The lesson drags or is rushed.\nFramework for Teaching\nPersonal Finance\n65\n\n3d: Using assessment in instruction to measure behavioral change.\nUnsatisfactory\nParticipants do not appear to be aware of the assessment criteria, and there is little\nor no monitoring of participant learning; feedback is absent or poor quality.\nParticipants do not enga", "created_at": "2026-01-03"}
{"id": "e01f8717-8324-46b7-a21f-98cfc49514a3", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 77, "text": "tisfactory\nParticipants do not appear to be aware of the assessment criteria, and there is little\nor no monitoring of participant learning; feedback is absent or poor quality.\nParticipants do not engage in self- or peer assessment.\nBasic\nParticipants appear to be only partially aware of the assessment criteria, and Financial\nEducation Instructor monitors participant learning for the class as a whole.\nQuestions and assessments are rarely used to diagnose evidence of learning.\nFeedback to participants is general; few participants assess their own work and no\nlong-term measurements are in place.\nProficient\nParticipants are aware of the assessment criteria, and Financial Education Instructor\nmonitors participant learning. Questions and assessments are regularly used to\ndiagnose evidence of learning through short-term testing, surveys, and long-term\nmeasurements that demonstrate they have taken action on the lessons learned.\nFeedback to groups of participants is accurate and specific; some participants engage\nin self-assessment.\nDistinguished\nAssessment is fully integrated into instruction through extensive use of formative\nmeasures. Participants appear to be aware of, and there is some evidence that they\nhave contributed to, the assessment criteria. Questions and assessments are used\nregularly to diagnose evidence of learning by individual participants and quantifiable\nlong-term measurements are in place to accurately gauge financial capabilities. A\nvariety of feedback methods, f", "created_at": "2026-01-03"}
{"id": "ce29b985-eda0-4bb4-be13-ad318cd78074", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 78, "text": "regularly to diagnose evidence of learning by individual participants and quantifiable\nlong-term measurements are in place to accurately gauge financial capabilities. A\nvariety of feedback methods, from both Financial Education Instructor and peers, is\naccurate and specific and advances learning.\nParticipants self-assess and monitor their own progress. Financial Education\nInstructor successfully differentiates instruction to address individual participants’\nmisunderstandings. Financial Education Instructor continues to monitor the\nparticipants’ implementation of the lessons and have learning tools they can deploy\nto give participants ongoing education depending on the outcomes of the long-term\nassessments.\nFramework for Teaching\nPersonal Finance\n66\n\nDistinguished\n• Participants indicate that they clearly understand the characteristics of high-quality work,\nand there is evidence that participants have helped establish the evaluation criteria.\n• Financial Education Instructor is constantly “taking the pulse” of the class; monitoring of\nparticipant understanding is sophisticated and continuous and makes use of strategies to\nelicit evidence of individual participant understanding.\n• Participants monitor their own understanding, either at their own initiative or as a result of\ntasks set by Financial Education Instructor.\n• High-quality feedback comes from many sources, including participants; it is specific and\nfocused on improvement.\n• Participants recognize areas where they may", "created_at": "2026-01-03"}
{"id": "c857244a-eb08-4f1c-b822-ec842455d62f", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 79, "text": "set by Financial Education Instructor.\n• High-quality feedback comes from many sources, including participants; it is specific and\nfocused on improvement.\n• Participants recognize areas where they may need further study.\n• Participants feel motivated to participate in longer-term measurements and personally\nassess their results.\n• Participants use in-class measurements to locate peers who may be able to assist them\nwith topics they find challenging.\n• Participants leverage assessments as learning tools to improve their financial capabilities.\nProficient\n• Financial Education Instructor makes the standards of high-quality work clear to participants.\n• Financial Education Instructor elicits evidence of participant understanding.\n• Participants are invited to assess their own work and make improvements; most of them\ndo so.\n• Feedback includes specific and timely guidance at least for groups of participants.\n• Financial Education Instructor uses participant feedback and in-class assessments which\ncan include: pre- and post-tests, surveys, consultation, and general feedback to modify\nlessons and teaching style.\n• Financial Education Instructor uses in-class assessments to form longer-term assessments\nthat measure knowledge retention and positive behaviors.\n• Financial Education Instructor uses formative and summative assessments.\n• Financial Education Instructor develops long-term measurements that can demonstrate\nand quantify behavior molding or modification.\nFramework for Teachi", "created_at": "2026-01-03"}
{"id": "083b4b73-a569-4df4-8e73-a8bb97cfae2f", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 80, "text": "ctor uses formative and summative assessments.\n• Financial Education Instructor develops long-term measurements that can demonstrate\nand quantify behavior molding or modification.\nFramework for Teaching\nPersonal Finance\n67\n\n• Financial Education Instructor employs frameworks that help evaluate participant\ncomprehension (can employ Bloom’s Taxonomy of Cognitive Skills).\n• Financial Education Instructor uses appropriate measurements to quantify results in terms\nof both knowledge and application.\n• Financial Education Instructor utilizes real-time feedback (e.g., raised hands, body language,\nquestions asked) to measure participant engagement and comprehension.\n• Financial Education Instructor recognizes elements of well-written goals (specific,\nmeasurable, achievable, realistic, time-based) to create measurable learning objectives.\n• Financial Education Instructor uses measurement tools to determine participants’ level of\nfinancial knowledge and to identify participant challenges, needs, and motivators.\n• Financial Education Instructor assesses participant willingness to change using the\nTranstheoretical Model of Behavior Change.\nBasic\n• There is little evidence that the participants understand how their work will be evaluated.\n• Financial Education Instructor monitors understanding through a single method, or without\neliciting evidence of understanding from participants.\n• Feedback to participants is vague and not oriented toward future improvement of work.\n• Financial Educatio", "created_at": "2026-01-03"}
{"id": "39d94aa4-73db-4167-a15c-ba74296230d1", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 81, "text": "through a single method, or without\neliciting evidence of understanding from participants.\n• Feedback to participants is vague and not oriented toward future improvement of work.\n• Financial Education Instructor makes only minor attempts to engage participants in self- or\npeer assessment.\nUnsatisfactory\n• Financial Education Instructor gives no indication of what high-quality work looks like.\n• Financial Education Instructor makes no effort to determine whether participants\nunderstand the lesson.\n• Participants receive no feedback, feedback is global, or feedback is directed to only one\nparticipant.\n• Financial Education Instructor does not ask participants to evaluate their own or classmates’\nwork.\nFramework for Teaching\nPersonal Finance\n68\n\n3e: Demonstrating flexibility and responsiveness to participants’\nlearning needs.\nUnsatisfactory\nFinancial Education Instructor adheres rigidly to an instructional plan in spite of\nevidence of poor participant understanding or participant lack of interest. Financial\nEducation Instructor ignores participant questions; when participants have difficulty\nlearning, Financial Education Instructor blames them or their home environments\nfor their lack of success.\nBasic\nFinancial Education Instructor attempts to adjust the lesson to accommodate\nand respond to participant questions and interests, with mixed results. Financial\nEducation Instructor accepts\nresponsibility for the success of all participants but has only a limited repertoire\nof strat", "created_at": "2026-01-03"}
{"id": "74592d05-bca7-446f-8021-895cc6b67a30", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 82, "text": "respond to participant questions and interests, with mixed results. Financial\nEducation Instructor accepts\nresponsibility for the success of all participants but has only a limited repertoire\nof strategies. The Instructor is more focused on the course objective; participants’\ninterests and questions are regularly dismissed.\nProficient\nIf impromptu measures are needed, Financial Education Instructor smoothly makes\nadjustments to the lesson. Financial Education Instructor successfully accommodates\nparticipant questions while skillfully weaving in the course objectives and satisfying\nparticipants’ interests.\nDrawing on a broad repertoire of strategies, Financial Education Instructor persists\nin seeking approaches for participants who have difficulty learning.\nDistinguished\nFinancial Education Instructor are well-prepared and anticipate participants’\nquestions. During instruction they seize opportunities to enhance learning, build on\na spontaneous event or participant interests, or successfully adjust and differentiate\ninstruction to address individual participant misunderstandings. Using an extensive\nrepertoire of instructional strategies and soliciting additional resources from the\nschool or community, Financial Education Instructor persists in seeking effective\napproaches for participants who need help. Financial Education Instructor’s\nadjustments to the lesson, when needed, are designed to assist individual participants.\nFinancial Education Instructor seizes on teachable mome", "created_at": "2026-01-03"}
{"id": "76f579e6-795c-4a0b-8f99-fe1a2a238cc3", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 83, "text": "icipants who need help. Financial Education Instructor’s\nadjustments to the lesson, when needed, are designed to assist individual participants.\nFinancial Education Instructor seizes on teachable moments to enhance lessons.\nFinancial Education Instructor conveys to participants that s/he won’t consider a\nlesson finished until every participant understands and that s/he has a broad range\nof approaches to use. In reflecting on practice, Financial Education Instructor can cite\nothers in the school and beyond whom s/he has contacted for assistance in reaching\nsome participants’ boredom or lack of understanding.\nFramework for Teaching\nPersonal Finance\n69\n\nDistinguished\n• Financial Education Instructor’s adjustments to the lesson, when needed, are designed to\nassist individual participants.\n• Financial Education Instructor seizes on teachable moments to enhance lessons.\n• Financial Education Instructor conveys to participants that s/he won’t consider a lesson\nfinished until every participant understands and that s/he has a broad range of approaches\nto use.\n• In reflecting on practice, Financial Education Instructor can cite others in the school and\nbeyond whom s/he has contacted for assistance in reaching some participants.\n• Participants feel valued and trust that the Financial Education Instructor will help them\nunderstand the lessons.\n• Financial Education Instructor modifies coursework as needed to drive education to higher\nlevels and ensure that all participants are on pace.\n•", "created_at": "2026-01-03"}
{"id": "e8b1d142-dc06-48bf-baae-043d18ea0001", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 84, "text": "ion Instructor will help them\nunderstand the lessons.\n• Financial Education Instructor modifies coursework as needed to drive education to higher\nlevels and ensure that all participants are on pace.\n• Financial Education Instructor modifies lesson plans to teach lessons that are timely and\nwith which participants can relate.\nProficient\n• When improvising becomes necessary, Financial Education Instructor makes adjustments\nto the lesson.\n• The Financial Education Instructor incorporates participant interests and questions into\nthe heart of the lesson.\n• Financial Education Instructor conveys to participants that s/he has other approaches to\ntry when the participants experience difficulty.\n• In reflecting on practice, Financial Education Instructor cites multiple approaches\nundertaken to reach participants having difficulty.\n• Financial Education Instructor must align instruction based on the socio-economic\nbackgrounds of the class.\n• Financial Education Instructor adjusts lessons based on participants’ cognitive abilities.\n• Financial Education Instructor is aware of most prevalent psychological, sociological, and\neconomic theories underpinning behavior change models and how those models apply to\nteaching financial behavior.\nFramework for Teaching\nPersonal Finance\n70\n\n• Financial Education Instructor adjusts lessons as s/he gains understanding of the\nparticipants’ goals, dreams, challenges, and motivators.\n• The Financial Education Instructor adjusts lessons as s/he gains under", "created_at": "2026-01-03"}
{"id": "c7f9d6ed-4dff-46de-b5fc-9fef40bea09d", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 85, "text": "ducation Instructor adjusts lessons as s/he gains understanding of the\nparticipants’ goals, dreams, challenges, and motivators.\n• The Financial Education Instructor adjusts lessons as s/he gains understanding of the\nparticipants’ multiple intelligences.\n• Financial Education Instructor adjusts course format and length as s/he receives feedback,\nmonitors participant engagement, measures comprehension, and observes participant\nbehavior.\nBasic\n• Financial Education Instructor’s efforts to modify the lesson are only partially successful.\n• Financial Education Instructor makes perfunctory attempts to incorporate participant\nquestions and interests into the lesson.\n• The Financial Education Instructor conveys to participants a level of responsibility for their\nlearning but also his or her uncertainty about how to assist them.\n• In reflecting on practice, Financial Education Instructor indicates the desire to reach all\nparticipants but does not suggest strategies for doing so.\nUnsatisfactory\n• The Financial Education Instructor ignores indications of participant boredom or lack of\nunderstanding.\n• Financial Education Instructor brushes aside participant questions.\n• Financial Education Instructor conveys to participants that when they have difficulty\nlearning, it is their fault.\n• In reflecting on practice, Financial Education Instructor does not indicate that it is important\nto reach all participants.\n• Despite evident participant confusion, Financial Education Instructor makes no", "created_at": "2026-01-03"}
{"id": "9ee41181-da8c-4f89-a9bd-4577a07f5731", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 86, "text": "flecting on practice, Financial Education Instructor does not indicate that it is important\nto reach all participants.\n• Despite evident participant confusion, Financial Education Instructor makes no attempt to\nadjust the lesson.\nFramework for Teaching\nPersonal Finance\n71\n\nDomain 4: Professional\nResponsibilities\nFramework for Teaching\nPersonal Finance\n72\n\nFramework Overview: Professional Responsibilities\n4a: Reflecting on teaching of financial 4d: Participating in professional inquiry\ncapability. focused on financial wellness.\nAccuracy of lesson’s effectiveness Relationships with colleagues\nSuggestions/strategies for future Participation in professional inquiry\nimprovement\nParticipation in school/organizational\nprojects\n4b: Maintaining accurate records of\nparticipants’ financial capabilities.\n4e: Growing and developing professionally.\nRecord system for participant progress\nEnhancement of content knowledge/\nSystem for non-instructional records pedagogical or andragogical skill\nReceptivity of feedback from colleagues\nService to the profession\n4c: Communicating with participants’\nnetworks to promote community financial\nwellness.\n4f: Showing professionalism as a qualified\nAbout financial education programming\nFinancial Education Instructor.\nAbout participants’ learning experiences\nIntegrity/ethical conduct\nEngagement of community through\nService to school/organization/\neffective marketing and communication\ncommunity\nAdvocacy for financial education\nprogramming\nAppropriate decisio", "created_at": "2026-01-03"}
{"id": "a42ba329-1ad0-4293-84bc-2164b138bf07", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 87, "text": "tegrity/ethical conduct\nEngagement of community through\nService to school/organization/\neffective marketing and communication\ncommunity\nAdvocacy for financial education\nprogramming\nAppropriate decision-making issues\nFramework for Teaching\nPersonal Finance\n73\n\n4a: Reflecting on teaching of financial capability.\nUnsatisfactory\nFinancial Education Instructor does not know whether a lesson was effective or\nachieved its instructional outcomes, or Financial Education Instructor profoundly\nmisjudges the success of a lesson. Financial Education Instructor has no suggestions\nfor how a lesson could be improved.\nBasic\nFinancial Education Instructor has a generally accurate impression of a lesson’s\neffectiveness and the extent to which instructional outcomes were met. Financial\nEducation Instructor makes general suggestions about how a lesson could be\nimproved.\nProficient\nFinancial Education Instructor makes an accurate assessment of a lesson’s\neffectiveness and the extent to which it achieved its instructional outcomes and\ncan cite general references to support the judgment. Financial Education Instructor\nmakes a few specific suggestions of what could be tried another time the lesson is\ntaught.\nDistinguished\nFinancial Education Instructor makes a thoughtful and accurate assessment of a\nlesson’s effectiveness and the extent to which it achieved its instructional outcomes,\nciting many specific examples from the lesson and weighing the relative strengths\nof each. Drawing on an extensive re", "created_at": "2026-01-03"}
{"id": "7ff209f6-dfe9-4b0c-bd65-9167d570dcc2", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 88, "text": "on’s effectiveness and the extent to which it achieved its instructional outcomes,\nciting many specific examples from the lesson and weighing the relative strengths\nof each. Drawing on an extensive repertoire of skills, Financial Education Instructor\noffers specific alternative actions, complete with the probable success of different\ncourses of action.\nFramework for Teaching\nPersonal Finance\n74\n\nDistinguished\n• Financial Education Instructor assessment of the lesson is detailed and thorough and\nincludes specific indicators of effectiveness including use of Bloom’s Taxonomy of cognitive\nskills to evaluate participant comprehension, application of long-term measurement tools\nto gain empirical data related to behavior change, and utilization of timely feedback to\nmeasure participant engagement and comprehension.\n• Financial Education Instructor’s suggestions for improvement are derived from quantifying\neffectiveness of instruction, marketing outreach and retention, and an understanding of\nparticipants’ level of financial knowledge.\n• Instructor evaluates participant challenges, needs, and motivators and assesses participant\nwillingness to change using the Transtheoretical Model of Behavior Change.\n• Financial Education Instructor completes a thorough assessment of a lesson’s effectiveness\nas well as the impact of the lesson on participant behavior.\n• Financial Education Instructor incorporates lessons learned from participants into lessons\nfor future teaching.\n• Financial Educat", "created_at": "2026-01-03"}
{"id": "a8e25603-469c-443e-92f9-8dd06ea1cb47", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 89, "text": "veness\nas well as the impact of the lesson on participant behavior.\n• Financial Education Instructor incorporates lessons learned from participants into lessons\nfor future teaching.\n• Financial Education Instructor modifies lessons to more effectively enhance participant\nlearning.\n• Financial Education Instructor consistently reviews current learning techniques and\nresources, including web-based tools.\nProficient\n• Financial Education Instructor accurately assesses the effectiveness of instructional activities\nthrough implementation of appropriate measurement tools, goal-setting strategies,\nparticipant engagement and comprehension, and long-term behavior modification.\n• The Financial Education Instructor identifies specific ways in which a lesson might be\nimproved or further enhanced by comparing various types of pre- and post-test surveys and\nconsultation; and uses appropriate measures to quantify results in terms of both knowledge\nand application.\n• Financial Education Instructor makes an accurate assessment of a lesson’s effectiveness\nand the extent to which it influences participant behavior.\n• Financial Education Instructor assesses participants’ level of knowledge and motivation\nand modifies instruction accordingly.\n• Financial Education Instructor reviews current learning techniques and resources that\nsupport financial capability instruction.\nFramework for Teaching\nPersonal Finance\n75\n\nBasic\n• Financial Education Instructor has a generally accurate impression of a less", "created_at": "2026-01-03"}
{"id": "1d8cd0c1-0f3f-43cb-a7fb-2dd28f1ac2f5", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 90, "text": "techniques and resources that\nsupport financial capability instruction.\nFramework for Teaching\nPersonal Finance\n75\n\nBasic\n• Financial Education Instructor has a generally accurate impression of a lesson’s effectiveness\nand the extent to which instructional outcomes were met. Financial Education Instructor\nmakes general suggestions about how a lesson could be improved.\n• The Financial Education Instructor has a general sense of whether or not instructional\npractices were effective in teaching financial principles.\n• Financial Education Instructor offers general modifications for future instruction.\nUnsatisfactory\n• Financial Education Instructor does not know whether a lesson was effective or achieved\nits instructional outcomes, or Financial Education Instructor profoundly misjudges the\nsuccess of a lesson. Financial Education Instructor has no suggestions for how a lesson\ncould be improved.\n• The Financial Education Instructor considers the lesson but draws incorrect conclusions\nabout its effectiveness.\n• Financial Education Instructor makes no suggestions for improvement.\nFramework for Teaching\nPersonal Finance\n76\n\n4b: Maintaining accurate records of participants’ financial capabilities.\nUnsatisfactory\nFinancial Education Instructor’s system for maintaining information on participant\ncompletion of assignments and learning progress is nonexistent or in disarray.\nFinancial Education Instructor’s records for noninstructional activities are in disarray,\nthe result being errors a", "created_at": "2026-01-03"}
{"id": "925bcb0b-ad20-4c75-8ebd-e889f9bb58a6", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 91, "text": "ipant\ncompletion of assignments and learning progress is nonexistent or in disarray.\nFinancial Education Instructor’s records for noninstructional activities are in disarray,\nthe result being errors and confusion.\nBasic\nFinancial Education Instructor’s system for maintaining information on participant\ncompletion of assignments and learning progress is rudimentary and only partially\neffective.\nFinancial Education Instructor’s records for noninstructional activities are adequate\nbut inefficient and, unless given frequent oversight, prone to errors.\nProficient\nFinancial Education Instructor’s system for maintaining information on participant\ncompletion of assignments, learning progress, and noninstructional records is fully\neffective.\nDistinguished\nFinancial Education Instructor’s system for maintaining information on participant\ncompletion of assignments, learning progress, and noninstructional records is fully\neffective. Participants contribute information and contribute to maintaining records\nas appropriate.\nFramework for Teaching\nPersonal Finance\n77\n\nDistinguished\n• Participants contribute to and maintain records indicating completed and outstanding\nwork assignments.\n• Participants contribute to and maintain data files indicating their own learning progress.\n• Participants recognize and set measurable goals to more effectively accomplish learning\nand program objectives.\n• Participants apply long-term goal-setting strategies and measurements that further\nincrease opportunity", "created_at": "2026-01-03"}
{"id": "2ef91c73-e978-4e82-a0ac-2cfdcc118b1c", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 92, "text": "nize and set measurable goals to more effectively accomplish learning\nand program objectives.\n• Participants apply long-term goal-setting strategies and measurements that further\nincrease opportunity for enhanced cognitive learning and effective behavior change.\nProficient\n• Financial Education Instructor’s process for recording completion of participant work is\nefficient and effective; participants have access to information about completed and/or\nmissing assignments.\n• Financial Education Instructor has an efficient and effective process for recording participant\nattainment of learning goals; participants are able to track their own progress.\n• Financial Education Instructor’s process for recording noninstructional information is both\nefficient and effective. S/he uses appropriate strategies to assess participant data and\nlearning needs, and to evaluate the impact of financial programs on participant behavior.\nBasic\n• Financial Education Instructor has a process for recording participant work progress.\nHowever, it may be out-of-date or may not permit participants to access the information.\n• Financial Education Instructor’s process for tracking participant progress is inefficient or\nineffective.\n• Financial Education Instructor has a process for tracking some, but not all, noninstructional\ninformation, and it may contain some errors.\nUnsatisfactory\n• There is no system for either instructional or noninstructional records.\n• Record-keeping systems are in disarray and provide", "created_at": "2026-01-03"}
{"id": "97878764-7a53-4dff-94ae-4035ebcc2f64", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 93, "text": "nstructional\ninformation, and it may contain some errors.\nUnsatisfactory\n• There is no system for either instructional or noninstructional records.\n• Record-keeping systems are in disarray and provide incorrect or confusing information.\nFramework for Teaching\nPersonal Finance\n78\n\n4c: Communicating with participants’ networks to promote community\nfinancial wellness.\nUnsatisfactory\nFinancial Education Instructor provides little information about the instructional\nprogram to families; Financial Education Instructor communication about participants’\nprogress is minimal. Financial Education Instructor does not respond, or responds\ninsensitively, to family concerns.\nBasic\nFinancial Education Instructor makes sporadic attempts at communication with\nfamilies about the instructional program and about the progress of individual\nparticipants but does not attempt to engage families in the instructional program.\nMoreover, the communication that does take place may not be culturally sensitive to\nthe families.\nProficient\nFinancial Education Instructor provides frequent and appropriate information to\nfamilies about the instructional program and conveys information about individual\nparticipant progress in a culturally sensitive manner.\nFinancial Education Instructor makes some attempts to engage families in the\ninstructional program.\nDistinguished\nFinancial Education Instructor communicates frequently with families in a culturally\nsensitive manner, with participants contributing to the commun", "created_at": "2026-01-03"}
{"id": "223d929d-2970-432b-8afa-a49687bc55c5", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 94, "text": "families in the\ninstructional program.\nDistinguished\nFinancial Education Instructor communicates frequently with families in a culturally\nsensitive manner, with participants contributing to the communication. Financial\nEducation Instructor responds to family concerns with professional and cultural\nsensitivity. Financial Education Instructor’s efforts to engage families in the\ninstructional program are frequent and successful.\nFramework for Teaching\nPersonal Finance\n79\n\nDistinguished\n• Participants regularly develop materials to inform their families and/or the support\naudience about the instructional program and garner feedback on how to further enhance\noptions for more effective delivery and instruction of financial education programming.\n• Participants maintain accurate records about their individual learning progress and\nfrequently share this information with families and/or the community.\n• Participants contribute to regular and ongoing projects designed to engage families and/\nor the community in the learning process.\n• Financial Education Instructor engages support audience (families, schools, sponsors,\nsupervisors) in participants’ learning experience.\n• All Financial Education Instructor communications are highly sensitive to families’ and/or\nthe community’s cultural norms.\n• The Financial Education Instructor engages the support audience by employing grassroots\ncommunity involvement, promotion, and outreach as well as ongoing events/programs to\nstrengthen the financi", "created_at": "2026-01-03"}
{"id": "a285e522-1556-45bb-bf0a-83c0d192a694", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 95, "text": "s.\n• The Financial Education Instructor engages the support audience by employing grassroots\ncommunity involvement, promotion, and outreach as well as ongoing events/programs to\nstrengthen the financial health of the community.\n• Utilizes feedback from participants and their support groups to plan instructional and\noutreach activities.\n• Improves financial capabilities of the community and participants’ close networks.\nProficient\n• Financial Education Instructor regularly makes information about the instructional program\navailable.\n• Financial Education Instructor regularly sends home information about participant progress.\n• Financial Education Instructor develops activities designed to engage families and/or the\ncommunity successfully and appropriately in participants’ learning.\n• Most Financial Education Instructor communications are appropriate to families’ cultural\nnorms.\n• The Financial Education Instructor applies a holistic approach to learning to identify how\nfinancial education increases program impact, reach, frequency, and sustainability; elicit\nindividual, family, school, and community involvement; and align instruction with larger\ncommunity and business goals.\nFramework for Teaching\nPersonal Finance\n80\n\n• The Financial Education Instructor works in cooperation with participants and communities\nto create grassroots community events, design interactive promotions and outreach,\npromote ongoing sustainable financial education events/programs, and identify methods\nto", "created_at": "2026-01-03"}
{"id": "16f4f191-94bb-48f8-8937-11a2cd3fff57", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 96, "text": "participants and communities\nto create grassroots community events, design interactive promotions and outreach,\npromote ongoing sustainable financial education events/programs, and identify methods\nto effectively implement financial education successfully within the community.\n• Financial Education Instructor gathers feedback from participants and their support groups.\nBasic\n• Financial Education Instructor sends home infrequent or incomplete information about the\ninstructional program.\n• Financial Education Instructor maintains required information but does little else to inform\nfamilies about participant progress.\n• Family engagement activities are provided periodically.\n• Some Financial Education Instructor communications are inappropriate to families’ cultural\nnorms.\nUnsatisfactory\n• Little or no information regarding the instructional program is available to participants’\nfamilies or established networks.\n• Participants’ families are unaware of their progress.\n• Family engagement activities are lacking.\n• There is some culturally inappropriate communication.\nFramework for Teaching\nPersonal Finance\n81\n\n4d: Participating in professional inquiry focused on financial wellness.\nUnsatisfactory\nFinancial Education Instructor’s relationships with colleagues are negative or selfserving. Financial Education Instructor avoids participation in a professional culture\nof inquiry, resisting opportunities to become involved. Financial Education Instructor\navoids becoming involved in sch", "created_at": "2026-01-03"}
{"id": "e38a121a-fde6-41a5-bcb6-cb391d7c465e", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 97, "text": "ng. Financial Education Instructor avoids participation in a professional culture\nof inquiry, resisting opportunities to become involved. Financial Education Instructor\navoids becoming involved in school or organizational events or projects.\nBasic\nFinancial Education Instructor maintains cordial relationships with colleagues to\nfulfill duties that the school or organization requires. Financial Education Instructor\nparticipates in the school’s or organization’s culture of professional inquiry when\ninvited to do so. Financial Education Instructor participates in school or organizational\nevents or projects when specifically asked.\nProficient\nFinancial Education Instructor’s relationships with colleagues are characterized by\nmutual support and cooperation; Financial Education Instructor actively participates\nin a culture of professional inquiry. Financial Education Instructor volunteers to\nparticipate in school or organizational events or projects, making a substantial\ncontribution.\nDistinguished\nFinancial Education Instructor’s relationships with colleagues are characterized by\nmutual support and cooperation, with Financial Education Instructor taking initiative\nto assume leadership among the school or organizational staff. Financial Education\nInstructor takes a leadership role in promoting a culture of professional inquiry.\nFinancial Education Instructor consistently volunteers to participate in school or\norganizational events and projects, making a substantial contribution and", "created_at": "2026-01-03"}
{"id": "388e8f31-467a-443c-a1c2-ab00f3eadf25", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 98, "text": "romoting a culture of professional inquiry.\nFinancial Education Instructor consistently volunteers to participate in school or\norganizational events and projects, making a substantial contribution and assuming\na leadership role.\nFramework for Teaching\nPersonal Finance\n82\n\nDistinguished\n• Financial Education Instructor takes a leadership role in promoting activities related to\nprofessional inquiry.\n• Financial Education Instructor regularly contributes to or leads significant school or\ncommunity events/projects that positively increase financial capability, and creates\nmemorable kick-off events.\n• Financial Education Instructor incorporates networks of professionals to serve as guest\nspeakers and contribute to the lesson plans.\n• Financial Education Instructor supports a culture of professional inquiry within the\ncommunity.\n• Financial Education Instructor promotes community and professional resources that are\navailable for other organizations to review to help improve programs.\n• Financial Education Instructor participates in all the organization’s events that can help\nhim/her develop personally and professionally.\n• Develops supportive working relationships with community members to enhance\nprogramming and form productive collaborative connections and networks.\nProficient\n• Financial Education Instructor has supportive and collaborative relationships with\ncolleagues.\n• Financial Education Instructor regularly participates in activities related to professional\ninquiry.\n• Fina", "created_at": "2026-01-03"}
{"id": "5fbcfc79-95e8-409e-8784-4c39be16ead4", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 99, "text": "ncial Education Instructor has supportive and collaborative relationships with\ncolleagues.\n• Financial Education Instructor regularly participates in activities related to professional\ninquiry.\n• Financial Education Instructor frequently volunteers to participate in school events and\nschool district and community projects.\n• Financial Education Instructor develops networks of collaborative partners that contribute\nto the development of participants’ financial capabilities.\n• Financial Education Instructor supports a culture of professional inquiry within their\norganizations.\n• Financial Education Instructor participates in all the organization’s events that can help\nhim/her develop personally and professionally.\n• Develops supportive working relationships with colleagues to enhance programming and\nform productive collaborative connections and networks.\nFramework for Teaching\nPersonal Finance\n83\n\nBasic\n• Financial Education Instructor has cordial relationships with colleagues.\n• When invited, Financial Education Instructor participates in activities related to professional\ninquiry.\n• When asked, Financial Education Instructor participates in school activities, district and\ncommunity projects.\nUnsatisfactory\n• Financial Education Instructor’s relationships with colleagues are characterized by\nnegativity or combativeness.\n• Financial Education Instructor purposefully avoids contributing to activities promoting\nprofessional inquiry.\n• Financial Education Instructor avoids involve", "created_at": "2026-01-03"}
{"id": "be859658-d301-44e9-b821-7f5da8cec8f0", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 100, "text": "cterized by\nnegativity or combativeness.\n• Financial Education Instructor purposefully avoids contributing to activities promoting\nprofessional inquiry.\n• Financial Education Instructor avoids involvement in school activities and district and\ncommunity projects.\nFramework for Teaching\nPersonal Finance\n84\n\n4e: Growing and developing professionally.\nUnsatisfactory\nFinancial Education Instructor engages in no professional development activities to\nenhance knowledge or skill levels. Financial Education Instructor resists feedback on\nteaching performance from either supervisors or more experienced colleagues.\nFinancial Education Instructor makes no effort to share knowledge with others or to\nassume professional responsibilities.\nBasic\nFinancial Education Instructor participates to a limited extent in professional\nactivities when convenient. Financial Education Instructor engages in a limited\nway with colleagues and supervisors in professional conversation about practice,\nincluding some feedback on teaching performance.\nFinancial Education Instructor finds limited ways to assist other Financial Education\nInstructors and contribute to the profession.\nProficient\nFinancial Education Instructor seeks out opportunities for professional development\nto enhance content knowledge and pedagogical/andragogical skills.\nFinancial Education Instructor actively engages with colleagues and supervisors in\nprofessional conversations about practice, including feedback about practice.\nFinancial Educat", "created_at": "2026-01-03"}
{"id": "edc7a6e2-c9cf-44eb-be5d-0ab11bf40a22", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 101, "text": "l/andragogical skills.\nFinancial Education Instructor actively engages with colleagues and supervisors in\nprofessional conversations about practice, including feedback about practice.\nFinancial Education Instructor participates actively in assisting other educators and\nlooks for ways to contribute to the profession.\nDistinguished\nFinancial Education Instructor seeks out opportunities for professional development\nand makes a systematic effort to conduct action research.\nFinancial Education Instructor solicits feedback on practice from both supervisors\nand colleagues. Financial Education Instructor initiates important activities to\ncontribute to the profession.\nFramework for Teaching\nPersonal Finance\n85\n\nDistinguished\n• Financial Education Instructor seeks regular opportunities for continued professional\ndevelopment, including initiating action research and identifying why financial education\nprograms may fail and how to implement corrective methods.\n• Financial Education Instructor actively seeks feedback from supervisors and colleagues,\ncontinually researches and identifies effective teaching methods and relevant content, and\nactively pursues continued learning opportunities (i.e. conferences, seminars).\n• Financial Education Instructor identifies strategies and techniques to ensure that\nparticipants have basic financial capability knowledge.\n• Financial Education Instructor pursues continued learning of content and pedagogical\nskills.\n• Financial Education Instructor continu", "created_at": "2026-01-03"}
{"id": "f676729a-194e-4f78-aad2-533fb5ac8bac", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 102, "text": "ure that\nparticipants have basic financial capability knowledge.\n• Financial Education Instructor pursues continued learning of content and pedagogical\nskills.\n• Financial Education Instructor continually sets instructional outcomes.\n• Financial Education Instructor consistently keeps him/herself abreast of current learning/\nresources and technologies that will more effectively support financial capability instruction.\n• Considers and possibly implements professional feedback when aligned with program\nobjectives.\nProficient\n• Financial Education Instructor seeks regular opportunities for continued professional\ndevelopment.\n• Financial Education Instructor welcomes colleagues and supervisors into the instructional\nenvironment for the purposes of gaining insight and feedback.\n• Financial Education Instructor actively participates in organizations that contribute to\nprofessional growth opportunities.\n• Pursues continued learning of content and pedagogical skills and modifies instructional\noutcomes accordingly.\nFramework for Teaching\nPersonal Finance\n86\n\nBasic\n• Financial Education Instructor participates in professional activities when required.\n• Financial Education Instructor reluctantly accepts feedback from supervisors and colleagues.\n• Financial Education Instructor contributes in a limited fashion to professional organizations.\nUnsatisfactory\n• Financial Education Instructor is not involved in any activity that might enhance financial\nknowledge or skill.\n• Financial Educat", "created_at": "2026-01-03"}
{"id": "7b334dfc-5c28-40ef-8579-b82423e21012", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 103, "text": "in a limited fashion to professional organizations.\nUnsatisfactory\n• Financial Education Instructor is not involved in any activity that might enhance financial\nknowledge or skill.\n• Financial Education Instructor purposely resists discussing performance with supervisors\nor colleagues.\n• Financial Education Instructor ignores invitations to join professional organizations or\nattend conferences.\nFramework for Teaching\nPersonal Finance\n87\n\n4f: Showing professionalism as a qualified Financial Education\nInstructor.\nUnsatisfactory\nFinancial Education Instructor displays dishonesty in interactions with colleagues,\nparticipants, and the public. Financial Education Instructor is not alert to participants’\nneeds and contributes to learning practices that result in some participants being illserved by the program.\nFinancial Education Instructor makes decisions and recommendations based on selfserving interests.\nFinancial Education Instructor does not comply with school or organizational regulations.\nBasic\nFinancial Education Instructor is honest in interactions with colleagues, participants,\nand the public. Financial Education Instructor’s attempts to serve participants are\ninconsistent, and s/he may unknowingly contribute to some participants being ill-served\nby the school. Financial Education Instructor’s decisions and recommendations are based\non limited, though genuinely professional, considerations.\nFinancial Education Instructor must be reminded by supervisors about complying wi", "created_at": "2026-01-03"}
{"id": "10e18576-016e-4f3f-b17b-55d8498677ab", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 104, "text": "cation Instructor’s decisions and recommendations are based\non limited, though genuinely professional, considerations.\nFinancial Education Instructor must be reminded by supervisors about complying with\nschool or organizational regulations.\nProficient\nFinancial Education Instructor displays high standards of honesty, integrity, and\nconfidentiality in interactions with colleagues, participants, and the public. Financial\nEducation Instructor actively serves participants, working to ensure that all participants\nreceive a fair opportunity to succeed.\nFinancial Education Instructor maintains an open mind in team or departmental decisionmaking. Financial Education Instructor complies fully with school or organizational\nregulations.\nDistinguished\nFinancial Education Instructor can be counted on to hold the highest standards of\nhonesty, integrity, and confidentiality and takes a leadership role with colleagues.\nFinancial Education Instructor is highly proactive in serving participants, seeking out\nresources when needed. Financial Education Instructor makes a concerted effort to\nchallenge negative attitudes or practices to ensure that all participants, particularly\nthose traditionally underserved, are honored in the educational environment. Financial\nEducation Instructor takes a leadership role in team or departmental decision-making\nand helps ensure that such decisions are based on the highest professional standards.\nFinancial Education Instructor complies fully with school or organi", "created_at": "2026-01-03"}
{"id": "31682541-7787-4b2b-8a36-d27b1006d435", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 105, "text": "p role in team or departmental decision-making\nand helps ensure that such decisions are based on the highest professional standards.\nFinancial Education Instructor complies fully with school or organizational regulations,\ntaking a leadership role with colleagues.\nFramework for Teaching\nPersonal Finance\n88\n\nDistinguished\n• Financial Education Instructor is considered a leader in terms of honesty, integrity, and\nconfidentiality with participants, colleagues, and the community.\n• Financial Education Instructor is highly proactive in serving participants and/or colleagues.\n• Financial Education Instructor makes a concerted effort to ensure that opportunities are\navailable for all participants to be successful and that support participants’ best interests,\neven in the face of difficult or conflicting policies.\n• Financial Education Instructor takes a leadership role in team and organizational decisionmaking and organizational guidelines/requirements.\n• Financial Education Instructor makes decisions that serve the school/organizational community\n(participants, Instructor, supervisors, public).\n• Financial Education Instructor focuses heavily on serving participants and assisting them to\nmake positive changes in their financial behaviors.\n• Financial Education Instructor advocates for implementation of quality financial education\nprogramming within schools and the community.\n• Recognized in the community as a benchmark to which other Financial Education Instructors\nlook for best pra", "created_at": "2026-01-03"}
{"id": "1274c728-e9de-411e-b23d-32187b1e8a8c", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 106, "text": "mplementation of quality financial education\nprogramming within schools and the community.\n• Recognized in the community as a benchmark to which other Financial Education Instructors\nlook for best practices.\nProficient\n• Financial Education Instructor is honest and known for having high standards of integrity.\n• Financial Education Instructor actively addresses participants’ and/or colleagues’ needs.\n• Financial Education Instructor actively works to provide opportunities for participants’ success.\n• Financial Education Instructor willingly participates in team and organizational decisionmaking and complies completely with organizational guidelines/requirements.\n• Financial Education Instructor promotes implementation of quality financial education\nprogramming within schools and the community.\n• Demonstrates integrity and professional ethics in interactions with participants, colleagues,\nand the public.\n• Focuses on serving participants to make positive changes in financial behaviors.\n• Makes decisions that serve the school/organizational community (participants, Instructor,\nsupervisors, public).\n• Contributes meaningful opinions to organizational decision-making issues and advocates for\nimplementation of quality financial education programming.\nFramework for Teaching\nPersonal Finance\n89\n\nBasic\n• Financial Education Instructor is honest.\n• Financial Education Instructor notices the needs of participants and/or colleagues but\naddresses them inconsistently.\n• Financial Educatio", "created_at": "2026-01-03"}
{"id": "7e8a6a91-43d9-41f1-a6d9-0d6b41761db7", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 107, "text": "nance\n89\n\nBasic\n• Financial Education Instructor is honest.\n• Financial Education Instructor notices the needs of participants and/or colleagues but\naddresses them inconsistently.\n• Financial Education Instructor does not notice that some instructional practices result in\npoor conditions for participants.\n• Financial Education Instructor makes professional decisions on a limited basis.\n• Financial Education Instructor complies with organizational guidelines/requirements.\nUnsatisfactory\n• Financial Education Instructor is dishonest.\n• Financial Education Instructor does not notice the needs of participants and/or colleagues.\n• Financial Education Instructor engages in practices that are self-serving.\n• Financial Education Instructor willfully rejects organizational guidelines/requirements.\nFramework for Teaching\nPersonal Finance\n90\n\nAbout the National Financial\nEducators Council\nThe National Financial Educators Council is dedicated to creating a world where people\nare informed to make qualified financial decisions that improve their lives, the lives of their\nloved ones, and the lives of people they reach around the globe. The organization focuses on\nimproving the financial capabilities of individuals while raising awareness for the financial\nliteracy movement.\nThe NFEC is an independent, for-profit financial literacy council with a social enterprise\nbusiness model. This structure gives us the freedom to deliver an unbiased financial education\nand assist organizations in need o", "created_at": "2026-01-03"}
{"id": "d54a8d09-787f-41b9-8cd1-319e20f2c6d7", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 108, "text": "endent, for-profit financial literacy council with a social enterprise\nbusiness model. This structure gives us the freedom to deliver an unbiased financial education\nand assist organizations in need of support. Social responsibility, conscious capitalism, and\nfree enterprise are the fundamental principles underpinning our teachings and overall\nbusiness model.\nThe NFEC’s commitment to gaining deeper understanding of personal finance topics helps the\nindustry obtain empirical data, illuminates best practices, and shares professional opinions\nabout the subject. Using surveys, research, crowdsourcing, and think tanks, the NFEC has\ndeveloped the Framework for Teaching Personal Finance.\nCrowdsourcing Model\nThe NFEC operates an active crowdsourcing model to leverage the knowledge possessed by\nother industry experts. We collaborate with those individuals who have experience in the\neducation, finance, and personal money management fields to refine, fine-tune, and perfect\nthe Framework.\nThe NFEC prides itself on being in a constant state of beta. Our material is improved and\nmodified as new information becomes available or broader changes take place that warrant\nreiteration of the material. We value the comments, feedback, and opinions of those who\nreview our publications.\nTo contribute your thoughts, please visit\nwww.FinancialEducatorsCouncil.org/FTPF-contributors\nFramework for Teaching\nPersonal Finance\n91\n\nDevelopment Team\nThe NFEC team is made up of individuals who are passionate ab", "created_at": "2026-01-03"}
{"id": "753bab65-7d30-4816-80a6-8490020eb400", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 109, "text": "ur thoughts, please visit\nwww.FinancialEducatorsCouncil.org/FTPF-contributors\nFramework for Teaching\nPersonal Finance\n91\n\nDevelopment Team\nThe NFEC team is made up of individuals who are passionate about helping people improve\ntheir financial capabilities and promoting the overall financial literacy movement. The\nFramework for Teaching Personal Finance was developed through think tanks with industry\nexperts and the NFEC’s Curriculum Advisory Board which is made up of a team of educators,\npersonal finance experts, and financial professionals. The individuals instrumental in the\ndevelopment of the Framework for Teaching Personal Finance include:\nDr. Pamela Rosa is an Educational Consultant at the Danielson Group and the Senior\nConsultant for Effective Professional Practices. Dr. Rosa has supported schools nationally\nin the design, development, and implementation of Charlotte Danielson’s Framework for\nTeaching evaluation and professional growth process. As an educational consultant for the\npast 14 years, Dr Rosa specializes in teacher and principal evaluation and professional growth\nprocesses as well as teacher mentoring/coaching.\nDr. Ann Johnson is an independent consultant who works extensively with organizations\ninternationally on implementing curriculum and assessment reform, developing high quality\nleadership teams, and developing training and implementation plans. Her practical approach\nto design and alignment is based on 30 years’ experience as a classroom teacher, associ", "created_at": "2026-01-03"}
{"id": "5b9c58d8-f94b-4714-bbbe-88312b226752", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 110, "text": "veloping high quality\nleadership teams, and developing training and implementation plans. Her practical approach\nto design and alignment is based on 30 years’ experience as a classroom teacher, associate\nsuperintendent, building principal, and adjunct professor who has implemented long-term\ncurriculum alignment and mapping initiatives.\nVince Shorb is CEO of the National Financial Educators Council. One of the council’s original\nfounders, Shorb remains involved in educational development and raising awareness for\nthe financial literacy movement. Before joining the NFEC, Shorb talked with more than\n20,000 people about their personal financial situations and reviewed the personal financial\nstatements of more than 10,000 clients. He leads the NFEC’s Advisory Board and has been\ninstrumental in developing over 500 hours of financial literacy curriculum.\nDiane Larsen is an award-winning economics teacher and a NFEC Instructor. Diane is a 26year teaching veteran whose awards include being selected Jump$tart Coalition Outstanding\nEducator for 2008 as well as being the only California teacher chosen by CEE and the U.S.\nState Department to travel to South Africa as part of an international economics teacher\nexchange program. Her students have won high honors in the California State Stock Market\nSimulation, placing first in that competition in 2008, 2009, and twice in 2012.\nFramework for Teaching\nPersonal Finance\n92\n\nGary Jaeckel is the author of Teaching Personal Financial Education and", "created_at": "2026-01-03"}
{"id": "f3e8edb7-1b7a-4ec1-8280-c7fa43fe25e4", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 111, "text": "rket\nSimulation, placing first in that competition in 2008, 2009, and twice in 2012.\nFramework for Teaching\nPersonal Finance\n92\n\nGary Jaeckel is the author of Teaching Personal Financial Education and a NFEC Instructor.\nHis passion for improving people’s financial capabilities took him from the corporate world\nto the financial literacy industry. He brings real-world experience to the academic side of\nthe financial literacy field with his background in the financial and securities industries and\ncorporate finance. He is a recognized expert in teaching personal finance and is known as\nan advocate promoting personal financial education as a stand-alone course in all schools\nacross the country.\nErica Jackson served as Director for the Center for Financial and Consumer Outreach (at\nPenn State Erie, The Behrend College) and holds a certification as a Certified Financial\nEducation Instructor (CFEI). Jackson has also served as the inaugural Executive Director for\nJunior Achievement’s Northwest PA Regional Office. Over the years, Erica has partnered with\nseveral agencies and organizations to advocate for financial capability including: National\nFinancial Educators Council, Pennsylvania Treasury, Pennsylvania Department of Banking,\nand Jump$tart Coalition.\nHelen Graves With a diverse background in education, Adlerian psychology, Neuro-Linguistic\nProgramming, and marketing, Helen Graves is fascinated by how people think and learn. She\nhas taught all age levels both in a formal classroom", "created_at": "2026-01-03"}
{"id": "084c464d-2d8d-4aae-98b2-6d2f5b619802", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 112, "text": "round in education, Adlerian psychology, Neuro-Linguistic\nProgramming, and marketing, Helen Graves is fascinated by how people think and learn. She\nhas taught all age levels both in a formal classroom and in workshops, conferences, and online\nseminars. She has recently moved into the field of content development and instructional\ndesign, and enjoys bringing her passion for clear communication and innovative solutions to\nthe learning environment.\nDr. Pamela Enders is a psychologist and peak performance coach. As faculty member at Harvard\nMedical School, Dr. Enders served as a teacher and supervisor at the Massachusetts General\nHospital (MGH) in Boston. With three decades of experience, she works with high-performing\nprofessionals to project confidence and poise in high-visibility, high-pressure situations.\nSteve Repak is a Certified Financial Planner™ and author of Dollars & Uncommon Sense: Basic\nTraining for Your Money. Steve is an advocate for financial literacy and a 15-year veteran in\nthe financial services industry. Steve’s expertise as an educator is demonstrated by how well\nhis presentations are received by audiences, and from post-surveys collected which indicate\nthe material’s impact.\nEllen Smith has a Master’s Degree in Early Childhood Special Education and several years of\nclassroom experience. She works with the NFEC in producing and editing smart, easy-to-use\neducational resources. She is experienced in implementing and adapting curricula to meet\ncritical needs of", "created_at": "2026-01-03"}
{"id": "4cbb5ef1-f818-4416-a9a8-9e37c584e42c", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 113, "text": "of\nclassroom experience. She works with the NFEC in producing and editing smart, easy-to-use\neducational resources. She is experienced in implementing and adapting curricula to meet\ncritical needs of the learners.\nFramework for Teaching\nPersonal Finance\n93\n\nTony Steuer CLU, LA, CPFFE is a recognized authority on life, disability and long-term care\ninsurance literacy and a member of the California Department of Insurance Curriculum Board\nand the National Financial Educators Council Curriculum Advisory Board. Tony’s Questions\nand Answers on Life Insurance and The Questions and Answers on Life Insurance Workbook\nwere winners of the Excellence in Financial Literacy Education™ Award from the Institute\nfor Financial Literacy® and have been named by Forbes as one of the nine great investment\nbooks worth reading.\nStan T. Webb has been a steady beacon in the financial education world. In addition to\nobtaining his professional securities licenses, Stan is a Certified Fund Specialist and a\nCertified Senior Advisor. Stan attained these designations in order to better help his clients\nachieve their financial goals. He leverages his real-world experience to contribute to the\nNFEC’s Curriculum Advisory Board.\nKristina McCormick has extensive experience in developing curricula and educational\nprograms from inception. Ms. McCormick was instrumental in the NFEC’s project-based\nlearning program for teens and young adults. She was able to apply classroom teaching\nmethodology and curriculum mode", "created_at": "2026-01-03"}
{"id": "2c584209-c4b9-4171-a993-82f9f679d6a8", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 114, "text": "rograms from inception. Ms. McCormick was instrumental in the NFEC’s project-based\nlearning program for teens and young adults. She was able to apply classroom teaching\nmethodology and curriculum models to promote active student learning through the\nintegration of technology in order to address the varied learning needs of all students.\nFramework for Teaching\nPersonal Finance\n94\n\nGlossary Andragogy – The science of understanding (=\ntheory) and supporting (= practice) lifelong\nand life-wide education of adults. Andragogy\nconsists of teaching strategies focused on\nadults, and is often interpreted as the process\nof engaging adult learners in the structure of\nlearning experience.\nBenchmarks – Performance levels that\nrepresent best practices and clearly define\nstandards for comparison.\nCertified Financial Education Instructor\nBenchmarks – Six categories of guidelines\ndeveloped by the National Financial Educators\nCouncil with specific targets for implementing a\nfinancial education program. Included in these\nstandards are the content and skills necessary\nto teach financial capability effectively.\nComponents (Narratives) – Distinct aspects of\na Domain as defined by the Framework for\nFinancial Education Instructors.\nCritical Attributes – Characteristics of teaching\npractice which may not be evident in all\nsituations at all times. Instead, they can be\nused as the “look for” and “listen for” in teaching\npractice.\nDomains of Financial Education Instructor’s\nPractice – Four main areas of", "created_at": "2026-01-03"}
{"id": "6000b5d2-dd9a-458e-9c6c-4c906a382930", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 115, "text": "be evident in all\nsituations at all times. Instead, they can be\nused as the “look for” and “listen for” in teaching\npractice.\nDomains of Financial Education Instructor’s\nPractice – Four main areas of effective\nteaching practice (Planning and Preparation,\nEnvironment, Instruction, and Professional\nResponsibilities).\nElements – Specific aspects of a component\nnarrative as defined by the Framework for\nFinancial Education Instructors Frameworkon-a-Page.\nFinancial Capability – Extended thinking\nregarding personal finance topics which\nrequires connections, extension, and complex\nreasoning to make financial decisions aligned\nwith one’s personal financial goals. A focus on\nbehavior molding or modification is a core\nprinciple of financial capability.\nFramework for Teaching\nPersonal Finance\n95\n\nFinancial Literacy – Possessing the Levels of Performance – The Framework for\nknowledge and ability to recall information Financial Education Instructor’s rubric has\nrelated to personal finance. Possessing four levels of performance: Unsatisfactory –\nconceptual knowledge about how money represents teaching that is below licensing\nworks. standard of “do no harm” or where the\nFinancial Education Instructor does not\nFinancial Psychology – The behavioral yet have understanding of the concepts\ncharacteristics related to personal finance underlying the component; Basic – represents\ntopics. teaching that is sporadic, intermittent, or\notherwise not entirely successful but where\nFinancial Content – The m", "created_at": "2026-01-03"}
{"id": "c05e9ad1-25ad-407b-ae1f-2a8ae1b771bc", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 116, "text": "stics related to personal finance underlying the component; Basic – represents\ntopics. teaching that is sporadic, intermittent, or\notherwise not entirely successful but where\nFinancial Content – The material or\nthe Financial Education Instructor has\ninstruction that helps participants improve\nsome understanding of concepts underlying\ntheir financial literacy levels and/or financial\nthe component; Proficient – represents\ncapabilities.\nFinancial Education Instructors who have\na deep knowledge of content, professional\nFinancial Educator – Anyone who teaches\nknowledge of participants and curriculum,\npersonal finance, including volunteers,\nand a broad repertoire of strategies and\neducators, financial professionals, or any\nactivities to use with participants; and\nother individual who teaches personal\nDistinguished – represents a master\nfinance. No qualifications are needed.\nteaching level where instructors make\nsignificant contributions in the classroom to\nCertified Financial Education Instructor – A\nencourage participants to take considerable\nfull-time or part-time financial educator\nresponsibility for their own learning, as\nwho has graduated from the NFEC’s Certified\nwell as outside the classroom as leaders\nFinancial Education Instructor course. This\namong educational peers and the broader\nprofessional development course meets the\ncommunity.\nFramework for Teaching Personal Finance\nstandards and the instructor must meet\nNarratives – Distinct aspects of a Domain\nthe Proficient leve", "created_at": "2026-01-03"}
{"id": "783b980e-94ae-43ed-95b8-4ab989d97909", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 117, "text": "roader\nprofessional development course meets the\ncommunity.\nFramework for Teaching Personal Finance\nstandards and the instructor must meet\nNarratives – Distinct aspects of a Domain\nthe Proficient level of the Framework for\nas defined by the Framework for Teaching\nTeaching Personal Finance standards in\nPersonal Finance.\norder to obtain certification.\nParticipant – A school-age student, adult, or\nFramework-At-A-Glance – One-page\ngroup that participates in or partakes of the\ndocument that provides “at a glance – the\ninstruction.\nfour key priority areas of the Framework for\nFinancial Education Instructors,” as well as\nPedagogy – The science and art of education.\naligned components and support elements\nIts aims range from skills acquisition to\nfor each domain.\nfull development of the human being. In\ncorrelation with instructive strategies, the\nKey Performance Indicators – Metrics used to\ninstructor’s own philosophical beliefs of\nmeasure progress toward an individual’s or\ninstruction are harbored and governed by\norganization’s stated objective.\nthe pupil’s background knowledge and\nexperience, situation, and environment, as\nwell as learning goals set by the participant\nand the financial education instructor.\nFramework for Teaching\nPersonal Finance\n96\n\nReferences\n[1] Annamaria Lusardi and Olivia S. Mitchell, NBER Working Paper No. 17078 (May 2011),\nBaby Boomer retirement security: The roles of planning, financial literacy, and housing\nwealth.\n[2] Bennett et al., BMC Geriatrics, 12:30", "created_at": "2026-01-03"}
{"id": "27d05f0d-59a3-40e8-bd2c-3d60d363705e", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 118, "text": "d Olivia S. Mitchell, NBER Working Paper No. 17078 (May 2011),\nBaby Boomer retirement security: The roles of planning, financial literacy, and housing\nwealth.\n[2] Bennett et al., BMC Geriatrics, 12:30 (2012), Correlates of health and financial literacy\nin older adults without dementia.\n[3] Max Nisen, Business Insider (Sep. 16, 2013), Impact of Teachers on Lifetime Earnings.\n[4] Pamela D. Tucker and James H. Stronge, Association for Supervision and Curriculum\nDevelopment (2005), Linking Teacher Evaluation and Student Learning.\n[5] William J. Webster and Robert L. Mendro, Dallas Public Schools (1997), The Dallas ValueAdded Accountability System Report.\n[6] W. L. Sanders, S. P. Wright and S. P. Horn, Journal of Personnel Evaluation in Education, Vol.\n11 (1997), Teacher and classroom context effects on student achievement: Implications\nfor teacher evaluation.\n[7] R. J. Marzano, D. J. Pickering and J. E. Pollock, Association for Supervision and Curriculum\nDevelopment, Alexandria, VA (2001), Classroom instruction that works: Research-based\nstrategies for increasing student achievement\n[8] W. L. Sanders, Financial Literacy and Education Committee (2006), Taking Ownership of\nthe Future.\n[9] Ben Johnson, Principal, blog article (undated), Student Commitment Depends on Teacher\nCommitment.\n[10] Randal C. Archibold, New York Times article (November 18, 1999), Students’ Success\nDepends on Teachers Most, Poll Says.\n[11] Kenneth Leithwood, Karen Seashore Louis, Stephen Anderson and Kyla Wah", "created_at": "2026-01-03"}
{"id": "4c65165b-246e-4848-b74e-f1d8a91b54a5", "doc_id": "6b223d78-dd32-4254-833f-7a601326e8ea", "title": "Framework-For-Teaching-Personal-Finance", "source_file": "pdfs\\Framework-for-Teaching-Personal-Finance.pdf", "chunk_index": 119, "text": "[10] Randal C. Archibold, New York Times article (November 18, 1999), Students’ Success\nDepends on Teachers Most, Poll Says.\n[11] Kenneth Leithwood, Karen Seashore Louis, Stephen Anderson and Kyla Wahlstrom,\nWallace Foundation, Review of Research (undated), How leadership influences student\nlearning.\n[12] Corinne Baron-Donovan, Richard L. Wiener, Karen Gross and Susan Block-Lieb,\nAssociation for Financial Counseling and Planning Education (2005), Financial Literacy\nTeacher Training: A Multiple-Measure Evaluation.\n[13] Richard Cordray, Director of the Consumer Financial Protection Bureau, Federal Reserve\nBank of Chicago, Visa Inc. Financial Literacy and Education Summit, Chicago, IL (April\n17, 2013), from prepared remarks.\n[14] Harrison Jacobs, Business Insider article (October 11, 2013), Here’s How to Raise\nTeachers’ Salaries without Spending a Dime.\nFramework for Teaching\nPersonal Finance\n97\n\nThe National Financial Educators Council is dedicated to\ncreating a world where people are informed to make qualified\nfinancial decisions that improve their lives, the lives of their\nloved ones, and the lives of people they reach around the globe.\nThrough demand- and supply-side surveys, research, and\nthink tanks, the NFEC shares best practices with others in\nthe industry so they can develop or improve their financial\neducation programs.\nWebsite:\nwww.FinancialEducatorsCouncil.org\nContact:\ninfo@financialeducatorscouncil.org\n415-729-7290", "created_at": "2026-01-03"}
