{"id": "331cea5e-4903-48c5-b78c-53fa12bbbdd3", "doc_id": "16873511-51ae-487a-bfee-435238800c4b", "title": "Kwsp Gov My W Article Fomo Shopping", "source_file": "pdfs\\kwsp_gov_my_w_article_fomo_shopping.pdf", "chunk_index": 0, "text": "Member Employer Corporate EN\nFitri Azmy Date: 18 Jul 2025\nShare  \nAre You A FOMO Shopper? 5\nSigns You’re Overspending\nWithout Realising Related Reads\nPERS\nFINA\nHow M\nYou S\nPERS\nFINA\nCeleb\nDeep\nPERS\nFINA\n7 Way\nMana\nPERS\nYou’re scrolling through Instagram and BAM! Your favourite\nFINA\ninfluencer just posted about a new \"must-have\" skincare product.\n5 Exp\nThe next thing you know, it's in your cart, and your bank account is\nAfter…\nscreaming for mercy.\nPERS\nBrands know exactly how to make you feel like you have to buy\nFINA\nsomething. You’ve probably seen lines like “Only 3 left!” or “Last\nWant\nchance to buy!” — all designed to trigger urgency and make you\nGreen\nclick ‘Buy Now’. These marketing tactics are meant to rush you into\nspending, even if you don’t really need the item. PERS\nFINA\nWelcome to the FOMO Consumerism Club — membership is free,\n5 Rea\nbut the spending never stops.\nYou N\nWhat is FOMO consumerism?\nTable of Contents\nFOMO stands for Fear of Missing Out — that feeling when it seems\nlike everyone else is buying, doing, or wearing something cool… and\nyou don’t want to be left out.\nConsumerism, on the other hand, is all about the habit of\nconstantly buying things — not always because you need them, but\nbecause they’re trendy, on sale, or hyped by influencers.\nPut those together and you get FOMO consumerism: when your\nshopping habits are driven more by pressure, social trends, or fear\nof missing out than by actual need.\nTest yourself: Are you a FOMO shopper?\nLet’s see if y", "created_at": "2026-01-03"}
{"id": "54bc0019-f7b5-4ab0-aa8b-9f830403ef93", "doc_id": "16873511-51ae-487a-bfee-435238800c4b", "title": "Kwsp Gov My W Article Fomo Shopping", "source_file": "pdfs\\kwsp_gov_my_w_article_fomo_shopping.pdf", "chunk_index": 1, "text": "er and you get FOMO consumerism: when your\nshopping habits are driven more by pressure, social trends, or fear\nof missing out than by actual need.\nTest yourself: Are you a FOMO shopper?\nLet’s see if you’ve fallen into the trap. Go through the checkpoints\nbelow — answer Yes or No for each one and check your score at the\nend!\n1. Social media is making you spend more\nDo you buy things just because everyone else has them on\nInstagram or TikTok?\nYes No\nIf your answer is YES, congrats — you might be a FOMO shopper.\nMalaysian local brands thrive on hype, and it’s easy to feel like you\nneed to “keep up”.\nBreak the cycle: Try the \"24-hour rule\"— before buying, wait a day\nand see if you still want it. Most impulse buys lose their appeal\novernight!\n2. You often regret your purchases\nDo you regret buying something within a week?\nYes No\nLet’s be honest — that trendy baju you bought during a flash sale...\nis it still in your wardrobe with the tags on? If so, you’re not alone.\nMalaysian shopping culture thrives on seasonal sales (hello, 11.11!),\nmaking it hard to resist.\nBreak the cycle: Keep a \"regret list\" — write down past purchases\nthat weren’t worth it. This will remind you to think twice before\nbuying again.\nRead also: 3 Unwise Spending Habits in Your 20s\n3. You shop to cope with stress\nDo you shop when you're stressed, bored, or sad?\nYes No\nRetail therapy may feel rewarding at first, but the high is shortlived. It starts with \"I deserve this,\" and before you know it, you're\nknee-deep", "created_at": "2026-01-03"}
{"id": "d0f29c32-3b0f-4bab-a948-9d09a9ee8517", "doc_id": "16873511-51ae-487a-bfee-435238800c4b", "title": "Kwsp Gov My W Article Fomo Shopping", "source_file": "pdfs\\kwsp_gov_my_w_article_fomo_shopping.pdf", "chunk_index": 2, "text": "o you shop when you're stressed, bored, or sad?\nYes No\nRetail therapy may feel rewarding at first, but the high is shortlived. It starts with \"I deserve this,\" and before you know it, you're\nknee-deep in shopping bags.\nOnline stores make this even easier (just one tap, and BOOM —\ninstant gratification!).\nBreak the cycle: Swap retail therapy with “dopamine\nalternatives”— exercise, music, or even just a good conversation.\nTrust us, your wallet will thank you.\n4. Your house is full of stuff you don’t use\nIs your home filled with things you rarely (or never) use?\nYes No\nIf your shelves are lined with unused gadgets and impulse buys,\nyou might be hoarding FOMO purchases. It’s common, especially\nwith all the exclusive drops from local brands.\nBreak the cycle: Follow the “One in, One out” rule — if you buy\nsomething new, donate or sell one item you no longer need.\n5. Your spending is causing anxiety\nDo your spending habits make you anxious?\nYes No\nIf your bank balance gives you stress or guilt, it may be time to\nassess whether your shopping habits are supporting or sabotaging\nyour financial health.\nBreak the cycle: Set a clear “fun budget” each month. When the\nlimit is up, step away from the cart!\nCheck Your FOMO Score Now!\nWhat’s your FOMO score?\nScore Range Description\n0–1 Yes You’re in control! You make thoughtful,\nintentional purchases. Keep it up — your\nwallet (and future self) will thank you.\n2–3 Yes Caution zone. FOMO may be influencing your\nspending more than you think. Time", "created_at": "2026-01-03"}
{"id": "d22be7db-b6fb-455b-a841-0c834632b153", "doc_id": "16873511-51ae-487a-bfee-435238800c4b", "title": "Kwsp Gov My W Article Fomo Shopping", "source_file": "pdfs\\kwsp_gov_my_w_article_fomo_shopping.pdf", "chunk_index": 3, "text": "in control! You make thoughtful,\nintentional purchases. Keep it up — your\nwallet (and future self) will thank you.\n2–3 Yes Caution zone. FOMO may be influencing your\nspending more than you think. Time to pause\nand rethink those shopping habits.\n4–5 Yes FOMO consumerism is running the show. But\ndon’t worry — now that you’re aware, you can\ntake back control and shop with intention.\nHow to overcome FOMO consumerism in\nMalaysia\nBreaking free from FOMO shopping isn’t about cutting out all fun\npurchases — it’s about buying with intention. Malaysian brands will\nalways launch the next \"must-have,\" but the real question is: do\nyou really need it? Here are 5 ways to take control:\n1. Practise mindful shopping\nCreate a wishlist and wait a few days before buying. This helps you\nseparate wants from needs.\n2. Curate your social feed\nUnfollow influencers or pages that pressure you to buy constantly.\nFollow creators who promote conscious living instead.\n3. Track your spending\nUse local budgeting tools or an expense tracker app like\nBelanjawanku to stay within your monthly limits.\nDownload the Belanjawanku app from the Apple App Store,\nGoogle Play Store or Huawei AppGallery.\n4. Set a “fun budget”\nAllocate a specific amount each month for non-essentials — and\nonce it’s used up, step away from the cart.\n5. Reflect on past purchases\nLook back at items you rarely use. Were they worth it? Let that\nguide your next buying decision.\nRead also: Master Your Budget: Steps, Importance & Tips\nShop smart, n", "created_at": "2026-01-03"}
{"id": "612ee4ff-9ddc-4c92-a70a-632449fd2eae", "doc_id": "16873511-51ae-487a-bfee-435238800c4b", "title": "Kwsp Gov My W Article Fomo Shopping", "source_file": "pdfs\\kwsp_gov_my_w_article_fomo_shopping.pdf", "chunk_index": 4, "text": "art.\n5. Reflect on past purchases\nLook back at items you rarely use. Were they worth it? Let that\nguide your next buying decision.\nRead also: Master Your Budget: Steps, Importance & Tips\nShop smart, not out of FOMO\nFOMO-driven spending is common — but it doesn’t have to control\nyou. By becoming more aware of your habits and making mindful\nchoices, you can enjoy shopping without guilt.\nBuy what adds value, not just what’s trending!\nMember Employer Corporate Others\nRegister As A Member Introduction About Us Terms & Conditions\nGrow Your Savings Responsibilities Organisational Privacy Policy\nStructure\nManage Your EPF Online Platform Security Policy\nAccount Corporate\nEmployers Education Disclaimer\nGovernance\nHome Ownership Programme\nOnline Security Tips\nInvestment\nFinancial Life Stages\nOther Links\nSustainability\nHealth Protection\nForms\nBusiness Partners\nKWSP i-Akaun App\nResource Centre\nNews & Highlights\nAchievements\nCareers\nProcurement\nWhistleblowing &\nAnti‑Fraud\nContact Us", "created_at": "2026-01-03"}
