{"id": "f0df0eae-8600-4da0-aa43-02bc7e0d3a85", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 0, "text": "Policy and Standards\nFramework\nfor High School\nFinancial Literacy\nEducation\nDesigned to empower policymakers, educational\ninstitutions, and various stakeholders to\noptimize the effectiveness of financial education\ninitiatives while adhering to the same rigorous\neducational standards demanded by other\nfoundational disciplines.\n\nElevate Financial\nEducation Mandates\nto Meet Standards of\nOther Core Subjects\nSetting financial education standards on\nan equivalent basis with other subject\nareas could make a powerful difference\nin learning outcomes that would have a\nmajor impact on all Americans’ lives.\nFinancial education should be held to\n(at least) the same standards as other\nsubjects in the typical school curriculum.\nThe basic premise of these standards\nis that financial literacy be treated\nthe same as any other topic taught in\nschools – that is, the topic of financial\nliteracy should be held at least to the\nsame standards of rigor, pedagogy,\nand measurement as any other subject\nmatter.\nOther subjects taught require specific\neducator qualifications, measured\noutcomes, quality of curriculum materials\nand educational methods, scaffolding,\nparental involvement, and ongoing\neducation options. Financial literacy\ndeserves the same treatment.\n2\n\nPersonal Finance Delivers Relevant Skill\nSets that Benefits 100% of Students\nThe consequences of financial illiteracy across the nation are grim: oppressive debt, lack of savings,\nincreasing numbers of bankruptcies, little or no retirement funds", "created_at": "2026-01-03"}
{"id": "fead7254-ed23-48d1-96b7-93d673fcba07", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 1, "text": "that Benefits 100% of Students\nThe consequences of financial illiteracy across the nation are grim: oppressive debt, lack of savings,\nincreasing numbers of bankruptcies, little or no retirement funds. And these negative consequences spill\nover into people’s relationships, work and personal lives, and physical and mental health.\nSimple early mistakes like paying a bill late, getting into excessive student debt, lacking employment\nskills, and deficient account management abilities can lead to long-term and potentially devastating\nconsequences.\nUnlike other core subjects, financial literacy benefits 100% of students and teaches practical information\ngraduates can implement in their daily lives. Other subjects require students to learn information most\nwill never use for employment or in their daily lives.\n% of\nSubject Requirements Graduates\nthat Benefit\nFinancial Literacy 0 – 1 semester (1) 100%\nMath 3 – 4 years (2,3) <25% (4)\nScience 2 – 4 years (5) 5% (6)\nAmerican Literature 1 year (7) <2% (7,8)\nForeign Language 1 – 2 years (3) 15% (9)\nSocial Studies 3 – 4 years (5) 16% (10)\n3\n\nProblem with Current Financial Literacy Mandates\n& Rating Systems\nCurrent financial literacy mandates fall short. Every US state fails to mandate financial literacy programs\nthat meet basic requirements of all other core topics taught in high school. A review of recent literature\non financial literacy mandates for high school indicates that all state mandates currently in place lack key\nelements requir", "created_at": "2026-01-03"}
{"id": "2bd147ad-11c5-4bac-8b64-bd99723079dc", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 2, "text": "all other core topics taught in high school. A review of recent literature\non financial literacy mandates for high school indicates that all state mandates currently in place lack key\nelements required for other courses.(1,11–13)\nCurrent policy leaves setting educational standards up to each individual state. Although no standards are\nmandated at the federal level, the US Department of Education has developed some guidelines that are\navailable for states to adopt voluntarily.\nSeveral organizations grade US states according to their financial education standards.(1,11,12)\nHowever, those state ratings are based primarily on the amount of instruction time and whether or not\nrequirements or testing are in place. To date no one evaluates financial education in terms of program\nquality and rigor, teacher qualifications, or testing characteristics. Thus a state’s school system could have\nsubpar programming, taught by severely underqualified teachers, with inadequate testing – and those\nfactors would not be considered in the ratings.\nFinancial Literacy Programming Objectives\nThe primary outcome goal of any financial education program is a measurable impact on students’ nearand long-term financial health. With high school-level coursework, there is added urgency – this phase\nrepresents the last proactive opportunity to help students prevent near-term financial problems and put\ngraduates on course toward greater financial wellness.\nIf the objective is for students to learn how to\nearn", "created_at": "2026-01-03"}
{"id": "acedfbc2-5a13-483c-a0b1-be1efecfa765", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 3, "text": "he last proactive opportunity to help students prevent near-term financial problems and put\ngraduates on course toward greater financial wellness.\nIf the objective is for students to learn how to\nearn income and manage their money – which\nis essential to preparing them for adult life –\nthey require rigorous instruction that engages\nhigher-level thinking skills and ensures longterm retention. Teachers of the subject should\nbe well-qualified, competent, and skilled at\nengaging and motivating students. Testing\nshould evaluate not only students’ knowledge\nand understanding of the content, but also their\ncapability to analyze and apply the knowledge\nin real-world decision-making.\n4\n\nPolicy and Standards\nFramework for High School\nFinancial Literacy Education\n• Delivered in standalone Program\nclasses and integrated into\nStructure\nother subjects.\n• Assign adequate time and\nlevel of rigor to subject\nmatter.\n• Conduct ongoing\neducation to support long- • Relevant content that\nLesson\nterm outcomes. prepares students for\nPlans\nfinancial life events.\n• Adopt proven curriculum\nthat encourages higher-order\nthinking and application.\n• Customize lesson plans\n• Courses led by highly- based on socio-economic\nqualified personal status.\nEducators\nfinance educators.\n& Leadership\n• Program development\nand deployment\nmanaged by experienced\nleaders.\n• Fund financial literacy\n• Learner outcomes\nprograms.\nfocused on long-term\nProgram\nfinancial wellness and • Encourage parental\nSupport\nearly indicators.", "created_at": "2026-01-03"}
{"id": "b25be2f5-17e6-447f-9dd1-cc5f773f7c15", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 4, "text": "and deployment\nmanaged by experienced\nleaders.\n• Fund financial literacy\n• Learner outcomes\nprograms.\nfocused on long-term\nProgram\nfinancial wellness and • Encourage parental\nSupport\nearly indicators. involvement and provide\nparents with access to\nresources.\n• Start financial education\ncourses in elementary\nschool.\n5\n\nProgram\nStructure\nDelivered in Assign adequate Conduct ongoing\nstandalone classes time and level of education to\nand integrated into rigor to subject support long-term\nother subjects. matter. outcomes.\n\nDelivered in Standalone Classes and Integrated\nInto Other Subjects.\nPersonal finance should be taught as a standalone class and given the same consideration as other\ncore subjects schools teach. To maximize impact, financial education topics should also be integrated\ninto other subjects to promote interdisciplinary learning and connections between different areas of\nknowledge.\nTeaching personal finance as a standalone course is important because it enables a focus on hands-on,\npractical, and “experiential” learning, which has been identified as a key characteristic of effective financial\neducation programs.(14) That is, lessons in a standalone class can incorporate real-world experiences\nrelated to money and take into account students’ perceptions of future goals and upcoming life decisions.\nFor students, taking a standalone personal finance course provides an opportunity to handle real-world\ndecisions in a safe environment.(15) High school students can practice", "created_at": "2026-01-03"}
{"id": "9e24ca3e-700a-4f1e-ac94-986288fd4538", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 5, "text": "upcoming life decisions.\nFor students, taking a standalone personal finance course provides an opportunity to handle real-world\ndecisions in a safe environment.(15) High school students can practice the financial decision-making they\nwill need to undertake post-graduation, such as paying for college, smart budgeting, and beginning to\ninvest for retirement.\nIn addition, integration into other course subjects is helpful to increase students’ repeated exposure\nto lessons and deepen learning. According to a report by the National Association of Secondary School\nPrincipals, effective school subjects are those that are designed to be integrated with other subjects and\nto promote the development of higher-order thinking skills.(16) Moreover, interdisciplinary learning can\nhelp promote a deeper understanding of complex issues and prepare students for the challenges of the\n21st century.\nScenarios\nFallbrook High School falls under a state mandate to offer personal finance instruction at the\n12th-grade level. The school chooses to teach a half-semester standalone course in Personal\nFinance and also to incorporate money management lessons into the required Economics &\nU.S. Government class.\nThis scenario meets standalone and integration requirements.\nCentury High School falls under a state mandate to offer personal finance instruction in\ngrades 9 and 12. The school chooses to teach the 9th-grade section in the required Civics\nclass, and the 12th-grade section in the required U.S. Govern", "created_at": "2026-01-03"}
{"id": "a44c3e27-9480-4bca-addd-d6a589e095af", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 6, "text": "mandate to offer personal finance instruction in\ngrades 9 and 12. The school chooses to teach the 9th-grade section in the required Civics\nclass, and the 12th-grade section in the required U.S. Government course.\nThis scenario does not meet standalone and integration requirements.\n7\n\nAssign Adequate Time and Level of Rigor to\nSubject Matter.\nThe Council for Economic Education tracks progress in personal finance education by state and publishes\nbiennial reports. As indicated by the most recent report (2022), currently an insufficient amount of time\nis allocated toward personal finance in schools. While 9 states, including Alabama, Missouri, and Ohio,\nrequire standalone personal finance education for high school graduation, just 0.5 credits is the common\nrequirement. Other states, such as California and Colorado, have a standalone personal finance course that\nis not required but may be offered as an elective. In states such as Arizona and Michigan, personal finance\nis integrated into other courses such as social studies or economics.(1)\nOverall, the survey found that the average amount of time spent on personal finance education in high\nschools is 18 hours, which is well under the time needed to gain and retain knowledge and well below\nwhat is required to make any long-term measurable impact on students’ lives in the future.\nUsing two models – Bloom’s Taxonomy of Higher Order Thinking Skills and Webb’s Depth of Knowledge\n(DOK) Framework (17,18) – we find that the current time a", "created_at": "2026-01-03"}
{"id": "82ba5c0a-6874-410d-8266-a9a1d5c8ba41", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 7, "text": "ble impact on students’ lives in the future.\nUsing two models – Bloom’s Taxonomy of Higher Order Thinking Skills and Webb’s Depth of Knowledge\n(DOK) Framework (17,18) – we find that the current time and rigor requirements of most financial literacy\nprograms only get students to use lower-order thinking skill sets. Simply having students reach the\n‘understanding/remembering’ or ‘recall & reproduction’ levels (as shown in the graphic below) does little\nto improve students’ long-term financial wellness.\nCREATING 4\n4 EXTENDED\nTHINKING\nEVALUATING 4\nANALYZING 3 3 S T T H R I A N T K E IN GI G C\nAPPLYING 2 2 C S O K N IL C L E S P T & S\nUNDERSTANDING 1\n1 RECALL &\nREPRODUCTION\nREMEMBERING 1\nBloom Webb\n8\n\nGiven the importance of personal finance skills in adult life, the NFEC is advocating for more\ncomprehensive personal finance education in high schools. Increased emphasis on personal finance\neducation in high school can better prepare students for the financial challenges they will face as adults,\nand help them make informed decisions about managing their money and planning for their future.\nAt a minimum, every graduate should be able to develop an informed near-term financial plan and strategy\n(as stated in point ‘Relevant Content that Prepares Students for Financial Life Events’ below). Ideally,\nstudents should also have a long-term financial plan upon graduation.\nScenarios\nState A mandates one full year of financial education as a standalone course in high school\nand also require", "created_at": "2026-01-03"}
{"id": "ed113fd4-3e96-4a5c-9109-f87c6a6212f0", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 8, "text": "). Ideally,\nstudents should also have a long-term financial plan upon graduation.\nScenarios\nState A mandates one full year of financial education as a standalone course in high school\nand also requires that personal finance lessons be integrated into Civics & US Government\nclasses. The program materials and pedagogy the state requires are designed to encourage\nstudents to reach at least the ‘analyzing’ level on Bloom’s Taxonomy and develop a long-term\nfinancial plan by the end of the course.\nState A meets time and rigor requirements.\nState B mandates that financial education be offered as an elective at the high school level.\nSchool districts are given discretion to decide which program materials and pedagogy are\nused. Most schools use a curriculum package designed to get students to recall the content\nwell enough to pass a final test.\nState B does not meet time and rigor requirements.\n9\n\nConduct Ongoing Education to Support Long-term\nOutcomes.\nWhy does our support for students’ education end when they graduate from high school? There is\nopportunity for continued contact and support of students’ financial well-being through ongoing\neducation.\nHigh school students forget the majority of what they learn in school as soon as their final exams\nare over. That’s because they rarely have occasion to use the learning in real-life situations. Financial\neducation represents a major exception to that rule. Young adults will be called upon to make real-world\nfinancial decisions even prio", "created_at": "2026-01-03"}
{"id": "2d790f8f-5981-45da-8373-aaed59b9bbd4", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 9, "text": "e occasion to use the learning in real-life situations. Financial\neducation represents a major exception to that rule. Young adults will be called upon to make real-world\nfinancial decisions even prior to graduation, and will need to manage money across their entire lifetimes.\nThe unifying outcome objective of K-12 financial education should be to produce high school graduates\nwho have the competencies to make qualified financial decisions, manage their money effectively, and\nearn income that supports their needs and long-term plans.\nWith that overarching goal in mind, education should be continuous rather than intermittent, and\nshould continue even after students graduate from high school. Ongoing education components can\nbe automated and provided to students over the summer break. This piece is especially important after\ngraduation. Graduates need a trusted source for information, inspiration, and support as they prepare\nto meet life’s real-world challenges. Those who wish to learn more about personal finance should be\nprovided with ample opportunities to do so.\nTechnology provides many opportunities to offer graduating students ongoing financial education. We\nneed to move away from the mindset that education ends when students graduate from high school and\ntake a long-term approach to their financial success and well-being.\nScenarios\nMs. George teaches personal finance at Marston High School. In addition to the lessons she\npresents in the classroom, she has developed a set", "created_at": "2026-01-03"}
{"id": "2b6ad051-01d0-42b8-952e-7f6cf2ae67d2", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 10, "text": "roach to their financial success and well-being.\nScenarios\nMs. George teaches personal finance at Marston High School. In addition to the lessons she\npresents in the classroom, she has developed a set of brief “drip” education lessons designed\nto be sent to students at intervals over the summer break to keep financial education in front\nof mind and give them tools and exercises to practice what they’ve learned.\nThis scenario meets ongoing education standards.\nMs. Harry teaches personal finance at Wilmoth High School. She uses a curriculum package\nrecommended by her school district, but the program has no ongoing education materials or\nsuggestions.\nThis scenario does not meet ongoing education standards.\n10\n\nLesson\nPlans\nAdopt proven\nRelevant content Customize lesson\ncurriculum that\nthat prepares plans based on\nencourages higherstudents for socio-economic\norder thinking\nfinancial life events. status.\nand application.\n\nRelevant Content that Prepares Students for\nFinancial Life Events.\nAnother factor that contributes to the effectiveness of a school subject is the relevance of content to\nhelping students prepare for the financial realities of life. According to a 2019 report by the Organization\nfor Economic Co-operation and Development, effective school subjects are those that are designed to be\nengaging, meaningful, and relevant to students’ lives and interests. Further, engaging and relevant content\ncan help promote student motivation, curiosity, and interest in learning about", "created_at": "2026-01-03"}
{"id": "f4cc8917-f107-4f20-9201-4381e460e2da", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 11, "text": "esigned to be\nengaging, meaningful, and relevant to students’ lives and interests. Further, engaging and relevant content\ncan help promote student motivation, curiosity, and interest in learning about financial topics.(19) For\nhigh school students, personal finance instruction should help them build skills to handle the real-world\ndecisions they need to make now or soon in their lives.\nHowever, most states that require financial education just offer a list of random topics to be included,\nrather than thoughtfully-designed lesson plans that prioritize students’ most urgent money management\nneeds. As an example, the Florida state school financial education standards measure adopted in 2022\nincludes, among others, “Balancing a checkbook” and “Receiving an inheritance and related implications”\nas required study topics.(20) Other topics mandated – such as “Basic principles of money management,\nsuch as spending, credit, credit scores, and managing debt, including retail and credit card debt” and “Basic\nprinciples of personal insurance policies” – are certainly relevant and important. But the requirements\ncould define real-world outcomes for students if they were\nbetter framed as topics related to the students’ life stage.\nHigh school students are at a life stage where they have\na high-priority need to learn specific financial skills\nthat prepare them to move out on their own, pay for\nhigher education, and set up and manage the right\nfinancial accounts. At what level is “Receiving a", "created_at": "2026-01-03"}
{"id": "d6370195-f548-4cfd-a82c-3a82775aed51", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 12, "text": "priority need to learn specific financial skills\nthat prepare them to move out on their own, pay for\nhigher education, and set up and manage the right\nfinancial accounts. At what level is “Receiving an\ninheritance and related implications” related\nto a typical high school student’s current\nlife and needs? Instead, they need to learn\ntimely topics to avoid making mistakes\nthat will cost them years of time and\nmoney to rectify. Youth need to start\nbuilding a mountain, rather than\ndigging out of a hole.\nThe NFEC calls for standards in high\nschool financial education that at minimum\nrequire lessons based on near-term life\nevents to ensure that our youth have the\nskills necessary to avoid common financial\npitfalls that can disrupt their financial health.\n12\n\nHere are some of the most common financial pitfalls graduates fall into and financial milestones for which\nstudents should be prepared when they graduate:\nInitial Accounts Needed / Account Management\nReason: Issues such as overdrafts or frequent insufficient funds can result in fees, potential\naccount closure, and the inability to open other bank accounts, which can leave high-cost check\ncashing as the only option.\nCredit-building & Protection\nReason: A small credit mistake can lead to years of limited access to financial resources, higher\ninterest rates, fewer job opportunities, inability to rent housing, and difficulty obtaining loans or\ncredit.\nIndependent Living\nReason: Not knowing how to manage money when living independe", "created_at": "2026-01-03"}
{"id": "667d0503-b976-4865-86d4-eba76a892995", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 13, "text": "s, higher\ninterest rates, fewer job opportunities, inability to rent housing, and difficulty obtaining loans or\ncredit.\nIndependent Living\nReason: Not knowing how to manage money when living independently can lead to financial\ninstability, debt, credit issues, and difficulty achieving long-term financial goals.\nJob Search, Resumes, & Interviewing for Early Jobs\nReason: Not knowing how to interview for a job or having a subpar resume can lead to\nmissed opportunities, decreased confidence, lower wages, and potential difficulty securing\nemployment.\nCareer and Income Exploration\nReason: Failure to explore career options while young can lead to dissatisfaction with work,\nlack of fulfillment, and missed opportunities for personal and professional growth. It is also a\ncause of added student loan debt for young adults who switch majors.\nHigher Education Exploration & Proactive College Financial Planning\nReason: Student loan debt in the US currently totals $1.7 trillion,(21) with the average graduate\nowing $28,950.(22) These loans are often taken out by youth who lack the knowledge to make\nqualified financial decisions and can lead to long-term debt and missed opportunity cost that\nputs off important financial milestones like investing.\nAutomobile Options\nReason: Overspending on a vehicle leads to financial strain, limited funds for other expenses,\nand potential difficulty selling or trading in the vehicle in the future. The inability to make\ntimely payments can have impact on one’s c", "created_at": "2026-01-03"}
{"id": "3a69fc2a-6ea2-4471-a17d-e8ad32955937", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 14, "text": "leads to financial strain, limited funds for other expenses,\nand potential difficulty selling or trading in the vehicle in the future. The inability to make\ntimely payments can have impact on one’s credit, interest rates, and ability to make other\npurchases.\n13\n\nScenarios\nApplegate High School offers a one-semester personal finance class at the 12th-grade level.\nOn the first day of the course, students complete a survey asking them to identify the five top\nlife events they need to address before graduation. The instructor uses the data to choose the\ncurriculum lessons that specifically help students prepare for their most pressing upcoming\nlife events.\nThis scenario meets the standards for relevant content\nthat prepares students for life events.\nUnderwood High School offers a one-semester personal finance class at the 12th-grade\nlevel. The instructor selects topics to cover based on a list of resources provided on the state\nDepartment of Education website.\nThis scenario does not meet the standards for relevant content\nthat prepares students for life events.\n14\n\nAdopt Proven Curriculum that Encourages Higherorder Thinking and Application.\nAnother factor that contributes to the success of financial education programming is the use of a\nrigorous and engaging curriculum. According to a report by the National Research Council, a high-quality\ncurriculum is one that is aligned with state standards, is challenging and relevant to learners, and\npromotes deeper understanding of key co", "created_at": "2026-01-03"}
{"id": "06427209-ccce-4c8c-adb0-7b30f917243b", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 15, "text": "o a report by the National Research Council, a high-quality\ncurriculum is one that is aligned with state standards, is challenging and relevant to learners, and\npromotes deeper understanding of key concepts and skills. Moreover, an engaging curriculum can help\nmotivate students and foster a love of learning.(23)\nLessons should increase in rigor and work students toward higher-order learning skill sets (for example,\nsee Bloom’s Taxonomy of Higher-order Thinking Skills and Webb’s Depth of Knowledge framework).(17,18)\nHigh school students should be completing project-based learning and actively planning and building\ntheir financial foundations in alignment with near-term life events.\nTeaching financial education for maximum effect demands the best quality of curriculum resources and\neducational methodologies that optimize their delivery. The current information regarding financial\neducation requirements in schools shows that some states simply provide teachers with a list of links\nto random resources.(24) In many states, mandated lessons do not align with national standards, and\nthe materials used to teach personal finance are often subpar in educational value. Some even promote\nfinancial products or government organization agendas.\nStandards should mandate that teachers select\neducational methodologies that help students\nimprove their long-term financial outlooks.\nReaching this goal requires helping learners\nadopt positive financial behaviors and\nsystems that support their jour", "created_at": "2026-01-03"}
{"id": "e3fcc504-b1d9-47a5-be69-36d53eda1b23", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 16, "text": "ational methodologies that help students\nimprove their long-term financial outlooks.\nReaching this goal requires helping learners\nadopt positive financial behaviors and\nsystems that support their journey\ntoward financial security and wellness.\n15\n\nPrograms should be built around rigorous research-based instructional methodologies, including:\n• Backwards planning to ensure that lessons and activities build upon each other to support learner\nprogress toward pre-defined outcomes.\n• Include active learning techniques, visual cues, case method-based activities, and project-based\nlearning.\n• Audience adaptation to enable instructors to scaffold and adjust activities to support learners of all\ndifferent motivations, knowledge levels, and learning styles.\n• Engagement with the affective dimension of learning and motivation in general, and of changing\nfinancial behaviors more specifically.\n• Recommendations for system development and long-term follow-up and support to encourage\npermanent change.\n• Have the students complete activities that help them with their current and near-term financial needs.\nExamples: creating a budget they can use now, deciding on a higher education path from an ROI\nperspective, setting up bank accounts, etc.\nScenarios\nMrs. Jones’s financial education class is comprised entirely of lecture and quizzes.\nThis class does not meet best practice standards.\nMrs. Terry teaches financial education using different educational methodologies and delivery\ntechniques inclu", "created_at": "2026-01-03"}
{"id": "df7bd080-e296-455e-af61-f67d1c0ad4f8", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 17, "text": "prised entirely of lecture and quizzes.\nThis class does not meet best practice standards.\nMrs. Terry teaches financial education using different educational methodologies and delivery\ntechniques including lecture, case studies, visual cues, activities, and project-based learning.\nThis class aligns with best practice standards.\n16\n\nCustomize Lesson Plans Based on\nSocioeconomic Status.\nSuccessful financial education programs also must be differentiated and personalized to meet the diverse\nneeds of all learners. According to a recent report by the National Center on Universal Design for Learning,\neffective school subjects are designed to be flexible and responsive to the needs and preferences of\nindividual learners. Further, differentiation and personalization can help promote student engagement,\nmotivation, and achievement.(25)\nData should be considered to ensure that students are in a position to overcome any current family\nfinancial challenges and any negative habits picked up through generational influences.\nFor example, a student from a poor family may feel there is little hope to achieve any level of financial\nsecurity; while students from rich families who are given whatever they want may lack understanding of\ndelayed gratification or how to budget.\nSchools and teachers should work together to understand the socioeconomic diversity of a school and\nadjust lesson plans to help students achieve best results. Some data may already be available to support\nsuch differentiation", "created_at": "2026-01-03"}
{"id": "3d6c81ea-4ae1-45f2-8cd8-d39cdbc982e2", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 18, "text": "d work together to understand the socioeconomic diversity of a school and\nadjust lesson plans to help students achieve best results. Some data may already be available to support\nsuch differentiation – for example, the percentage of students in a school who receive subsidized school\nlunches. Surveys and other measurement methods can be employed to deepen this understanding.\nPrograms selected should be flexible so highly-qualified educators can determine areas of most benefit to\nstudents and adjust lessons to meet learners’ needs.\nScenarios\nCaraway High School offers financial education as an elective for students in grades 11 and 12.\nThe instructors have no data available to determine students’ family socioeconomic status, so they\nuse a packaged curriculum that provides the same lessons to all students.\nThis scenario does not meet standards for differentiation by socioeconomic status.\nPalmbridge High School gathers data on students’ family socioeconomic status as part of its\nentry requirements prior to the beginning of each school year. The financial education instructors\nanalyze these data to segment the student population and offer coursework tailored to the needs\nof each group.\nThis scenario meets standards for differentiation by socioeconomic status.\n17\n\nEducators\n& Leadership\nProgram Learner outcomes\nCourses led by\ndevelopment focused on longhighly-qualified\nand deployment term financial\npersonal finance\nmanaged by wellness and early\neducators.\nexperienced leaders. indic", "created_at": "2026-01-03"}
{"id": "dc913a82-4fea-44fd-b8a8-7e5e567227a3", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 19, "text": "p\nProgram Learner outcomes\nCourses led by\ndevelopment focused on longhighly-qualified\nand deployment term financial\npersonal finance\nmanaged by wellness and early\neducators.\nexperienced leaders. indicators.\n\nCourses Led by Highly-qualified Personal\nFinance Educators.\nTeachers’ mastery of both content and pedagogy enables them to effectively convey complex concepts\nto their students. Compared with financial education, all other core subjects taught in school require\nyears of specialized training. But although US states specify educator standards and continuing training\nrequirements for teachers of other subjects, little or no training is provided or mandated to teach financial\neducation.\nTeaching personal finance is different from teaching any other topic in school. Students have behavioral\nand emotional connections to the subject. Every child comes from a different financial situation and has\na unique set of influences and goals. That’s why, as described by the Boston Public Schools’ Interactive\nRubric for Effective Teaching, simply gaining content knowledge is not enough. Effective financial\neducators must be able to encourage students to reach higher levels of thinking. They must choose\nappropriate instructional models and adjust pedagogical approaches to meet student needs.(26)\nAccording to a 2013 report by the National Council on Teacher Quality,\neffective instruction involves the use of research-based instructional\npractices, the provision of timely and constructive feed", "created_at": "2026-01-03"}
{"id": "697da62e-5bcc-4050-b1d6-09b7a2814ff8", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 20, "text": ")\nAccording to a 2013 report by the National Council on Teacher Quality,\neffective instruction involves the use of research-based instructional\npractices, the provision of timely and constructive feedback to students,\nand the use of data to inform and improve student\nlearning. Moreover, effective instruction requires\nteachers who are knowledgeable and skilled in their\nsubject areas and who are committed to ongoing\nprofessional development.(27)\nCompared to any other educational aspect,\nteachers have the greatest impact on\nstudent achievement.(28) Well-qualified\nteachers send more students to college\nand can boost a class’s lifetime income\nby as much as $250,000. On the flip side,\npoor teaching can continue to negatively\naffect students’ lives for many years after\ninstruction ends.\n19\n\nAll personal finance educators should meet the\nstandards set forth in the NFEC’s Framework for\nTeaching Personal Finance. Those standards include:\n• Demonstrating knowledge of the content and\nthe pedagogy/andragogy of improving financial\ncapabilities, financial psychology, and supporting\nthe development of positive financial habits.\n• Demonstrating knowledge of participants’\ncognitive abilities, willingness to change,\nmotivating factors, and interests.\n• Setting instructional outcomes and financial\nbehavior objectives.\n• Demonstrating knowledge of resources.\n• Designing coherent instruction.\n• Designing participants’ assessments.\n• Creating a classroom environment that is safe\nand supportive for", "created_at": "2026-01-03"}
{"id": "cd7d5ee3-9808-46da-82a8-5eb7644851a8", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 21, "text": "ehavior objectives.\n• Demonstrating knowledge of resources.\n• Designing coherent instruction.\n• Designing participants’ assessments.\n• Creating a classroom environment that is safe\nand supportive for students. This includes\nknowing what information students should not\nbe asked to share with the class to protect their\nconfidentiality, privacy, and security.\n• Communicating with participants about\nacquiring or changing financial behaviors.\n• Using questioning and discussion techniques\nthat promote positive financial behaviors.\n• Engaging participants with relevant financial\ninstruction.\n• Using assessment in instruction to measure\nbehavioral change.\n• Demonstrating flexibility and responsiveness to\nparticipants’ learning needs.\n20\n\nScenarios\nMr. Dunleavy is a social studies teacher who is charged with incorporating financial education\ninto a 10th-grade Civics class. He has never taught personal finance before. Mr. Dunleavy is\nan avid investor, listens to personal finance podcasts weekly, and is confident on the topics.\nHe also went through specialized training and learned the methodologies to teach personal\nfinance to maximize results.\nThis situation meets teacher preparation standards.\nMr. Walsh is a social studies teacher who is charged with incorporating financial education\ninto a 10th-grade Civics class. He has never taught personal finance before, but he does his\nbest and presents one segment in his afternoon class.\nThis class aligns with best practice standards.\n21\n\nProgr", "created_at": "2026-01-03"}
{"id": "f757edd2-3b91-4b19-b266-9cbd41e9f5a2", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 22, "text": "a 10th-grade Civics class. He has never taught personal finance before, but he does his\nbest and presents one segment in his afternoon class.\nThis class aligns with best practice standards.\n21\n\nProgram Development and Deployment Managed\nby Experienced Leaders.\nOne of the key factors that contributes to the success of any subject is the direction of experienced\nleaders who have proven their abilities to develop programs that improve student outcomes. According\nto a 2006 study by Waters and Marzano, effective school leaders are those who are able to create a clear\nvision, establish high expectations for student achievement, and provide support and resources to help\nteachers meet those expectations.(29)\nAmong financial education programs currently mandated, most are shaped by legislators and school\nboards with little to no expertise in the development and deployment of financial literacy programming.\nWhile their agendas may be based on good intentions and a desire to help students, their lack of\nexperience and expertise in financial education can do more harm than good.\nIndividuals who lead the development and deployment of financial education should have proven\nabilities in producing financial education programs that deliver positive results. They should represent\norganizations that meet third-party standards for excellence and represent best practices in the financial\neducation space.\nScenarios\nThe Independence School Board has voted to approve a mandate that high school stud", "created_at": "2026-01-03"}
{"id": "37538c59-3471-4c82-86ec-0854341c0de8", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 23, "text": "at meet third-party standards for excellence and represent best practices in the financial\neducation space.\nScenarios\nThe Independence School Board has voted to approve a mandate that high school students\nmust take a half-semester financial education course to graduate. They decide to let each\nindividual high school in the district appoint an educator from within the school to choose the\nprogram materials and resources and determine how they’re implemented.\nThis scenario does not meet program leadership standards.\nThe Center City School Board has voted to approve a mandate that high school students\nmust take a half-semester financial education course to graduate. They select an independent\nfinancial education provider with top credentials and proven experience in program\ndevelopment and deployment to lead the program in Center City schools.\nThis scenario meets program leadership standards.\n22\n\nLearner Outcomes Focused on Long-term Financial\nWellness and Early Indicators.\nMany states with personal finance instruction mandates do not require testing or evaluation, so\neducational success cannot be quantified. Outcome measures are essential for setting realistic\nexpectations, designing effective teaching materials and methodologies, and evaluating student learning.\nWell-constructed programs use evaluative measures that go beyond just assessing content knowledge.\nThe primary outcome of any financial education program is actual improvement to students’ finances\ncompared with contro", "created_at": "2026-01-03"}
{"id": "f8830270-cbf2-49f1-847b-9f055e003f8e", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 24, "text": "rograms use evaluative measures that go beyond just assessing content knowledge.\nThe primary outcome of any financial education program is actual improvement to students’ finances\ncompared with control groups that have not received any financial education. Examples of such\nimprovements might be increases in credit scores, higher savings rates, or creation of systems to manage\none’s finances.\nEarly research showed that financial education can have impact on long-term behavior. In 2013 a group\nof researchers published a report for the Federal Reserve Board analyzing more than 13 years of data\nfrom three US states (Georgia, Idaho, and Texas) that had newly mandated financial literacy courses for\nthe graduating class of 2007, with particular focus on the students’ credit behaviors after graduation.\nAccording to their analysis, students who completed the states’ financial education programs exhibited\nmore responsible borrowing and credit habits over time than young adults in neighboring states who did\nnot receive such financial education.(30)\nWhile long-term outcomes are the ultimate measure of program impact, near-term measures can be good\nindicators of students’ likelihood of greater financial wellness and ability to apply financial lessons to\nreal-world decisions in the future.\n23\n\nThese near-term measures may include the following:\n• Financial Knowledge. For programs to be truly\neffective, the educator and educational resources\nshould work toward activities that develop higher", "created_at": "2026-01-03"}
{"id": "f131c17a-54a9-4adf-aff1-e8531b632356", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 25, "text": "These near-term measures may include the following:\n• Financial Knowledge. For programs to be truly\neffective, the educator and educational resources\nshould work toward activities that develop higherorder thinking skills and require increased cognitive\nprocessing. Pre-, post-, and long-term testing provide\nways to measure content knowledge gains.\n• Financial Sentiment. Financial sentiment indicators\nmeasure students’ feelings/attitudes toward money\nand level of confidence when making financial\ndecisions. These data can guide overall program\ndesign, educational methodologies, and financial\neducation resources chosen.\n• Financial Behaviors. A top goal of financial education\nshould be to encourage the adoption of positive\nfinancial behaviors that help lead students toward\nthe results they desire. Behavioral measures can be\nquantified through Stages of Change Model (31)\nsurveys and observation.\n• Financial Systems. Lesson plans should include\nactivities that encourage students to establish\nfinancial systems. These systems should range from\ntheir accounts, to how their finances are managed, to\ncalendar reminders of future activities. The systems\ncan be measured to demonstrate participant action.\n• Financial Team. For high school students, their initial\nteam may be a person at the bank whom they trust\nto help them with their accounts. A young person’s\nfinancial team might also include mentors and\npersonal finance educators from whom they learn.\n• Financial Plan. Students should gr", "created_at": "2026-01-03"}
{"id": "933741cd-524d-404e-82eb-7af0049e5eac", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 26, "text": "k whom they trust\nto help them with their accounts. A young person’s\nfinancial team might also include mentors and\npersonal finance educators from whom they learn.\n• Financial Plan. Students should graduate from high\nschool with a financial plan in place. Creating a\nfinancial plan – even one that will change many\ntimes as they mature – is a critical skill set and\ntool for achieving financial stability and security in\nthe present as well as in the future. Planning helps\nstudents work toward goals and consider actions to\nkeep them on track toward their agendas.\n24\n\nFurther, it’s notable that the current financial literacy rating systems focus solely on the amount of time\nspent teaching financial literacy in schools in a given state. For any other subject, the determination of an\ninstructional program’s success would not be measured only by the amount of time students were required\nto spend studying the topic. Rather, success would be measured by students’ test scores and completion\nof projects and activities designed to prove proficiency in the subject matter. Financial literacy instruction\nalso should be based on student learning outcomes, not just time spent in the classroom.\nScenarios\nWalden County School District requires personal finance to be taught in grades 6-12. The\ndistrict leaves it up to the individual schools and teachers to determine how the students’\npersonal finance knowledge will be measured.\nThis district does not meet testing standards.\nCrook County School Di", "created_at": "2026-01-03"}
{"id": "d37367e8-bd45-4c69-be6e-0652b948f529", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 27, "text": "ct leaves it up to the individual schools and teachers to determine how the students’\npersonal finance knowledge will be measured.\nThis district does not meet testing standards.\nCrook County School District requires personal finance to be taught in grades 6-12. Students\nare administered pre-tests at the beginning of each semester and post-tests at the end of\neach semester, surveys that gauge sentiment, behaviors, and systems. The assessments are\ncarefully designed to measure student improvement in knowledge and application of the\nspecific topics taught at each grade level.\nThis district aligns with testing standards.\n25\n\nProgram\nSupport\nEncourage parental Start financial\nFund financial\ninvolvement and education courses\nliteracy programs.\nprovide parents with in elementary\naccess to resources. school.\n\nFund Financial Literacy Programs.\nMany states with financial literacy requirements are unfunded mandates. Legislation requires schools\nto teach personal finance, but no funding for the programming is provided in the bill. For example,\nGeorgia, Florida, and Michigan provide no funding for mandated financial literacy coursework. According\nto the National Endowment for Financial Education (NEFE), “no additional funding is being provided\nfor implementing the mandates. This lack of state funding puts a burden on local school districts.\nThey will need to pay for implementation costs or partner with private organizations to manage these\nexpenses.”(32)\nLack of funding for financial educ", "created_at": "2026-01-03"}
{"id": "2dfd472e-6f5f-4faa-92ff-d259239a450f", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 28, "text": "funding puts a burden on local school districts.\nThey will need to pay for implementation costs or partner with private organizations to manage these\nexpenses.”(32)\nLack of funding for financial education can lead to low-value programming that does little to benefit\nstudents and can turn them off learning about the topic later. A recent report from the Economic Policy\nInstitute underscores how our current system for funding public education – which relies primarily on\nstate and local resources – shortchanges students, especially low-income students.(33) These funding\ninadequacies tend to be magnified during and after recessions, with repercussions that are costly for\nstudents and for the entire country. This problem will be particularly evident in the area of personal\nfinance education, as students are likely to be deprived of essential knowledge at the exact time when\nthey need it most.\nFunding for financial education should include at minimum funds for professional development for\ncurrent and potential teachers, resource information for both standalone and integrated presentation,\nrigorous and tested curriculum materials, and other resources needed to teach the course.\nScenarios\nState H mandates one semester of personal finance education as a requirement to graduate\nfrom high school. The legislative mandate does not set aside any funds for program\nimplementation.\nState H does not meet the standards for funding financial education.\nState G mandates one semester of personal", "created_at": "2026-01-03"}
{"id": "f05b146c-ac7b-4e12-b501-7f10fbecc8bc", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 29, "text": "school. The legislative mandate does not set aside any funds for program\nimplementation.\nState H does not meet the standards for funding financial education.\nState G mandates one semester of personal finance education as a requirement to\ngraduate from high school. The legislative mandate sets aside specific funds from the State\nDepartment of Education to support teacher training, purchase of curriculum, and resources\nfor integrating programming into various other subjects.\nState G meets standards for funding financial education.\n27\n\nEncourage Parental Involvement and Provide\nParents with Access to Resources.\nParents’ influence on their children’s financial knowledge, attitudes, and habits has been well-documented\nacross decades. When parents engage in financial discussions with children – especially when they start\nat a young age – it improves the children’s outlook on future financial situations. In a 2020 study, young\nadults who had discussions with their parents during childhood about spending behavior, financial\ninvestments, and the importance of savings were more likely to have positive attitudes toward saving\nand tracking expenses, which in turn had a positive effect on their financial well-being.(34) Developing a\npositive attitude toward money strongly predicts future financial health.\nIn a 2021 literature review, LeBaron and Kelley summarize substantial evidence supporting the strength\nof parental influence on financial socialization. Financial socialization is define", "created_at": "2026-01-03"}
{"id": "33773a7f-bbb1-4683-9677-b0dce6401a15", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 30, "text": "ncial health.\nIn a 2021 literature review, LeBaron and Kelley summarize substantial evidence supporting the strength\nof parental influence on financial socialization. Financial socialization is defined as “the process of\nacquiring and developing values, attitudes, standards, norms, knowledge, and behaviors that contribute to\n. . . financial viability and individual wellbeing.”(35) The evidence cited in their review points to parental\ndiscussions about money, positive behavior modeling, and experiential learning as particularly effective\nfor improving financial socialization among emerging young adults.\nStandards for financial education should call for programs and interventions that encourage parents\nto initiate dialogues with their teens about money, including the importance of savings, family income,\nspending behavior, and financial products.\nMaterials should be provided to parents to involve them as active participants in tandem with the\nfinancial education youth receive at school. All curriculum and lesson plans used should be made\navailable for parental review and parents should be given access to become actively involved in their\nteens’ financial education.\nScenarios\nMr. Cooper teaches one semester of personal finance education at Danby High School. In\naddition to the personal finance lessons, he uses a set of handouts as homework assignments\nhe sends home with students to complete with a parent. He also invites his students’ parents to\nreview all the financial educatio", "created_at": "2026-01-03"}
{"id": "61b8fcae-33e2-4663-b730-68617818ab32", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 31, "text": "nal finance lessons, he uses a set of handouts as homework assignments\nhe sends home with students to complete with a parent. He also invites his students’ parents to\nreview all the financial education materials and information he uses in the classroom.\nThis scenario meets parental involvement standards.\nMr. Lennox teaches one semester of personal finance education at Winston High School. He\nuses a curriculum package that does not include any materials or presentations for parents,\nand makes no effort to reach out to parents about the instruction.\nThis scenario does not meet parental involvement standards.\n28\n\nStart Financial Education Courses\nin Elementary School.\nTo maximize the benefits high school students receive from gaining financial education that meets\nthe standards outlined above, outcomes will improve if we are able to begin shaping positive financial\nbehaviors during their developmental years. Children start learning about the financial world at a very\nearly age by observing the behaviors of their family and friends. But those influences aren’t always the\nmost effective models for teaching children responsible financial decision-making. Formal personal\nfinance education in elementary school can help students transition from basic to more advanced\nconcepts in high school, and thus prepare them better for the financial challenges and opportunities of\nadulthood.(13)\nFinancial habits form between ages 7 and 9,(36) that is, when children are in second to third grades.", "created_at": "2026-01-03"}
{"id": "fbc220a4-7001-4d75-ab7f-e0d81b70455d", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 32, "text": "ol, and thus prepare them better for the financial challenges and opportunities of\nadulthood.(13)\nFinancial habits form between ages 7 and 9,(36) that is, when children are in second to third grades.\nCurrently, most school financial education starts too late and too little time is\ndedicated to the subject. We recommend allowing for proper educational\nscaffolding by beginning financial education in elementary school and\nincreasing cognitive rigor across grade levels.\nStudent outcomes should align with their level of cognitive\ndevelopment and reading/math proficiency.\nInstruction should meet financial literacy\nstandards for kids that are appropriate for\ncognitive abilities at their age.\nPiaget’s Theory of Cognitive Development could\nusefully be applied as a model for separating\nmaterial based on cognitive abilities. This\ntheory specifies children’s understanding\nof key concepts according to the following\nstages: Pre-operational, ages 2-7; Concrete\nOperational, ages 7-11; and Formal Operational\nfor those older than 11. Above age 11, learning\nbarometers are separated based on students’\nmath abilities and understanding. Students learn\nskills that are essential to making fundamental\npersonal finance calculations, including negative\nnumbers, rates, decimals, and basic statistics\nneeded to solve personal finance problems.(37)\nAs posited by Piaget’s Theory of Cognitive\n29\n\nDevelopment, learning barometers can be set based on the child’s age and developmental stage. During\nthe elementa", "created_at": "2026-01-03"}
{"id": "a4a9bb50-d6fc-4266-b77a-f3783dad356a", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 33, "text": "to solve personal finance problems.(37)\nAs posited by Piaget’s Theory of Cognitive\n29\n\nDevelopment, learning barometers can be set based on the child’s age and developmental stage. During\nthe elementary years, financial education should help students gain a basic understanding of money and\nhelp them shape positive behaviors, habits, and financial sentiment. Training during these years should be\nfocused on developing knowledge and applying basic personal finance principles, molding behaviors, and\nhelping students develop positive relationships with money.\nLessons should be integrated on a regular and consistent basis across core topics. For elementary school,\nlessons could be easily integrated into other core subjects; but time should also be allocated to lessons\nand projects solely focused on personal finance.\nScenarios\nSecond-grade teacher Mrs. Young is charged with teaching personal finance in her class. She\ndecides to present a lesson on budgeting. The students seem confused and don’t understand\nthe basic concepts behind the material.\nThis scenario does not meet standards for alignment\nwith cognitive developmental stage.\nSecond-grade teacher Mrs. Harcourt is charged with teaching personal finance in her class.\nShe finds an accredited program that scaffolds lessons based on children’s cognitive stage.\nUsing this curriculum, she presents an activity where the students play a math game using\ndifferent denominations of money.\nThis scenario meets standards for alignment\nwith co", "created_at": "2026-01-03"}
{"id": "7e0bb2b4-350c-4a0a-b514-95761346555e", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 34, "text": "ldren’s cognitive stage.\nUsing this curriculum, she presents an activity where the students play a math game using\ndifferent denominations of money.\nThis scenario meets standards for alignment\nwith cognitive developmental stage.\n30\n\nReferences\n1. Council for Economic Education. 2022 Survey of the States: Economic and personal finance education\nin our nation’s schools. New York: Council for Economic Education; 2022.\n2. Grove A. High school course requirements for college admissions. ThoughtCo [Internet]. 2021\nFeb 27; Available from: https://www.thoughtco.com/high-school-course-requirements-collegeadmissions-788858\n3. National Association of College Admissions Counseling. High school classes required for college\n[Internet]. National Association for College Admissions Counseling; 2023. Available from: https://www.\nnacacfairs.org/learn/prep/high-school-classes-required-for-college-admission/\n4. Handel MJ. What do people do at work? A profile of U.S. jobs from the survey of workplace Skills,\nTechnology, and Management Practices (STAMP). Journal of Labour Market Research. 2016;49:117–97.\n5. Education Commission of the States. High School Graduation Requirements [Internet]. Denver, CO:\nEducation Commission of the States; 2019. Available from: https://reports.ecs.org/comparisons/highschool-graduation-requirements-01\n6. Cheeseman Day J, Martinez A. Does majoring in STEM lead to a STEM job after graduation? [Internet].\nWashington, DC: U.S. Census Bureau; 2021 Jun. Available from: https", "created_at": "2026-01-03"}
{"id": "240a9e46-5e14-418b-8c41-38346b2f18a4", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 35, "text": "ol-graduation-requirements-01\n6. Cheeseman Day J, Martinez A. Does majoring in STEM lead to a STEM job after graduation? [Internet].\nWashington, DC: U.S. Census Bureau; 2021 Jun. Available from: https://www.census.gov/library/\nstories/2021/06/does-majoring-in-stem-lead-to-stem-job-after-graduation.html\n7. U.S. Bureau of Labor Statistics. Job Outlook [Internet]. Washington, DC: US Bureau of Labor Statistics;\n2021. Available from: https://www.bls.gov/ooh/media-and-communication/writers-and-authors.\nhtm#tab-6\n8. U.S. Bureau of Labor Statistics. Occupational Outlook Handbook: Field of degree: English [Internet].\nWashington, DC: U.S. Bureau of Labor Statistics; 2019. Available from: https://www.bls.gov/ooh/fieldof-degree/english/english-field-of-degree.htm\n9. Nazareth S. Should foreign languages be mandatory? Claremont Courier [Internet]. 2019 Oct 23 [cited\n2022 Nov 2]; Available from: https://thewolfpacket.org/4894/opinions/should-foreign-languagesbe-mandatory/#:~:text=The%20mandatory%20classes%20are%20problematic%20for%20many%20\nreasons%2C,do%20a%20good%20job%20of%20teaching%20foreign%20languages.\n10. U.S. Bureau of Labor Statistics. Employment by major industry sector [Internet]. Washington, DC: U.S.\nBureau of Labor Statistics; 2021. Available from: https://www.bls.gov/emp/tables/employment-bymajor-industry-sector.htm\n11. American Public Education Foundation. The Nation’s Report Card on Financial Literacy [Internet].\nCollierville, TN: American Public Education Foundation; 2022.", "created_at": "2026-01-03"}
{"id": "4d464db3-c029-4322-8f08-6c4da253196f", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 36, "text": "mployment-bymajor-industry-sector.htm\n11. American Public Education Foundation. The Nation’s Report Card on Financial Literacy [Internet].\nCollierville, TN: American Public Education Foundation; 2022. Available from: https://www.\nthenationsreportcard.org/\n12. Champlain College C for FL. National High School Financial Literacy: Report Summary [Internet].\nBurlington, VT: Champlain College: The Center for Financial Literacy; 2017. Available from: https://\nwww.champlain.edu/centers-of-experience/center-for-financial-literacy/report-national-high-schoolfinancial-literacy/results-summary\n31\n\n13. Council for Economic Education. National Standards for Financial Literacy [Internet]. New York: Council\nfor Economic Education; 2013 [cited 2014 Sep 23]. Available from: http://www.councilforeconed.org/\nwp/wp-content/uploads/2013/02/national-standards-for-financial-literacy.pdf\n14. Amagir A, Groot W, van den Brink HM, Wilschut A. A review of financial-literacy education programs for\nchildren and adolescents. Citizenship, Social & Economics Education. 2018;17(1):56–80.\n15. Andruss P. New education trend: Students required to take personal finance classes. Is it working? USA\nToday Back to School [Internet]. 2022 Aug 18; Available from: https://www.usatoday.com/story/money/\npersonalfinance/2022/08/18/high-school-finance-classes-retirement-planning/10308783002/\n16. National Association of Secondary School Principals. Creating a culture of inquiry. Reston, VA: NASSP;\n2015.\n17. Forehand M. Bloom’", "created_at": "2026-01-03"}
{"id": "e8e58b14-8c68-4607-8b9f-b3c060b56490", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 37, "text": "/18/high-school-finance-classes-retirement-planning/10308783002/\n16. National Association of Secondary School Principals. Creating a culture of inquiry. Reston, VA: NASSP;\n2015.\n17. Forehand M. Bloom’s Taxonomy: Original and revised. In: Orey M, editor. Emerging perspectives on\nlearning, teaching, and technology. Athens, GA: The Global Text Project; 2010.\n18. Hess K. A guide for using Webb’s Depth of Knowledge with Common Core State Standards. Oakbrook\nTerrace, IL: The Common Core Institute; 2013.\n19. Organisation for Economic Co-operation and Development. Innovative learning environments. Paris,\nFrance: OECD; 2019.\n20. Cabrera B. High School Graduation Requirements in Personal Finance [Internet]. HB1115\nMar 8, 2022. Available from: https://flsenate.gov/Session/Bill/2022/1115/Analyses/h1115e.\nEEC.PDF#:~:text=The%20bill%20requires%20that%20beginning%20with%20students%20\nentering,complete%20to%20earn%20a%20standard%20high%20school%20diploma.\n21. Friedman Z. Student loan debt statistics in 2022: A record $1.7 trillion. Forbes [Internet]. 2022 May 16;\nAvailable from: https://www.forbes.com/sites/zackfriedman/2022/05/16/student-loan-debt-statisticsin-2022-a-record-17-trillion/?sh=3a96d65b4d5a\n22. Hahn A. 2023 student loan debt statistics: Average student loan debt. Forbes [Internet]. 2023 May 9;\nAvailable from: https://www.forbes.com/advisor/student-loans/average-student-loan-debt-statistics/\n23. EdReports.org. Why materials matter. National Research Council; 2006.\n24. National Fi", "created_at": "2026-01-03"}
{"id": "917b5900-b72e-4acf-be8b-e2e7c48a2ec5", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 38, "text": "2023 May 9;\nAvailable from: https://www.forbes.com/advisor/student-loans/average-student-loan-debt-statistics/\n23. EdReports.org. Why materials matter. National Research Council; 2006.\n24. National Financial Educators Council. Exploring how many states require financial education\n[Internet]. Las Vegas, NV: National Financial Educators Council; 2019. Available from: https://www.\nfinancialeducatorscouncil.org/how-many-states-require-financial-education/\n25. National Center on Universal Design for Learning. The UDL Guidelines [Internet]. Seattle, WA: National\nCenter on Universal Design for Learning; 2018. Available from: https://udlguidelines.cast.org/\n26. Boston Public Schools. Interactive Rubric for Effective Teaching [Internet]. Roxbury, MA: Boston\nPublic Schools; Available from: https://www.bostonpublicschools.org/Page/280#:~:text=Subject%20\nMatter%20Knowledge%20extends%20beyond,into%20content%20yields%20richer%20learning.\n27. Greenberg J, McKee A, Walsh K. Teacher prep review: Program performance in early reading instruction.\nWashington, DC: National Council on Teacher Quality; 2013 Jun.\n28. Terada Y. Understanding a teacher’s long-term impact. Edutopia [Internet]. 2019 Feb 4; Available from:\n32\n\nhttps://www.edutopia.org/article/understanding-teachers-long-term-impact#:~:text=Compared%20\nto%20any%20other%20aspect%20of%20schooling%2C%20teachers,can%20boost%20a%20\nclass%E2%80%99s%20lifetime%20income%20by%20%24250%2C000.\n29. Waters JT, Marzano RJ. School district leadership th", "created_at": "2026-01-03"}
{"id": "a671262f-9675-46ed-97b3-4cdcdbc4acb3", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 39, "text": "ompared%20\nto%20any%20other%20aspect%20of%20schooling%2C%20teachers,can%20boost%20a%20\nclass%E2%80%99s%20lifetime%20income%20by%20%24250%2C000.\n29. Waters JT, Marzano RJ. School district leadership that works: The effect of superintendent leadership\non student achievement [Internet]. Denver, CO: Mid-continent Research for Education and Learning;\n2006 Sep. Available from: https://files.eric.ed.gov/fulltext/ED494270.pdf\n30. Brown A, Collins JM, Schmeiser M, Urban C. State mandated financial education and the credit behavior\nof young adults. Washington, DC: Federal Reserve Board; 2014. (Finance and Economics Discussion\nSeries).\n31. Prochaska JO, Velicer WF. The Transtheoretical Model of Health Behavior Change. The Science of\nHealth Promotion. 1997;12(1):38–48.\n32. Donahue E. Not all mandates are created equal: A 2022 legislative recap [Internet]. National\nEndowment for Financial Education. 2022. Available from: https://www.nefe.org/news/2022/08/notall-mandates-are-created-equal.aspx\n33. Allegretto S, García E, Weiss E. Public education funding in the U.S. needs an overhaul [Internet].\nWashington, DC: Economic Policy Institute; 2022 Jul. Available from: https://www.epi.org/publication/\npublic-education-funding-in-the-us-needs-an-overhaul/#:~:text=Education%20funding%20\ngenerally%20is%20inadequate%20and%20inequitable%3B%20It,get%20less%20funding%20per%20\nstudent%20than%20low-poverty%20districts.\n34. Utkarsh, Pandey A, Ashta A, Spiegelman E, Sutan A. Catch them young: Impact of fin", "created_at": "2026-01-03"}
{"id": "e4ee31f2-2dce-49b4-9269-bdc64200affc", "doc_id": "aec81997-de70-46ef-b176-8d318dacedc9", "title": "Nfec-Report-Policy-And-Standards-Framework-For-High-School-Financial-Literacy-Education", "source_file": "pdfs\\nfec-report-policy-and-standards-framework-for-high-school-financial-literacy-education.pdf", "chunk_index": 40, "text": "%20inadequate%20and%20inequitable%3B%20It,get%20less%20funding%20per%20\nstudent%20than%20low-poverty%20districts.\n34. Utkarsh, Pandey A, Ashta A, Spiegelman E, Sutan A. Catch them young: Impact of financial socialization,\nfinancial literacy and attitude towards money on financial well-being of young adults. International\nJournal of Consumer Studies. 2020;44:531–41.\n35. LeBaron AB, Kelley HH. Financial socialization: A decade in review. Journal of Family and Economic\nIssues. 2021;42((Suppl 1)):S195–206.\n36. Phelan R. 4 ways to teach kids about money before their habits are set at age 9. Business Insider\n[Internet]. 2021 Oct 25; Available from: https://www.businessinsider.com/personal-finance/why-weneed-to-teach-kids-about-money-2021-10\n37. National Financial Educators Council. Kids Financial Literacy Standards (PK – 8th Grade). Las Vegas,\nNV: National Financial Educators Council; 2018.\n33", "created_at": "2026-01-03"}
