{"id": "c6870697-558f-4d07-8808-ff4a4c3dbca6", "doc_id": "3357050b-40ec-4ea9-a966-30dc3f4b237d", "title": "What No One Tells You About Budgeting In Your 20S — Lalua Rahsiad", "source_file": "pdfs\\What No One Tells You About Budgeting in Your 20s — Lalua Rahsiad.pdf", "chunk_index": 0, "text": "Start Here Podcast Money Queen Calendar Shop Login\nWhat No One Tells You About Budgeting In Your 20s\nWritten By Lalua Rahsiad\nBudgeting, a common topic that many financial advisors usually use as a first step of managing your money—has an image problem.\nIt sounds boring. Restrictive. Like something you only do when you’re broke or when you’re forced to ‘cut back’. And if you’re in your 20s, the\nidea of budgeting can feel like a punishment for not being rich yet.\nLike, “Why should I budget when I barely earn enough to enjoy life?”\nA Better Metaphor: The Map for Your Personal GPS\nThink of your income like a car, and your dreams—freedom, stability, a house, travel—as your destination.\nNow ask yourself: Would you get in the car and drive aimlessly without a GPS?\nThat’s exactly what spending without a budget looks like\nYou’re moving, but you’re not really going anywhere.\nIf you think a budget is unnecessary for your life, try to consider it as your roadmap. It’s not there to restrict you—it’s there to guide you. So\nyou don’t end up lost, broke, or worse, stuck in the same place five years from now.\nReal Talk: Why Most People Give Up on Budgeting\nBecause they tried to follow someone else’s version of it.\n• A spreadsheet that’s too complicated.\n• A method that’s too strict.\n• A financial influencer who’s already making 6-figures and telling you to save 70% of your salary.\nIt becomes discouraging. So you quit.\nBut budgeting should feel like your life—not someone else’s\n“Don’t tell me", "created_at": "2026-01-03"}
{"id": "47d2d2f3-3967-4b41-bbae-9294ee8d6766", "doc_id": "3357050b-40ec-4ea9-a966-30dc3f4b237d", "title": "What No One Tells You About Budgeting In Your 20S — Lalua Rahsiad", "source_file": "pdfs\\What No One Tells You About Budgeting in Your 20s — Lalua Rahsiad.pdf", "chunk_index": 1, "text": "l influencer who’s already making 6-figures and telling you to save 70% of your salary.\nIt becomes discouraging. So you quit.\nBut budgeting should feel like your life—not someone else’s\n“Don’t tell me what you value. Show me your budget, and I’ll tell you what you value.” – Joe Biden\nObserves this quote from the famous known - Joe Biden. This implies that your budget is a mirror, always meant to reflect what truly\nmatters to you—not what you say you care about, but what you actually prioritise with your money.\nWhat Actually Works? Try These 3 Budgeting Styles:\nHere are 3 flexible methods that actually work, especially if you’re in your 20s and not a fan of rigid systems:\n1.The 50/30/20 Rule (Simple & Flexible)\n• 50% needs (rent, bills, groceries)\n• 30% want (fun, entertainment, shopping)\n• 20% savings/debt payoff\nThis is great for people who want a guideline without micromanaging every cent. You can adjust the percentages slightly if your situation is\ndifferent (like if you live with your parents or have student debt).\n2. Zero-Based Budgeting (Every Dollar Has a Job)\nPerfect if you’re the type who wants full control.\nYou start with your monthly income and assign every single dollar to a category—until you reach zero. That doesn’t mean you have no\nmoney left; it means everything is accounted for. You know where it goes.\n3. The Envelope/Category System (Digital or Physical)\nThis one’s old school but gold. You divide your money into “envelopes” based on categories—like $100 for", "created_at": "2026-01-03"}
{"id": "45f15062-9e15-413f-9801-4dbe15b6fb4c", "doc_id": "3357050b-40ec-4ea9-a966-30dc3f4b237d", "title": "What No One Tells You About Budgeting In Your 20S — Lalua Rahsiad", "source_file": "pdfs\\What No One Tells You About Budgeting in Your 20s — Lalua Rahsiad.pdf", "chunk_index": 2, "text": "s accounted for. You know where it goes.\n3. The Envelope/Category System (Digital or Physical)\nThis one’s old school but gold. You divide your money into “envelopes” based on categories—like $100 for groceries, $60 for transport, $75\nfor fun. Once that envelope runs out, you stop spending in that category\nNow it’s often used digitally with budgeting apps like Spendee, Goodbudget, or You Need A Budget (YNAB). It’s simple, visual, and really\neffective if you tend to overspend without realising it.\nOne of my readers once said,\n“I thought budgeting was for people who already had money. But when I started budgeting with a starter amount of my comfort, I realised I\ncould still build a safety net and stop feeling anxious about money.”\nThat’s the power of budgeting! You no longer have to guess.\nYou’re always in control—even if it’s not perfect.\nBudgeting is the quiet superpower of people who want more out of life, such things as money-wise and freedom.\nIf budgeting has ever made you feel trapped, restricted, or overwhelmed—it wasn’t your budget. It was someone else’s.\nFind the method that works for your lifestyle. Make room for your goals, your fun, your growth. Don’t cut joy!", "created_at": "2026-01-03"}
