{"id": "c5dac5c6-c53e-4271-bb73-d9335ddc1595", "doc_id": "10352787-53ec-4c35-94a3-f669e364fc57", "title": "Why Financial Freedom Starts With Your Mindset — Lalua Rahsiad", "source_file": "pdfs\\Why Financial Freedom Starts with Your Mindset — Lalua Rahsiad.pdf", "chunk_index": 0, "text": "Start Here Podcast Money Queen Calendar Shop Login\nWhy Financial Freedom Starts With Your Mindset\nWritten By Lalua Rahsiad\n“Once I earn more, I'll start saving”\n“When I hit $2,000 a month, I'll be financially stable.”\nMeet the young adults these days—who operate in what we call a survival mindset. They work to pay the bills. A reward with a little splurge\nafter a stressful week. Here comes the worst part—They don't track their spending because “It's not that bad.” These people rely on their\ncredit, or BNPL, when their salaries are late.\nThese habits are going to cost them before the end of month arrives, they'll be complaining about how small their incomes are when the\nworld's living costs are rising. The reality is, more income doesn't equal more control.\nIn fact, most people raise their expenses as soon as their paycheck increases. Once they get their hands on their extra income—their whole\nlifestyle upgrades too! New clothes, better phone and more nights out\n“Too many people spend money they haven't earned, to buy things they don't need, to impress people they don't like.”\nObserve the quote above, again, and again. Until you realize what the writer, Will Rogers, had in his mind. Because, after you've finally\nabsorbed it, then you can finally move below.\n***\nFreedom requires a willingness to prioritize long-term goals over short-term desires, which means getting delayed gratification, and\nproper mindset is the best friend of long-term dedication.\nWhat is a mindset, really?", "created_at": "2026-01-03"}
{"id": "3ddc46d4-e68a-44e0-ab65-974676ecea50", "doc_id": "10352787-53ec-4c35-94a3-f669e364fc57", "title": "Why Financial Freedom Starts With Your Mindset — Lalua Rahsiad", "source_file": "pdfs\\Why Financial Freedom Starts with Your Mindset — Lalua Rahsiad.pdf", "chunk_index": 1, "text": "willingness to prioritize long-term goals over short-term desires, which means getting delayed gratification, and\nproper mindset is the best friend of long-term dedication.\nWhat is a mindset, really?\nThink of it as the operating system of your life—the invisible code that runs your choices. Or better yet, picture it as a garden. Your thoughts\nare the seeds, your beliefs are the roots, and your actions? They're the fruits. So imagine if your thoughts are filled with “I'm not good with\nmoney.” or “It's impossible for me to be successful.” Then, they will grow to be your unhealthy roots that result with rotten fruits. You can\nchoose to get the highest income, pay for a lot of budgeting apps—but nothing will change if you don't fix your roots.\nYou don't have to deprive yourself. You just need to be intentional.\nHere's how to start shifting your mindset. Fix your thoughts first.\nI've mentioned previously about the mindset of “I'm not good with money.” No one is born perfect. We all take our own time and way to\nlearn from how to crawl around to running a field track.\nTake Bola Sokunbi as an example. Before she built her six-figure net worth, she was just like many of us—working at a stable job. But her\ndays are filled with dread and anxiety as she was finding ways on how to stretch her paycheck ‘till the end of month. She was living\npaycheck to paycheck.\nIn one of her interviews, she explained that the lack of financial knowledge diminished her self-confidence in managing her money", "created_at": "2026-01-03"}
{"id": "f2ee08f5-38ca-4eea-89d8-bba8b8d0e169", "doc_id": "10352787-53ec-4c35-94a3-f669e364fc57", "title": "Why Financial Freedom Starts With Your Mindset — Lalua Rahsiad", "source_file": "pdfs\\Why Financial Freedom Starts with Your Mindset — Lalua Rahsiad.pdf", "chunk_index": 2, "text": "paycheck ‘till the end of month. She was living\npaycheck to paycheck.\nIn one of her interviews, she explained that the lack of financial knowledge diminished her self-confidence in managing her money. She\nthought ‘Oh I'm like this because I don't have the education. People don't expect me to have good finances because I don't have what it\ntakes to be one.’ Fortunately, she nurtured her mindset—fed with patience, discipline and the belief that change is possible. And that's when\nshe started the action of managing her finances.\nEducation has nothing to do with it! It's the passion to learn and the efforts to be better, that matter the most. Learn to have faith—it’s a\npowerful thing to be possessed—in yourself, in the process, and in which you can't yet see.\nFaith is choosing to plant seeds today without seeing the harvest tomorrow. It's like saving $20 per week even when your bank balance still\nlooks empty. It's believing that small steps can still lead to big changes.\nSo ask yourself, what kind of garden are you growing in your mind? Are you planting seeds that help you build, or are you watering doubts\nthat keep you stuck? Remember, success naturally flows to those who train their minds to expect it, but failure traps those who passively\naccept it as their reality.\nHow to fix your mindset?\nFirst, start seeing saving as self-care. Instead of viewing saving as something boring or restrictive, see it as an act of self-love. Future you\nwill thank you.\nSecond, always ask ‘why’ be", "created_at": "2026-01-03"}
{"id": "ac092cff-f00f-42fc-b80a-688bfd9e06e5", "doc_id": "10352787-53ec-4c35-94a3-f669e364fc57", "title": "Why Financial Freedom Starts With Your Mindset — Lalua Rahsiad", "source_file": "pdfs\\Why Financial Freedom Starts with Your Mindset — Lalua Rahsiad.pdf", "chunk_index": 3, "text": "ur mindset?\nFirst, start seeing saving as self-care. Instead of viewing saving as something boring or restrictive, see it as an act of self-love. Future you\nwill thank you.\nSecond, always ask ‘why’ before you splurge on shopping. I know those check-out buttons are tempting as they are, and the discounted\npercentage always seems an unbelievably good bargain. But do you really need those, or are you just trying to feel better?\nThirdly, define your own version of success. Don't be ashamed to dream big, start fantasising about the future you. Are you free of debts?\nOr travelling without guilt? Your ‘why’ is personal—own it.\nThe journey of financial freedom is never easy but it's doable if you start from within. So water the garden of your mind, pull out the weeds\nof doubt, and begin planting the beliefs and knowledge that you need. And one day, you will look back and realize—it wasn't the paycheck\nthat set you free, it was you!", "created_at": "2026-01-03"}
