{"id": "d5e03240-ea7b-4576-accd-7e8d9c1d1d19", "doc_id": "a8fe1330-9788-47a8-8db0-8b89d5187a85", "title": "Www-Kwsp-Gov-My-W-Article-Retirement-Planning-Tips", "source_file": "pdfs\\www-kwsp-gov-my-w-article-retirement-planning-tips.pdf", "chunk_index": 0, "text": "Member Employer Corporate EN\nMyra Athena & Sharifah Norashikin Date: 19 Jul 2024\nShare    \n4 Things To Avoid When Planning\nYour Retirement\nRelated Reads\nPERSONAL\nFINANCE\nS.M.A.R.T Budgeting\nTechnique\nPERSONAL\nFINANCE\nBNPL: Every\nShopaholic's Dream…\nTable of Contents\nRetirement — a word that stirs dreams, new opportunities, and perhaps a\ntouch of anxiety for many. In Malaysia, as in other parts of the world, the\nconcept of retirement is evolving alongside longer life expectancies,\nshifting economic landscapes, and changing lifestyles.\nReaching retirement with enough savings does not happen by chance.\nFor most of us, it requires decades of saving, budgeting and working hard\nto increase our income to be able to put away money for retirement.\nDespite its significance, many individuals inadvertently make mistakes\nthat can impact their financial security in later years. But with the right\nplanning, you can improve your chances of avoiding the pitfalls. Let's\ndelve into four common pitfalls in retirement planning:\nProcrastinating the start of savings\nDelaying retirement planning is a common habit as it seems far away.\nHowever, time passes quicker than we think. Starting your savings journey\nearly allows you to harness the power of compounding interest. With\ncompounding, every ringgit you save today has the potential to grow.\n\nThe longer your savings accumulate, the more your retirement funds will\ngrow.\nMember Employer Corporate\nTip: Start saving as soon as you begin to earn a st", "created_at": "2026-01-03"}
{"id": "a1aada37-2b68-4264-b46d-1a127e31974f", "doc_id": "a8fe1330-9788-47a8-8db0-8b89d5187a85", "title": "Www-Kwsp-Gov-My-W-Article-Retirement-Planning-Tips", "source_file": "pdfs\\www-kwsp-gov-my-w-article-retirement-planning-tips.pdf", "chunk_index": 1, "text": "t you save today has the potential to grow.\n\nThe longer your savings accumulate, the more your retirement funds will\ngrow.\nMember Employer Corporate\nTip: Start saving as soon as you begin to earn a steady income or\nhave a stable job. Of course, the amount you save depends on the\nsize of your income.\nA helpful guideline is the 45/35/20 Rule of Thumb for budgeting,\nwhich suggests allocating 45% of your income to necessities, 35%\nto commitments, and 20% to savings.\nUnderestimating living expenses during\nretirement\nAnother common mistake is underestimating how much you will need to\nlive comfortably during retirement. Overlooking expenses such as\nhealthcare, travel, and leisure activities can lead to financial strain. It is\ncrucial to factor in inflation and potential healthcare costs when\ncalculating your retirement needs.\nTip: Create a detailed budget that includes all anticipated\nexpenses and regularly review and adjust it as needed.\nAlternatively, use tools like our Retirement Calculator to project\napproximate savings upon retirement, offering a clearer picture for\nyour financial planning journey. You can also utilise the\nBelanjawanku app to plan your budget and assess the actual\nexpenses needed for retirement later on.\nPutting your eggs in one basket\nIt is a common mistake to rely solely on your EPF for retirement funds.\nWhile EPF typically grows at around 5% per annum, it is essential not to\ndepend entirely on it. There are several other avenues worth exploring\nthat may matc", "created_at": "2026-01-03"}
{"id": "7bc3f84f-0aad-4c5e-b67b-17bf918e25c8", "doc_id": "a8fe1330-9788-47a8-8db0-8b89d5187a85", "title": "Www-Kwsp-Gov-My-W-Article-Retirement-Planning-Tips", "source_file": "pdfs\\www-kwsp-gov-my-w-article-retirement-planning-tips.pdf", "chunk_index": 2, "text": "y solely on your EPF for retirement funds.\nWhile EPF typically grows at around 5% per annum, it is essential not to\ndepend entirely on it. There are several other avenues worth exploring\nthat may match your investing objectives, time horizon and risk\ntolerance, and offer similar or even better returns.\nTip: Your savings and investment approach should not remain static\nas you progress from your 20s to your 40s and as your risk tolerance\nand financial commitments change over time.\nConsulting a financial advisor to craft a diversified investment\nstrategy that aligns with your risk tolerance and retirement goals is\nadvisable. EPF's Relationship Advisory (RA) services may offer\ninvaluable support in this area.\nNot having a contingency plan\nLife can be full of surprises; you might have your whole life planned out,\nbut odds are you’ll come face-to-face with unexpected situations that\nalter your goals. While planning for the golden years, it is crucial to\nincorporate a robust contingency plan to manage unforeseen events like\nmedical emergencies, home repairs, or economic downturns. Failing to\nplan ahead could result in tapping into your retirement funds to cover\nunexpected costs.\n\nTip: Build an emergency fund that is separate from your retirement\nsavings to cover unexpected expenses. By setting aside a portion of\nyour income regularly, you can bMueildm ab esrafety neEtm tphlaoty eprrotectsC yooruprorate\nretirement savings from unplanned uses. Additionally, consider\nexploring insuranc", "created_at": "2026-01-03"}
{"id": "9f811a00-ea0c-4b08-bccd-d6211877d787", "doc_id": "a8fe1330-9788-47a8-8db0-8b89d5187a85", "title": "Www-Kwsp-Gov-My-W-Article-Retirement-Planning-Tips", "source_file": "pdfs\\www-kwsp-gov-my-w-article-retirement-planning-tips.pdf", "chunk_index": 3, "text": "setting aside a portion of\nyour income regularly, you can bMueildm ab esrafety neEtm tphlaoty eprrotectsC yooruprorate\nretirement savings from unplanned uses. Additionally, consider\nexploring insurance options to further safeguard against major risks\nlike health or property damage.\nRetirement planning is not just about setting aside money; it is about\nmaking informed decisions and preparing for the future. By avoiding\nthese common mistakes, you can navigate your retirement journey with\nconfidence and ensure a financially secure and fulfilling retirement.\nRemember, each decision you make today shapes your tomorrow. Take\nproactive steps now to build a robust retirement plan that aligns with\nyour aspirations and safeguards your financial wellbeing in the years to\ncome.\nMember Employer Corporate Others\nRegister As A Member Introduction About Us Terms & Conditions\nGrow Your Savings Responsibilities Organisational Structure Privacy Policy\nManage Your EPF Account Online Platform Corporate Governance Security Policy\nHome Ownership Employers Education Investment Disclaimer\nProgramme\nFinancial Life Stages Sustainability Online Security Tips\nHealth Protection Business Partners Other Links\nKWSP i-Akaun App News & Highlights Forms\nCareers Resource Centre\nProcurement Achievements\nWhistleblowing & Anti‑Fraud\nContact Us", "created_at": "2026-01-03"}
