{"id": "76988984-20e9-4380-b9e7-fd556c1b986c", "doc_id": "e447515d-0aad-41e7-9f42-b3d1ed8f51b2", "title": "Www-Kwsp-Gov-My-W-Article-Savings-And-Inflation", "source_file": "pdfs\\www-kwsp-gov-my-w-article-savings-and-inflation.pdf", "chunk_index": 0, "text": "Member Employer Corporate EN\nMyra Athena & Sharifah Norashikin Date: 12 Jul 2024\nShare    \nUnderstand The Impact Of Inflation\nOn Your Savings\nRelated Reads\nPERSONAL\nFINANCE\nEmergency Fund: Why\nYou Need One\nPERSONAL\nFINANCE\nFinancial Milestones to\nAchieve Before Turnin…\nPERSONAL\nFINANCE\nWhy A Bigger Income\nDoesn’t Mean Bigger…\nCAREER\nCreating a Supportive\nWorkplace for Workin…\nInflation is something we all experience, even if we don't always notice it.\nEssentially, it's the increase in the prices of goods and services over time. Table of Contents\nWhen inflation happens, each unit of currency buys fewer goods and\nservices, which means the purchasing power of money decreases.\nThink about it this way: remember when RM10 could buy you a lot more\nthan it does today?\nFor example, in the early 2000s, RM10 could buy several bunches of\nvegetables such as spinach, long beans, and aubergines, along with fresh\nfish from the public market. However, nowadays, the same amount might\nonly cover the cost of two types of vegetables. This illustrates the\ndecrease in the value of RM10 over the past few decades.\nThis decline in purchasing power affects all of us, making it an important\ntopic to understand in our daily lives.\nThere are many factors driving inflation, including increased demand for\ngoods and services and supply chain disruptions. Additionally,\ngovernment policies and exchange rates may also play a role in causing\ninflation.\n\nWith inflation, people are increasingly encountering ch", "created_at": "2026-01-03"}
{"id": "440d0a87-7fee-4bdd-9ae8-86382cd9a645", "doc_id": "e447515d-0aad-41e7-9f42-b3d1ed8f51b2", "title": "Www-Kwsp-Gov-My-W-Article-Savings-And-Inflation", "source_file": "pdfs\\www-kwsp-gov-my-w-article-savings-and-inflation.pdf", "chunk_index": 1, "text": "oods and services and supply chain disruptions. Additionally,\ngovernment policies and exchange rates may also play a role in causing\ninflation.\n\nWith inflation, people are increasingly encountering challenges in\nmanaging their lives. Skyrocketing rental costs, rising food prices, and the\nburden of loan debts make it even more difficult for them to make ends\nMember Employer Corporate\nmeet, pushing them further into financial struggle.\nHow does inflation affect your savings?\nInflation affects your savings through your purchasing power. The money\nyou set aside for goals like retirement and major purchases such as\nbuying a house, a car, and your children’s education may not be sufficient\nin the future as the value of your money will decrease over time.\nLet's use the price of nasi lemak in Malaysia to understand the concept of\ninflation:\nIn 1970, you could buy a plate of delicious nasi lemak, complete with\nfragrant coconut rice, spicy sambal, an egg fresh cucumber slices and\ncrunchy peanuts, all for just 50 cents.\n1980: the price increased to RM1 for the same plate of nasi lemak.\n1990: the price rose further to RM2 for the same meal.\n2024: you find yourself paying RM3 for that same plate of nasi\nlemak, with some boujee restaurants charging over RM10 for the\ndelicacy.\nThe price of nasi lemak continues to rise over the years, reflecting the\nimpact of inflation. What used to be affordable and accessible for many\nin the past may now require more money to enjoy. This demonstrates\nhow i", "created_at": "2026-01-03"}
{"id": "30f0df31-cfe9-45bd-b811-03c59cb69638", "doc_id": "e447515d-0aad-41e7-9f42-b3d1ed8f51b2", "title": "Www-Kwsp-Gov-My-W-Article-Savings-And-Inflation", "source_file": "pdfs\\www-kwsp-gov-my-w-article-savings-and-inflation.pdf", "chunk_index": 2, "text": "lemak continues to rise over the years, reflecting the\nimpact of inflation. What used to be affordable and accessible for many\nin the past may now require more money to enjoy. This demonstrates\nhow inflation affects our purchasing power, making goods more\nexpensive over time.\nWhat can you do about it?\nManaging finances in today's economy can be challenging, especially\nwhen monthly income barely meets basic needs. This financial pressure\noften impedes saving and slows overall financial progress. Here are\nactionable steps to overcome these challenges:\n1) Reassess your spending habits\nWith prices skyrocketing these days, it’s more important than ever to\nkeep a close eye on your spending and stick to a monthly budget. Start\nby tracking your expenses to see where your money is going. Then,\nidentify areas where you can cut back, especially on non-essentials like\ndining out, entertainment, and impulse buys.\nTo help you plan and monitor your expenses more effectively, we\nrecommend using the Belanjawanku app. This app makes it easier for\nyou to track your monthly and yearly expenses more efficiently and\nprovides useful guidance for financial management. Dowload the app on\nApple App Store, Google Play Store or Huawei App Gallery.\n2) Establish an emergency fund\nWhen planning for emergency savings, it's wise to have enough to cover\nthree to six months of expenses. This can prevent you from having to tap\ninto retirement savings or other investments during emergencies.\nAdditionally, by pl", "created_at": "2026-01-03"}
{"id": "5241e9c4-dbc3-4d16-a174-cce4e9f3f6be", "doc_id": "e447515d-0aad-41e7-9f42-b3d1ed8f51b2", "title": "Www-Kwsp-Gov-My-W-Article-Savings-And-Inflation", "source_file": "pdfs\\www-kwsp-gov-my-w-article-savings-and-inflation.pdf", "chunk_index": 3, "text": "savings, it's wise to have enough to cover\nthree to six months of expenses. This can prevent you from having to tap\ninto retirement savings or other investments during emergencies.\nAdditionally, by placing your emergency fund in a savings account that\noffers high returns, you can maximise the interest or dividends earned\nand reduce the negative impact of inflation on the value of your money.\n3) Grow your savings\n\nIncrease your savings rate to build a cushion against rising costs.\nAdditionally, you can diversify your savings into assets that perform well,\nsuch as those that provide returns exceeding the inflation rate. This helps\nMember Employer Corporate\npreserve the purchasing power of your savings over time, ensuring that\nyour money continues to work effectively for you.\nRead also: Boost Your Savings with EPF Account\n4) Revisit your retirement plans\nWhile your everyday savings might be your current focus, don't overlook\nyour retirement savings. If you still have a few years before retirement, it's\ncrucial to reassess your plans to ensure they account for the long-term\neffects of inflation.\nTools like the retirement calculator in the KWSP i-Akaun app can help\nproject your future needs and savings, while also accounting for inflation.\nThis calculator provides projections of your savings, potential retirement\nexpenses, and the remaining balance at the end of each year.\nIf your monthly EPF mandatory deductions are not enough to meet your\ntargeted retirement savings goal, you ca", "created_at": "2026-01-03"}
{"id": "d606ca50-1f68-425f-8a47-3c021108c6eb", "doc_id": "e447515d-0aad-41e7-9f42-b3d1ed8f51b2", "title": "Www-Kwsp-Gov-My-W-Article-Savings-And-Inflation", "source_file": "pdfs\\www-kwsp-gov-my-w-article-savings-and-inflation.pdf", "chunk_index": 4, "text": "savings, potential retirement\nexpenses, and the remaining balance at the end of each year.\nIf your monthly EPF mandatory deductions are not enough to meet your\ntargeted retirement savings goal, you can choose to make voluntary topups from as little as RM10, up to a maximum of RM100,000 per year\nthrough voluntary contributions.\nExplore more details on Voluntary Contribution\nIf you want to automate additional voluntary savings, there is also the\noption of Voluntary Excess, where a higher percentage of your income will\nbe automatically saved into your EPF account.\nClick here for more details on Voluntary Excess\nAlthough it’s hard to know exactly how long periods of high inflation will\nlast, building knowledge and having a plan in place can help you feel\nmore comfortable about its impact on your finances and lifestyle.\nProactively adjusting your budget, investments, and spending habits can\nmake a substantial difference. Furthermore, consulting with a financial\nadvisor can provide valuable insights, helping you to develop a\ncomprehensive strategy aligned with your financial priorities. By taking\nthese steps, you can navigate the challenges of inflation with greater\nconfidence and security, ensuring you're on the right path toward your\nfinancial goals.\nMember Employer Corporate Others\nRegister As A Member Introduction About Us Terms & Conditions\nGrow Your Savings Responsibilities Organisational Structure Privacy Policy\nManage Your EPF Account Online Platform Corporate Governance Se", "created_at": "2026-01-03"}
{"id": "e4f64f81-1de9-43ea-9557-6631d4ff162b", "doc_id": "e447515d-0aad-41e7-9f42-b3d1ed8f51b2", "title": "Www-Kwsp-Gov-My-W-Article-Savings-And-Inflation", "source_file": "pdfs\\www-kwsp-gov-my-w-article-savings-and-inflation.pdf", "chunk_index": 5, "text": "Register As A Member Introduction About Us Terms & Conditions\nGrow Your Savings Responsibilities Organisational Structure Privacy Policy\nManage Your EPF Account Online Platform Corporate Governance Security Policy\nHome Ownership Employers Education Investment Disclaimer\nProgramme\nFinancial Life Stages Sustainability Online Security Tips\nHealth Protection Business Partners Other Links\nKWSP i-Akaun App News & Highlights Forms\nCareers Resource Centre\nProcurement Achievements\nWhistleblowing & Anti‑Fraud\nContact Us", "created_at": "2026-01-03"}
