{"id": "7b6947ef-5341-4f0d-8327-ee15527855b2", "doc_id": "c141d2b4-98ea-46de-9dcc-6ebcb71e1913", "title": "Www Kwsp.Gov (8)", "source_file": "pdfs\\www_kwsp.gov (8).pdf", "chunk_index": 0, "text": "EN\nMyra Athena Date: 27 Feb 2024\nSave Smarter: Secure Your Future with EPF\nIn Malaysia, as in many parts of the world, the quest for financial security in\nretirement is a paramount concern for individuals of all ages. As the\nworkforce evolves and economic landscapes shift, the need for robust\nretirement savings becomes increasingly evident. In this pursuit, the\nEmployees Provident Fund (EPF) stands tall as a beacon of financial\nsecurity, offering Malaysians a reliable avenue for retirement savings.\nAs individuals, planning for retirement is a crucial step towards ensuring a\ncomfortable future. The EPF provides a solid foundation for this endeavor,\nboasting compelling dividend rates and a range of benefits and offerings\nthat make it an attractive option for long-term financial planning.\nHow can I grow my savings with EPF?\nIt is a common misconception that you can only contribute to or grow your\nEPF savings by earning a bigger paycheck. While earning more definitely\nhelps, you can also boost your savings in EPF in other ways:\nVoluntary Contribution\nYou can choose to increase your EPF savings voluntarily on top of your\nexisting mandatory monthly deductions, with as little as RM10, up to a\nmaximum of RM100,000 per year.\nBy starting your savings journey as early as possible, you can take\nadvantage of the power of compounding, giving your savings more time to\ngrow. So, that’s why you should start saving now to ensure comfort and\nfinancial stability during retirement.\nClick here for", "created_at": "2026-01-03"}
{"id": "21e9c534-5bbc-4717-960c-f0a7cd8b9ccc", "doc_id": "c141d2b4-98ea-46de-9dcc-6ebcb71e1913", "title": "Www Kwsp.Gov (8)", "source_file": "pdfs\\www_kwsp.gov (8).pdf", "chunk_index": 1, "text": "ake\nadvantage of the power of compounding, giving your savings more time to\ngrow. So, that’s why you should start saving now to ensure comfort and\nfinancial stability during retirement.\nClick here for more details on Voluntary Contribution\ni-Saraan\nHave you heard about i-Saraan? It’s tailored for members aged 60 and\nbelow who are self-employed or do not earn regular incomes. Through iSaraan, you can voluntarily contribute to your EPF savings and receive a\nspecial incentive of 15% of the total contributions, up to a maximum of\nRM500 per year and RM5,000 throughout your lifetime. This option is\nparticularly ideal for gig workers as there is no minimum contribution\nrequired, and members will receive annual dividends on their retirement\nsavings along with incentives from the Government.\nFind out more about i-Saraan\nBenefits you can expect to receive as your money\ngrows with EPF over time\nDividend Earnings\nWe offer annual dividend returns of approximately 3% to 4%, with the\npossibility of even higher returns. Additionally, the minimum dividend rate\nis 2.50% for Simpanan Konvensional. With these rates, your savings will be\nshielded from inflation and have steady growth over time.\nRead more on EPF dividends\nFlexibility\nEPF acknowledges members' diverse financial goals and beliefs, providing a\nchoice between syariah-compliant (Simpanan Shariah) and conventional\nsavings (Simpanan Konvensional). With Simpanan Shariah, income derives\nsolely from EPF's Shariah-compliant investments, whil", "created_at": "2026-01-03"}
{"id": "2e25ed9a-0779-49b4-9d40-301da569871b", "doc_id": "c141d2b4-98ea-46de-9dcc-6ebcb71e1913", "title": "Www Kwsp.Gov (8)", "source_file": "pdfs\\www_kwsp.gov (8).pdf", "chunk_index": 2, "text": "ding a\nchoice between syariah-compliant (Simpanan Shariah) and conventional\nsavings (Simpanan Konvensional). With Simpanan Shariah, income derives\nsolely from EPF's Shariah-compliant investments, while Simpanan\nKonvensional includes a mix of both Shariah and non-Shariah compliant\ninvestments.\nThis flexibility enables members to align their investments with personal\nvalues and financial objectives, ensuring a tailored approach to wealth\naccumulation while upholding ethical and religious principles.\nClick here to explore further details about Simpanan Shariah and\nSimpanan Konvensional\nTax Relief\nYour savings in EPF are tax deductible up to a maximum amount of\nRM4,000 per year, subject to periodic amendments by the government\n(excluding exemptions for life insurance premium payments). In addition,\ndividend earnings from EPF investments are also tax-exempt.\nWhat’s more, the EPF aims to support members in improving their financial\nliteracy and understanding sustainable retirement options to enhance\ntheir retirement savings. Through the Relationship & Advisory Service (RA),\nwhich is provided at no cost to members, you can receive assistance in\ncomprehending your financial goals, assessing current savings, and\ndeveloping strategies for a secure retirement.\n\nUltimately, the EPF stands out as a reliable and advantageous option for\nindividuals planning their retirement. By making EPF a core component of\nEN\nyour retirement savings plan, you can harness its offerings to optimise your\nfin", "created_at": "2026-01-03"}
{"id": "b5d279b6-9a62-4ec7-aae1-a5e8c7078586", "doc_id": "c141d2b4-98ea-46de-9dcc-6ebcb71e1913", "title": "Www Kwsp.Gov (8)", "source_file": "pdfs\\www_kwsp.gov (8).pdf", "chunk_index": 3, "text": "t as a reliable and advantageous option for\nindividuals planning their retirement. By making EPF a core component of\nEN\nyour retirement savings plan, you can harness its offerings to optimise your\nfinancial security in retirement. Start saving with EPF today and pave the\nway for a comfortable and worry-free retirement journey.\nTo begin your EPF journey, here's how you can open your EPF account (if\nyou haven’t done so!):\nHowever, for individuals who are not MyKad or MyPR holders, you must\nvisit the nearest EPF office and register in person at the counter.\nDownload KWSP i-Akaun to stay ahead of your financial goals.\nDownload KWSP i-Akaun Now!\nShare    \nRelated Reads\nPERSONAL SKILLS\nCrucial Skills To Adapt To The New Future Of Work\nMember Employer\nRegister As A Member Introduction\nGrow Your Savings Responsibilities\nManage Your EPF Account Online Platform\nHome Ownership Employers Education Programme\nFinancial Life Stages\nHealth Protection\nKWSP i-Akaun App\nCorporate Others\nAbout Us Terms & Conditions\nOrganisational Structure Privacy Policy\nCorporate Governance Security Policy\nInvestment Disclaimer\nSustainability Online Security Tips\nBusiness Partners Other Links\nNews & Highlights Forms\nCareers Resource Centre\nProcurement Achievements\nWhistleblowing & Anti‑Fraud\nContact Us", "created_at": "2026-01-03"}
