{"id": "210170da-6de6-49d7-b685-9d85afcb38d4", "doc_id": "f578e10e-c1de-4819-895b-c4cfe45fad93", "title": "Www Kwsp.Gov (1)", "source_file": "pdfs\\www_kwsp.gov (1).pdf", "chunk_index": 0, "text": "EN\nMyra Athena & Fitri Azmy Date: 09 Aug 2024\nDon’t Be a Victim of Online Theft\nWe have all likely seen news reports about individuals falling victim to a\nscam and thought, \"That would never happen to me\". You might believe\nyou're more aware of cyber threats and more internet-savvy than those in\nthe news, but in today’s digital age, convenience often comes with a price.\nThe belief that we are more aware and skilled can sometimes make us\ncomplacent, causing us to forget that these threats can happen to\nanyone.\nThe advancement of technology has undeniably improved our lives, but on\nthe other hand, it has become fertile ground for scams and fraud. This issue\nis on the rise in Malaysia, where the rapid adoption of digital financial\nservices has unintentionally made us more vulnerable to exploitation by\nscammers.\nUnderstanding the threat\nFinancial scams take on many forms and Malaysians are increasingly\nvulnerable to these schemes, which range from sophisticated phishing\nattempts to phone scams and identity theft. By understanding these\ncommon types of fraud, we can better protect ourselves and avoid\nbecoming victims of cybercriminals.\nCommon scams to watch out for\nPhishing emails and messages\nBe cautious of emails or messages that appear to be from trustworthy\nsources asking you to verify account details or click on a link to update your\ninformation. These links may direct you to fake websites designed to steal\nyour login credentials and personal data. This tactic is known as phi", "created_at": "2026-01-03"}
{"id": "255cf90a-be56-4f4d-8c74-a9a1af142ac3", "doc_id": "f578e10e-c1de-4819-895b-c4cfe45fad93", "title": "Www Kwsp.Gov (1)", "source_file": "pdfs\\www_kwsp.gov (1).pdf", "chunk_index": 1, "text": "erify account details or click on a link to update your\ninformation. These links may direct you to fake websites designed to steal\nyour login credentials and personal data. This tactic is known as phishing.\nVoice phishing\nAlways be cautious when receiving calls from unknown numbers, especially\nif the caller pressures you to provide personal information, make\npayments, or claims there is an urgent issue with your account.\nCybercriminals frequently use coercion tactics to create a sense of urgency,\nexploiting your vulnerability to gain access to your personal or financial\ndata.\nImpersonation scams\nAvoid falling victim to cybercriminals posing as officials or financial advisors\nor pretending to be government authorities. They might promise\nunrealistic investment returns, such as in FOREX investment scams, or\nclaim that there is an urgent issue. These criminals use psychological\ntactics to convince you that they are legitimate and trustworthy,\nmanipulating you into revealing sensitive information or making financial\ntransactions based on deceitful claims.\nFraud warning\nIf you receive messages via social media, SMS, or WhatsApp claiming to be\nfrom the Employees Provident Fund (EPF), stay sharp! Always verify the\nsource of such communications and ensure that they are from a legitimate\nand trustworthy origin.\n\nEN\nThe EPF has issued a warning against fraudulent activities that allegedly\npromised early EPF withdrawals with specific payment amounts, often\nadvertised on social media. Th", "created_at": "2026-01-03"}
{"id": "76f3e5bb-0041-48d6-8217-a27960637249", "doc_id": "f578e10e-c1de-4819-895b-c4cfe45fad93", "title": "Www Kwsp.Gov (1)", "source_file": "pdfs\\www_kwsp.gov (1).pdf", "chunk_index": 2, "text": "and trustworthy origin.\n\nEN\nThe EPF has issued a warning against fraudulent activities that allegedly\npromised early EPF withdrawals with specific payment amounts, often\nadvertised on social media. These scam groups use falsified documents to\nprocess withdrawals, exposing you to financial risks and potential legal\nconsequences.\nThe EPF has also addressed SMS scams where members receive messages\nthreatening to suspend their accounts. These messages will instruct you to\ncontact a specified number within 24 hours to cancel the suspension. In\nsuch cases, cybercriminals will initiate a scam through phone conversations\nwith you.\nPlease be advised that official SMS messages from the EPF will always\ncome from a five-digit short code, such as 66688, and never from a\npersonal phone number.\nProtecting yourself\n\u0000. Verify the authenticity of communication:\nSafeguard yourself by verifying the authenticity of any\ncommunication pretending to be from EPF officials. Avoid responding\nto suspicious offers or sharing personal information with unknown\nparties. For any inquiries regarding the EPF, you can contact them\nthrough our official channels or click here for more information.\nTypically, the EPF Contact Centre will use the number 03-89224000\nfor outgoing calls to members or employers.\n\u0000. Enhance account security:\nUse a strong, unique password for your EPF account and enable twofactor authentication. A good password should be at least 12\ncharacters long and include a mix of uppercase letters,", "created_at": "2026-01-03"}
{"id": "db7618cd-3755-425a-aaa2-1004993b1e40", "doc_id": "f578e10e-c1de-4819-895b-c4cfe45fad93", "title": "Www Kwsp.Gov (1)", "source_file": "pdfs\\www_kwsp.gov (1).pdf", "chunk_index": 3, "text": "account security:\nUse a strong, unique password for your EPF account and enable twofactor authentication. A good password should be at least 12\ncharacters long and include a mix of uppercase letters, lowercase\nletters, numbers, and symbols. Avoid accessing your EPF account via\nunsecured public Wi-Fi networks to reduce the risk of data breaches.\n\u0000. Stay informed:\nKeep yourself updated about the latest scams and fraud tactics\ntargeting EPF members. Sharing this knowledge with family and\nfriends helps create a network of protection.\n\u0000. Report suspicious activity:\nIf you receive suspicious emails, messages, or phone calls pretending\nto be from EPF, report them immediately to EPF through the official\nchannels for further action and investigation.\nIf you have fallen victim to online fraud:\n1) Immediately contact the National Scam Response Centre (NSRC) at 997;\n2) Lodge a police report. Calls to the NSRC should be made within 24 hours\nof the fraud incident and within its operating hours (8am-8pm, including\nweekends and public holidays).\nFor more information about the NSRC, visit their information hub here.\nShare    \nRelated Reads\nPERSONAL FINANCE\nHow To Be Smart With Your Money During The Festive Season\nSCAM AWARENESS\nRed Flags To Watch Out For In Scams\nMember Employer\nRegister As A Member Introduction\nGrow Your Savings Responsibilities\nManage Your EPF Account Online Platform\nHome Ownership Employers Education Programme\nFinancial Life Stages\nHealth Protection\nKWSP i-Akaun App\n\nC", "created_at": "2026-01-03"}
{"id": "b1c3ad3f-16d5-4b21-a235-d38650034f8f", "doc_id": "f578e10e-c1de-4819-895b-c4cfe45fad93", "title": "Www Kwsp.Gov (1)", "source_file": "pdfs\\www_kwsp.gov (1).pdf", "chunk_index": 4, "text": "Member Introduction\nGrow Your Savings Responsibilities\nManage Your EPF Account Online Platform\nHome Ownership Employers Education Programme\nFinancial Life Stages\nHealth Protection\nKWSP i-Akaun App\n\nCorporate Others\nEN\nAbout Us Terms & Conditions\nOrganisational Structure Privacy Policy\nCorporate Governance Security Policy\nInvestment Disclaimer\nSustainability Online Security Tips\nBusiness Partners Other Links\nNews & Highlights Forms\nCareers Resource Centre\nProcurement Achievements\nWhistleblowing & Anti‑Fraud\nContact Us", "created_at": "2026-01-03"}
