{"id": "dcc570e0-8897-4373-ae84-b928c6046a28", "doc_id": "0b5952b0-824f-49bb-90b4-dd5b177ec845", "title": "Www Kwsp.Gov (2)", "source_file": "pdfs\\www_kwsp.gov (2).pdf", "chunk_index": 0, "text": "EN\nMyra Athena Date: 29 Aug 2025\nCelebrate Merdeka With A New Beginning\nTowards Financial Independence\nEvery 31st August, Malaysians come together to celebrate our nation’s\nindependence with gratitude and pride. This year, as we commemorate\nour 68th Merdeka, let us reflect not only on the nation’s journey to\nfreedom but also on a form of independence that touches each of us\npersonally — freedom from financial debt.\nJust as our forefathers worked tirelessly for the nation’s independence, we\ntoo can work towards breaking free from the weight of financial\nobligations. Regardless of background or situation, the dream of living\ndebt-free is one we all share. But, how can we turn this dream into reality?\nLet’s explore some debt repayment methods that can help us achieve the\nfinancial independence we dream of.\n1. Debt avalanche method\nWhich debt should you pay off first?\nPay off debts with the highest interest rates first. By focusing on these\ndebts, you can:\nSave on interest payments in the long term.\nAccelerate the overall debt repayment process.\nImprove your credit score through consistent payment records in\nCCRIS and CTOS reports.\nExample: Ali and Mariam, a newlywed couple, have three main\ndebts:\nCredit card with 18% interest\nCar loan with 7% interest\nStudent loan with 5% interest\nThey choose to pay more towards their credit card first while making\nminimum payments on the other two debts. Once the credit card\ndebt is cleared, they can use the same amount to repay the car loan,\nf", "created_at": "2026-01-03"}
{"id": "efbf5fce-9ef8-4f25-aa9f-8ac6f0d40896", "doc_id": "0b5952b0-824f-49bb-90b4-dd5b177ec845", "title": "Www Kwsp.Gov (2)", "source_file": "pdfs\\www_kwsp.gov (2).pdf", "chunk_index": 1, "text": "hey choose to pay more towards their credit card first while making\nminimum payments on the other two debts. Once the credit card\ndebt is cleared, they can use the same amount to repay the car loan,\nfollowed by the student loan.\n(cid:0) Who it’s for: Those who want to reduce interest costs strategically and\nachieve financial freedom faster through careful planning.\n2. Debt snowball method\nHow can small wins keep you motivated?\nPay off the smallest debt first to gain early satisfaction and motivation to\ntackle larger debts.\nExample: Chong, an executive at a private company, has three\ndebts:\nPersonal loan: RM1,000\nStudent loan: RM5,000\nCar loan: RM10,000\nHe begins by clearing the RM1,000 personal loan to enjoy an early\nsense of accomplishment. Once it is paid off, Chong uses the same\npayment amount to tackle the student loan, and then the car loan.\nThese small victories provide the momentum to continue repaying\ndebts consistently while improving his CCRIS record.\n(cid:0) Who it’s for: Those who are new to debt management, may lose\nmotivation easily, or want to see quick results to stay encouraged.\n3. Debt snowflake method\nHow can extra savings help clear debts faster?\nUse the extra money saved from daily activities to make additional debt\npayments. Even small amounts can significantly accelerate the repayment\nof outstanding debts and positively impact your credit record.\nExample: Gunalan, a student, saves RM10 daily by bringing food from\nhome instead of buying lunch. Instead of", "created_at": "2026-01-03"}
{"id": "49c15e20-c56d-462f-a20a-d73e0161b039", "doc_id": "0b5952b0-824f-49bb-90b4-dd5b177ec845", "title": "Www Kwsp.Gov (2)", "source_file": "pdfs\\www_kwsp.gov (2).pdf", "chunk_index": 2, "text": "tly accelerate the repayment\nof outstanding debts and positively impact your credit record.\nExample: Gunalan, a student, saves RM10 daily by bringing food from\nhome instead of buying lunch. Instead of letting that RM10 sit\naround, he puts it toward his student loan. Even though the amount\nmight not seem much, over time, it makes a big difference, speeding\nup his loan repayment and giving his credit score a boost.\n(cid:0) Who it’s for: Those with a limited budget who are disciplined and want to\nsee steady, consistent progress in reducing their debts.\n\n4. Debt consolidation\nEN\nHow can you simplify debts into one payment?\nCombine all your debts into a single new loan with a lower interest rate. By\nconsolidating your debts into one monthly payment, you not only simplify\nyour financial management and reduce stress, but you give yourself more\nroom to plan for a debt-free future.\nExample: Maria, a single mother with multiple credit cards and\npersonal loans, chose to consolidate all her debts into one new loan\nwith a lower interest rate. By doing this, Maria only has to make one\nmonthly payment, simplifying her financial management and\nreducing her stress.\n(cid:0) Who it’s for: Those who want to reorganise multiple debt commitments\nand make them easier to manage.\nReady to take the next step towards financial\nindependence?\nAchieving independence from financial debt is a highly valued milestone.\nBy applying these methods, you will move closer to becoming debt-free\nand, in turn, build l", "created_at": "2026-01-03"}
{"id": "eea15df2-4194-4d14-8d40-78b90ae740c7", "doc_id": "0b5952b0-824f-49bb-90b4-dd5b177ec845", "title": "Www Kwsp.Gov (2)", "source_file": "pdfs\\www_kwsp.gov (2).pdf", "chunk_index": 3, "text": "tep towards financial\nindependence?\nAchieving independence from financial debt is a highly valued milestone.\nBy applying these methods, you will move closer to becoming debt-free\nand, in turn, build long-term financial stability for yourself and your loved\nones.\nRemember, every financial situation is unique. For guidance tailored to\nyour needs, consult an EPF Relationship & Advisory (RA) Officer. Financial\nindependence is within your reach — start your journey to freedom today!\nGet Free Professional Consultation From EPF Today\nShare    \nRelated Reads\nPERSONAL FINANCE\nFinancial Milestones to Achieve Before Turning 30\nPERSONAL FINANCE\nMalaysia Day Special: Navigating Finances With A Local Flair\nPERSONAL FINANCE\nMaster Your Budget: Steps, Importance & Tips\nMember Employer\nRegister As A Member Introduction\nGrow Your Savings Responsibilities\nManage Your EPF Account Online Platform\nHome Ownership Employers Education Programme\nFinancial Life Stages\nHealth Protection\nKWSP i-Akaun App\nCorporate Others\nAbout Us Terms & Conditions\nOrganisational Structure Privacy Policy\nCorporate Governance Security Policy\nInvestment Disclaimer\nSustainability Online Security Tips\nBusiness Partners Other Links\nNews & Highlights Forms\nCareers Resource Centre\nProcurement Achievements\nWhistleblowing & Anti‑Fraud\nContact Us", "created_at": "2026-01-03"}
