{"id": "45a0b492-be18-486a-97e2-7e945adcfed3", "doc_id": "e8cb2917-a3b7-4f76-9e77-8ad6862c341c", "title": "Www Kwsp.Gov (12)", "source_file": "pdfs\\www_kwsp.gov (12).pdf", "chunk_index": 0, "text": "EN\nMyra Athena Date: 15 Sep 2023\n3 Unwise Spending Habits in Your 20s\nThe early 20s is often associated with the beginning of adulthood – a time\nof navigating responsibilities and gaining independence. It's an\nexhilarating time as you experience a sense of financial independence as\nyou’re starting to earn money from your first job. With newfound freedom,\nit's natural to have high aspirations and spend on the things you've always\ndesired.\nWhile income plays a vital role in personal finance, success will rely on how\nyou’re managing your money. It’s cliché, but it’s true and it’s the one\naspect that you can take control of. If you want to prepare yourself for a\ngreater financial future, you must first develop a good grasp of money\nmanagement.\nTo get on track financially, start by avoiding these 3 pitfalls:\n1. Living beyond your means\nEarning your first paycheck is undeniably liberating and thrilling. It sparks a\ndesire to purchase all the things you’ve been eyeing, including that pair of\nsneakers everyone’s talking about.\n“The limited edition sneaker is finally out! I must get my hands on it”\n“I’d look so cool in those shoes”\nBefore we know it, we fall victim to lifestyle inflation, where we start\nspending more as our income increases.\nBut here's the thing – aligning your lifestyle with your financial reality is\nwhat truly matters. It's easy to get caught up in comparing ourselves to\nothers and feeling the pressure to keep up with their spending habits.\nHowever, that's one way t", "created_at": "2026-01-03"}
{"id": "47f75049-8b24-48fd-8c9b-134b5db6e716", "doc_id": "e8cb2917-a3b7-4f76-9e77-8ad6862c341c", "title": "Www Kwsp.Gov (12)", "source_file": "pdfs\\www_kwsp.gov (12).pdf", "chunk_index": 1, "text": "with your financial reality is\nwhat truly matters. It's easy to get caught up in comparing ourselves to\nothers and feeling the pressure to keep up with their spending habits.\nHowever, that's one way to find ourselves in a financial mess.\nInstead, take a moment to refocus on what truly counts – your own\nfinancial wellbeing. It's about taking a step back and consciously making\nchoices that support your long-term goals.\nWhat you can do:\nOne effective way is to practise mindful spending by distinguishing\nbetween your wants and needs. Avoid making impulsive purchases and\ninstead, give yourself time to reflect on the necessity of an item. By doing\nso, you can make more informed financial decisions and prioritise spending\non essential items rather than indulging in unnecessary expenses.\nPicture this: you’re in a store, eyeing a shiny new gadget or a stylish outfit.\nBefore you make that purchase, take a moment to evaluate the necessity\nof the item, is it a “want” or a “need”? Ask yourself, “do I really need this, or\nis it just a fleeting desire?”. You’ll be surprised how many impulsive\npurchases you can dodge.\nRead also: BNPL: Every Shopaholic's Dream Come True\n2. Overlooking the significance of budgeting\nMany young people often overlook the importance of budgeting and\ninstead choose to spend their money freely and worry about their finances\nlater.\nTeenagers often succumb to the habit of unwise spending, which is\nworsened by the existence of a debt system, commonly referred to as \"pa", "created_at": "2026-01-03"}
{"id": "53092346-8fc9-4174-8560-4956e8282979", "doc_id": "e8cb2917-a3b7-4f76-9e77-8ad6862c341c", "title": "Www Kwsp.Gov (12)", "source_file": "pdfs\\www_kwsp.gov (12).pdf", "chunk_index": 2, "text": "spend their money freely and worry about their finances\nlater.\nTeenagers often succumb to the habit of unwise spending, which is\nworsened by the existence of a debt system, commonly referred to as \"pay\nlater.\" They are easily lured by the ability to purchase expensive designer\nitems through instalment payments and unless their mindset shifts, they\nmay find themselves trapped in debt, resulting in negative long-term\nconsequences.\nWhat you can do:\n\nHowever, creating and following a budget can be a smart idea. It allows\nyou to plan and track your monthly expenses, minimise unnecessary\nEN\nspending, and work towards your financial goals more effectively.\nIf you're new to budgeting and prefer to organise your budget digitally,\nthe Belanjawanku app by EPF stands out as a valuable tool. Not only it\nhelps you categorise and track your monthly and annual expenses, it also\nserves as a practical reference and foundation for money management.\nThe app lets you choose how you want to track your spending. You can use\nthe estimates from the Belanjawanku guide or the Rule of Thumb method\n(45/35/20 Rule) – whichever you prefer. This helps you compare your\nexpenses to the recommended budget and understand your financial\nsituation better.\nPacked with tips for improved personal financial management,\nBelanjawanku acts as a trusted companion, empowering you to make\ninformed choices about your finances. The app is available for download on\nthe Apple App Store, Google Play Store and Huawei App Gallery", "created_at": "2026-01-03"}
{"id": "e515a1f1-750b-4349-8f9b-a42fc9ef495a", "doc_id": "e8cb2917-a3b7-4f76-9e77-8ad6862c341c", "title": "Www Kwsp.Gov (12)", "source_file": "pdfs\\www_kwsp.gov (12).pdf", "chunk_index": 3, "text": "elanjawanku acts as a trusted companion, empowering you to make\ninformed choices about your finances. The app is available for download on\nthe Apple App Store, Google Play Store and Huawei App Gallery.\n3. Ignoring the need to prioritise savings\nIn addition to saving for retirement, it's essential to establish a solid\nemergency fund to safeguard your financial stability in unforeseen\ncircumstances. While retirement might seem too far off to start\nconsidering, cultivating a habit of responsible savings is crucial for\nnavigating the unexpected twists and turns that life can throw your way.\nWhether it's 3%, 5%, or 10% of your salary – allocating a dedicated portion\nfor savings should be a non-negotiable initiative in your budget that can\nshield you from the impact of unexpected medical expenses, job loss, or\nother unexpected financial burdens.\nLet's dive into the 45/35/20 Rule of Thumb as recommended in the\nBelanjawanku app , an easy trick to handle your money like a pro! Here's\nhow it works: split your take-home pay into three parts - 45% for your\nnecessities, 35% for your commitments, and 20% for your savings. Even if\nyou can only save 5% at first, it's a great start that sets you on the right\ntrack.\nRemember, any amount greater than zero is a step in the right direction.\nEven if you can only contribute a small percentage initially, don't be\ndisheartened. Starting early and consistently is key, and as your financial\ncircumstances improve, you can gradually increase your savings", "created_at": "2026-01-03"}
{"id": "a8b0e673-2f18-4f58-a918-8c855400c7a4", "doc_id": "e8cb2917-a3b7-4f76-9e77-8ad6862c341c", "title": "Www Kwsp.Gov (12)", "source_file": "pdfs\\www_kwsp.gov (12).pdf", "chunk_index": 4, "text": "ou can only contribute a small percentage initially, don't be\ndisheartened. Starting early and consistently is key, and as your financial\ncircumstances improve, you can gradually increase your savings\ncontribution.\nWhat you can do:\nConsider opening separate savings accounts dedicated to your specific\nsavings goals. Make use of automation features to schedule regular\ntransfers into these accounts. By doing so, you create a reliable backup\nplan and witness your savings grow steadily, providing you with a sense of\nsecurity and peace of mind as your savings accumulate over time.\nAdditionally, you can easily contribute voluntarily to your EPF account\nthrough the Voluntary Contribution feature, which grants you the\nflexibility to boost your savings. This empowers you to proactively bolster\nyour savings, even with contributions as little as RM10! It's a fantastic\nopportunity to take control of your financial future and watch your savings\nflourish.\nWith a chance to make wise financial decisions, it's crucial to start afresh by\nsaving and creating a budget. This approach will avoid unnecessary\nspending habits and ensure that you have savings for future needs. So,\nwhy not start now? Take control of your finances and begin saving today\nfor a more secure tomorrow!\nShare    \nRelated Reads\nPERSONAL FINANCE\nS.M.A.R.T Budgeting Technique\nEDUCATION\nThe Impact of Education on Career Advancement\n\nPERSONAL FINANCE\nEN\nFinancial Milestones to Achieve Before Turning 30\nMember Employer\nRegister", "created_at": "2026-01-03"}
{"id": "ebcbd9b5-e94e-4740-8bab-c720846998b5", "doc_id": "e8cb2917-a3b7-4f76-9e77-8ad6862c341c", "title": "Www Kwsp.Gov (12)", "source_file": "pdfs\\www_kwsp.gov (12).pdf", "chunk_index": 5, "text": "PERSONAL FINANCE\nS.M.A.R.T Budgeting Technique\nEDUCATION\nThe Impact of Education on Career Advancement\n\nPERSONAL FINANCE\nEN\nFinancial Milestones to Achieve Before Turning 30\nMember Employer\nRegister As A Member Introduction\nGrow Your Savings Responsibilities\nManage Your EPF Account Online Platform\nHome Ownership Employers Education Programme\nFinancial Life Stages\nHealth Protection\nKWSP i-Akaun App\nCorporate Others\nAbout Us Terms & Conditions\nOrganisational Structure Privacy Policy\nCorporate Governance Security Policy\nInvestment Disclaimer\nSustainability Online Security Tips\nBusiness Partners Other Links\nNews & Highlights Forms\nCareers Resource Centre\nProcurement Achievements\nWhistleblowing & Anti‑Fraud\nContact Us", "created_at": "2026-01-03"}
