{"id": "fb4155e3-4c58-4037-8bc0-320b0e9ab04a", "doc_id": "0d734555-6e58-420d-b6f8-2e3416a96fe8", "title": "Www Kwsp.Gov (5)", "source_file": "pdfs\\www_kwsp.gov (5).pdf", "chunk_index": 0, "text": "EN\nMyra Athena Date: 15 Nov 2024\nHow to Lose Your Savings In 10 Days (But, Maybe\nDon’t)\nIf I had to bet, I’d say it’s easier to lose a month’s pay in ten days than it\nwould be to lose a man in ten days. Inspired by the classic rom-com How to\nLose a Guy in 10 Days, here’s some financial advice you should probably\nignore—unless you enjoy watching your hard-earned money slip away!\nImpulse shopping\nEver catch yourself scrolling through online stores, eyeing those cute heels\nfrom your favourite local shop? Buy them! The first step to draining your\nsavings is to not think and go crazy on your impulse shopping. The rush of\nspontaneous purchases can be irresistible, and before you know it, your\nsavings have dwindled.\nTip: Always make a shopping list before you go out (or online). If you\nfind yourself still thinking about an item after 24 hours, then it might\nbe worth considering. Buy what you need, not just what you want.\nAnd don’t forget to compare prices — sometimes you can find the\nsame item for less!\nForget about a budget\nWho needs a budget anyway? It can feel exhilarating to toss your financial\nplan out the window and embrace a carefree lifestyle. Got an itch to\ntravel? Book that flight without a second thought! Spend freely—money\ncan always be earned again, or so the saying goes. But let’s be real — this\n“freedom” often ends up with you living paycheck to paycheck.\nTip: Instead of tiptoeing around a budget, consider creating a simple\nbudget to keep your finances in check. Apps", "created_at": "2026-01-03"}
{"id": "be07b004-38f8-4334-a77c-3d6968ff9daa", "doc_id": "0d734555-6e58-420d-b6f8-2e3416a96fe8", "title": "Www Kwsp.Gov (5)", "source_file": "pdfs\\www_kwsp.gov (5).pdf", "chunk_index": 1, "text": "ut let’s be real — this\n“freedom” often ends up with you living paycheck to paycheck.\nTip: Instead of tiptoeing around a budget, consider creating a simple\nbudget to keep your finances in check. Apps like EPF’s Belanjawanku\ncan help you track your spending and stay accountable. This way,\nyou’ll have a clearer picture of how much you have left to enjoy\nwithout the stress of financial surprises.\nDine out daily\nWhy cook when you can enjoy eating out for every meal? It’s so much\neasier than shopping for groceries and dealing with the dishes afterward.\nPlus, you get to explore that new restaurant everyone is talking about or\ngrab a coffee from that cute café down the street. Who wouldn’t want to\nenjoy delicious meals without the fuss?\nTip: While dining out can be fun, set a limit on how often you eat out\neach week. One or two meals might not seem like a big deal, but if\nyou’re eating out every day, those costs can really add up. Meal\nprepping can save both time and money, allowing you to enjoy\nhomemade meals without breaking the bank.\nOverspending on subscriptions\n\nIt’s tempting to sign up for every streaming service, gym membership, and\napp that piques your interest. A free trial here, a new service there — it all\nEN\nseems harmless at first! But after a few weeks, you might find that you’re\nhardly using any of them. Those little monthly charges can add up quickly,\nand before you know it, your savings could take a hit from fees that went\nunnoticed.\nTip: Review your subscriptions r", "created_at": "2026-01-03"}
{"id": "1cb8cf68-40ba-4204-8552-bcdf34fe25fa", "doc_id": "0d734555-6e58-420d-b6f8-2e3416a96fe8", "title": "Www Kwsp.Gov (5)", "source_file": "pdfs\\www_kwsp.gov (5).pdf", "chunk_index": 2, "text": "you’re\nhardly using any of them. Those little monthly charges can add up quickly,\nand before you know it, your savings could take a hit from fees that went\nunnoticed.\nTip: Review your subscriptions regularly and cancel the ones you\ndon’t use often. Ask yourself — do you really need that streaming\nservice if you’re only watching one show? Is that gym membership\nstill worth it if you haven’t been in weeks? You’d be surprised at how\nmuch you can save by cutting out just a few unnecessary services.\nFOMO: Say yes to every invitation\nIt’s so easy to get caught up in FOMO and say yes to every invite that\ncomes your way. Whether it’s brunch with friends or a spontaneous\nweekend trip, living in the moment can feel so rewarding. Who wants to\nmiss out on a good time, right?\nTip: But don’t forget, it’s totally fine to say no sometimes or suggest\nsimpler plans. Hosting a potluck or having a movie night at home can\nbe just as fun—and way kinder to your wallet! At the end of the day,\nit’s not about where you go; it’s about enjoying the time with the\npeople you care about.\nIgnore financial advice\nIt can feel easy and comfortable to brush off all financial advice and stick\nto what you know. After all, staying in your bubble might seem safe. But\nignoring this advice can lead you down a risky path—because sometimes,\nignorance isn’t bliss.\nTip: Instead, take the time to seek out reliable financial advice and\nlearn about money management. Knowledge is power, and\nunderstanding your finances can h", "created_at": "2026-01-03"}
{"id": "63762fdd-abca-4b17-9cbf-b60a006123dd", "doc_id": "0d734555-6e58-420d-b6f8-2e3416a96fe8", "title": "Www Kwsp.Gov (5)", "source_file": "pdfs\\www_kwsp.gov (5).pdf", "chunk_index": 3, "text": "—because sometimes,\nignorance isn’t bliss.\nTip: Instead, take the time to seek out reliable financial advice and\nlearn about money management. Knowledge is power, and\nunderstanding your finances can help you make smarter choices for\nyour future.\nFor you to read: 4 Things To Avoid When Planning Your Retirement\nConclusion\nWhile this article was written with a humorous twist, the reality is that it’s\nall too easy to lose sight of our savings goals. Reckless spending and poor\nfinancial choices can leave us in a tough spot — sometimes in just 10 days!\nLearn from these pitfalls, create a plan, and watch your savings grow\ninstead!\nShare    \nRelated Reads\nPERSONAL FINANCE\nS.M.A.R.T Budgeting Technique\nPERSONAL FINANCE\n5 Reasons Why You Should Save Money\nPERSONAL FINANCE\nFinancial Milestones to Achieve Before Turning 30\nPERSONAL FINANCE\nStop Living Paycheck To Paycheck\nPERSONAL FINANCE\nMaster Your Budget: Steps, Importance & Tips\nMember Employer\nRegisterAsA Member Introduction\n\nRegister As A Member Introduction\nGrow Your Savings Responsibilities\nEN\nManage Your EPF Account Online Platform\nHome Ownership Employers Education Programme\nFinancial Life Stages\nHealth Protection\nKWSP i-Akaun App\nCorporate Others\nAbout Us Terms & Conditions\nOrganisational Structure Privacy Policy\nCorporate Governance Security Policy\nInvestment Disclaimer\nSustainability Online Security Tips\nBusiness Partners Other Links\nNews & Highlights Forms\nCareers Resource Centre\nProcurement Achievements\nWhistleblowing", "created_at": "2026-01-03"}
{"id": "7cc8d537-1312-4ad4-afd9-df63da736949", "doc_id": "0d734555-6e58-420d-b6f8-2e3416a96fe8", "title": "Www Kwsp.Gov (5)", "source_file": "pdfs\\www_kwsp.gov (5).pdf", "chunk_index": 4, "text": "ernance Security Policy\nInvestment Disclaimer\nSustainability Online Security Tips\nBusiness Partners Other Links\nNews & Highlights Forms\nCareers Resource Centre\nProcurement Achievements\nWhistleblowing & Anti‑Fraud\nContact Us", "created_at": "2026-01-03"}
