{"id": "04e30ceb-d606-42b1-a326-686f6b361a90", "doc_id": "d5b8852a-7c5e-44e8-b4d6-570c1050b4dc", "title": "Www Kwsp.Gov (7)", "source_file": "pdfs\\www_kwsp.gov (7).pdf", "chunk_index": 0, "text": "EN\nMyra Athena, Sharifah Norashikin Date: 05 Jul 2024\nFinancial Milestones To Achieve Before Turning 30\nFor many of us, approaching the big–30 is like stepping into a new chapter\nof adulthood – one that comes with a blend of excitement and\nresponsibility. But before you blow out the candles on your 30th birthday\ncake, there are a few financial milestones you should aim to conquer.\nYou won't have everything figured out, financially or in life, by the time you\nhit 30. And that's fine. What matters is keeping an eye on your overall\nfinancial situation early on so that you're better equipped to reach later\ngoals at different stages of your life.\nThere's no one-size-fits-all approach, but here are five financial\ncheckpoints that can guide you towards success as you grow older:\nHarness the power of budgeting\nCreate a budget that mirrors your goals and lifestyle, and stick to it like\nglue. Track your spending, identify areas where you can cut back, and\nwatch your savings grow. Remember, every ringgit has a purpose, even if\nit's treating yourself to that Friday night takeaway.\nPro tip: Utilise tools like the Belanjawanku app to streamline this process,\nthus empowering you to achieve your financial objectives efficiently and\neffectively. Download the app from Apple App Store, Google Play Store or\nHuawei App Gallery.\nBe cautious with debt\nDebt can feel like a dark cloud looming over your financial future. Take\ncharge by tackling high-interest debts like credit cards or personal loans\nh", "created_at": "2026-01-03"}
{"id": "b48bd489-5494-4e0d-a53b-5af3953d8fa7", "doc_id": "d5b8852a-7c5e-44e8-b4d6-570c1050b4dc", "title": "Www Kwsp.Gov (7)", "source_file": "pdfs\\www_kwsp.gov (7).pdf", "chunk_index": 1, "text": "Store or\nHuawei App Gallery.\nBe cautious with debt\nDebt can feel like a dark cloud looming over your financial future. Take\ncharge by tackling high-interest debts like credit cards or personal loans\nhead-on. Set a plan in motion to pay them off, starting with the ones that\nhave the highest interest rates. You'll find that the feeling of liberation\nwhen you're debt-free is worth every penny pinched.\nPro tip: List out all debts and interest rates, and either pay off those with\nthe highest rates or consolidate them for better interest rates.\nStart to grow your savings\nBuilding a robust savings account is essential for financial security. Establish\na dedicated savings account and automatically deduct a portion of your\nincome regularly. This practice not only provides you with a stable source\nof money for future purposes such as big-ticket purchases, but also enables\nyou to invest in future opportunities.\nPro tip: It is advisable to have savings of at least three to six months of\nincome as a safety net in case any bad situations arise.\nImprove your credit score\nYour credit score acts as your financial report card - it matters. Aim to build\na good credit score by consistently paying bills on time, keeping credit card\nbalances low, and avoiding unnecessary debt. A good credit score opens\ndoors to better interest rates on loans, credit cards, and even renting an\napartment. It's your ticket to financial freedom!\nPro tip: Set up automatic recurring payments for your bills to avoid miss", "created_at": "2026-01-03"}
{"id": "f9e531ec-8762-4103-9b68-8c760ec4f725", "doc_id": "d5b8852a-7c5e-44e8-b4d6-570c1050b4dc", "title": "Www Kwsp.Gov (7)", "source_file": "pdfs\\www_kwsp.gov (7).pdf", "chunk_index": 2, "text": "s\ndoors to better interest rates on loans, credit cards, and even renting an\napartment. It's your ticket to financial freedom!\nPro tip: Set up automatic recurring payments for your bills to avoid missing\nthem or incurring additional fees.\nStart planning for retirement\nThough retirement may seem distant, planning and saving early for it will\nensure you get to benefit from compounding interest on your savings.\n\nConsistent savings, even at small amounts, can help provide a comfortable\nretirement and avoid the need to save bigger amounts during your 30s\nEN\nand 40s.\nPro tip: Make additional contributions to your EPF savings through\nVoluntary Excess and/or Voluntary Contributions.\nRead also: 4 Things To Avoid When Planning Your Retirement\nDownload the KWSP i-Akaun app to grow your EPF savings!\nKeep in mind that your financial journey is uniquely yours and may not\nalign with those of others. Remember to create goals that resonate with\nyour needs and goals, not ones you're creating to keep up with others. Be\npatient and kind to yourself as you work towards these financial\nmilestones. By achieving these goals in your twenties, you lay the\ngroundwork for a secure and prosperous future.\nShare    \nRelated Reads\nPERSONAL FINANCE\nTips On Buying Your First Car\nPERSONAL FINANCE\n3 Unwise Spending Habits in Your 20s\nPERSONAL FINANCE\nUnderstand The Impact Of Inflation On Your Savings\nPERSONAL FINANCE\nHow to Lose Your Savings In 10 Days (But, Maybe Don’t)\nPERSONAL FINANCE\nAchieving Financial", "created_at": "2026-01-03"}
{"id": "9b6c9057-d444-476d-82cd-c1a8b755abb5", "doc_id": "d5b8852a-7c5e-44e8-b4d6-570c1050b4dc", "title": "Www Kwsp.Gov (7)", "source_file": "pdfs\\www_kwsp.gov (7).pdf", "chunk_index": 3, "text": "ding Habits in Your 20s\nPERSONAL FINANCE\nUnderstand The Impact Of Inflation On Your Savings\nPERSONAL FINANCE\nHow to Lose Your Savings In 10 Days (But, Maybe Don’t)\nPERSONAL FINANCE\nAchieving Financial Independence\nPERSONAL FINANCE\nWhat Make Cent$: Plan Your Life, Plan Your Retirement\nMember Employer\nRegister As A Member Introduction\nGrow Your Savings Responsibilities\nManage Your EPF Account Online Platform\nHome Ownership Employers Education Programme\nFinancial Life Stages\nHealth Protection\nKWSP i-Akaun App\nCorporate Others\nAbout Us Terms & Conditions\nOrganisational Structure Privacy Policy\nCorporate Governance Security Policy\nInvestment Disclaimer\nSustainability Online Security Tips\nBusiness Partners Other Links\nNews & Highlights Forms\nCareers Resource Centre\nProcurement Achievements\nWhistleblowing & Anti‑Fraud\nContact Us", "created_at": "2026-01-03"}
