{"id": "e6a74dbc-632e-44a5-b5cf-39c7edbc876b", "doc_id": "7422d453-c8d6-4a1e-a18f-4034872af9e1", "title": "Www Kwsp.Gov", "source_file": "pdfs\\www_kwsp.gov.pdf", "chunk_index": 0, "text": "EN\nMyra Athena & Sharifah Norashikin Date: 02 Aug 2024\nBNPL: Every Shopaholic's Dream Come True\nFor every shopaholic, Buy Now, Pay Later (BNPL) truly is a dream come\ntrue.\nImagine being able to indulge in all your favorite purchases instantly,\nwithout the immediate burden of paying for them. However, like any\ndream, there's more to it than meets the eye.\nFollow along as we step into the shoes of shopaholic Shasha navigating the\nworld of BNPL.\nInitial fascination (day 1)\nLate one night, Shasha stumbled upon BNPL while strolling through an\nonline store. The promise of getting what she wanted without an\nimmediate financial burden seemed too good to pass up. With a few clicks,\nshe was able to purchase the pretty outfits she had been eyeing, all while\ndeferring payment.\nImmediate gratification (week 1)\nWhen Shasha’s package arrived, the rush of excitement overshadowed\nany thoughts of future payments. BNPL made it easy to satisfy her\nimpulses instantly without considering the long-term financial\nimplications.\nEscalating temptation (month 1)\nAs weeks passed, BNPL became Shasha’s go-to for shopping. The ease of\nsplitting payments into smaller chunks fueled her desire to acquire more.\nWhether it was fashion trends, gadgets, or home decor, BNPL seemed like\na gateway to indulgence without consequences.\nReality check (month 3)\nBy the third month, reality began to set in. Juggling multiple BNPL\npayments alongside other expenses strained Shasha’s budget. Late fees\nand interest charges star", "created_at": "2026-01-03"}
{"id": "cf1fa723-f1bb-4f23-8704-bbafee4a369c", "doc_id": "7422d453-c8d6-4a1e-a18f-4034872af9e1", "title": "Www Kwsp.Gov", "source_file": "pdfs\\www_kwsp.gov.pdf", "chunk_index": 1, "text": "onsequences.\nReality check (month 3)\nBy the third month, reality began to set in. Juggling multiple BNPL\npayments alongside other expenses strained Shasha’s budget. Late fees\nand interest charges started accumulating, adding to the initial allure's\nhidden costs. What once seemed convenient now burdened her financially.\nFinancial strain (month 6)\nAfter six months of using BNPL, Shasha began feeling overwhelmed by her\ngrowing debts and stress. She found herself meticulously tracking every\nringgit spent each day, while wistfully watching her friends enjoy outings.\nThe thrill of instant gratification had faded, leaving Shasha feeling\nregretful and worried about her money situation.\nLessons learned (year 1)\nReflecting on a year of BNPL, Shasha grasped the importance of financial\ndiscipline. BNPL taught her valuable lessons about responsible spending\nand the true cost of convenience. She vowed to prioritise saving and\nbudgeting over impulse purchases, understanding that financial stability\noutweighs momentary desires.\nUsing BNPL to your advantage\nHere’s my take on BNPL: It's a game-changer for grabbing those musthave items without immediately draining your bank account. Depending\non how you approach it, BNPL can be your financial ally or bring\nunexpected challenges. Personally, budgeting for BNPL payments\nalongside my regular expenses has boosted my financial discipline. It has\ntransformed my shopping habits, making BNPL not just a convenience but\na tool for smarter spending and be", "created_at": "2026-01-03"}
{"id": "cea50844-4b49-4696-99d0-7c334995db60", "doc_id": "7422d453-c8d6-4a1e-a18f-4034872af9e1", "title": "Www Kwsp.Gov", "source_file": "pdfs\\www_kwsp.gov.pdf", "chunk_index": 2, "text": "ng for BNPL payments\nalongside my regular expenses has boosted my financial discipline. It has\ntransformed my shopping habits, making BNPL not just a convenience but\na tool for smarter spending and better financial planning.\nUnderstanding its benefits and risks helps you enjoy BNPL's perks without\nbeing caught off guard, paving the way for smarter financial decisions and\npeace of mind. So, think about it — approach it wisely or consider avoiding\nit altogether!\n\nRecommended for you: Reward Yourself Without Hurting Your Financial\nGoals\nEN\nShare    \nRelated Reads\nPERSONAL FINANCE\n4 Things To Avoid When Planning Your Retirement\nPERSONAL FINANCE\nWhere To Splurge Vs. Save When Traveling\nHOUSING\nBuy Or Rent — What’s Right For You?\nMember Employer\nRegister As A Member Introduction\nGrow Your Savings Responsibilities\nManage Your EPF Account Online Platform\nHome Ownership Employers Education Programme\nFinancial Life Stages\nHealth Protection\nKWSP i-Akaun App\nCorporate Others\nAbout Us Terms & Conditions\nOrganisational Structure Privacy Policy\nCorporate Governance Security Policy\nInvestment Disclaimer\nSustainability Online Security Tips\nBusiness Partners Other Links\nNews & Highlights Forms\nCareers Resource Centre\nProcurement Achievements\nWhistleblowing & Anti‑Fraud\nContact Us", "created_at": "2026-01-03"}
